[
  {
    "id": "0603226",
    "title": "One-way Quantum Computation - a tutorial introduction",
    "summary": "In this book chapter, we provide a tutorial introduction to one-way quantum computation and many of the techniques one can use to understand it. The techniques which are described include the stabilizer formalism and the logical Heisenberg picture. We highlight ways in which it is useful to understand one-way computation beyond simple equivalence with the quantum circuit model. We briefly review current proposals of implementations and experimental progress and summarize some recent related theoretical developments. Although the chapter is primarily didactic in focus, we include a number of new methods and observations. These include: a simpler and more compact formulation of one-way quantum computation in the stabilizer formalism; A new way of implementing unitaries diagonal in the computational basis; New results on the family of operations which may be implemented in a single round of measurements; A method for constructing compact one-way patterns by decomposing unitaries in terms of diagonal unitaries and Clifford group transformations.",
    "authors": "Dan E. Browne, Hans J. Briegel",
    "published": "2006-03-24T18:08:41Z",
    "link": "http://arxiv.org/abs/quant-ph/0603226v2",
    "source": "arXiv",
    "citation_id": 1
  },
  {
    "id": "2307.08956",
    "title": "Introduction to Haar Measure Tools in Quantum Information: A Beginner's Tutorial",
    "summary": "The Haar measure plays a vital role in quantum information, but its study often requires a deep understanding of representation theory, posing a challenge for beginners. This tutorial aims to provide a basic introduction to Haar measure tools in quantum information, utilizing only basic knowledge of linear algebra and thus aiming to make this topic more accessible. The tutorial begins by introducing the Haar measure with a specific emphasis on characterizing the moment operator, an essential element for computing integrals over the Haar measure. It also covers properties of the symmetric subspace and introduces helpful tools like tensor network diagrammatic notation, which aid in visualizing and simplifying calculations. Next, the tutorial explores the concept of unitary designs, providing equivalent definitions, and subsequently explores approximate notions of unitary designs, shedding light on the relationships between these different notions. Practical examples of Haar measure calculations are illustrated, including the derivation of well-known formulas such as the twirling of a quantum channel. Lastly, the tutorial showcases the applications of Haar measure calculations in quantum machine learning and classical shadow tomography.",
    "authors": "Antonio Anna Mele",
    "published": "2023-07-18T03:50:54Z",
    "link": "http://arxiv.org/abs/2307.08956v4",
    "source": "arXiv",
    "citation_id": 2
  },
  {
    "id": "1603.03039",
    "title": "Hand-waving and Interpretive Dance: An Introductory Course on Tensor Networks",
    "summary": "The curse of dimensionality associated with the Hilbert space of spin systems provides a significant obstruction to the study of condensed matter systems. Tensor networks have proven an important tool in attempting to overcome this difficulty in both the numerical and analytic regimes. These notes form the basis for a seven lecture course, introducing the basics of a range of common tensor networks and algorithms. In particular, we cover: introductory tensor network notation, applications to quantum information, basic properties of matrix product states, a classification of quantum phases using tensor networks, algorithms for finding matrix product states, basic properties of projected entangled pair states, and multiscale entanglement renormalisation ansatz states. The lectures are intended to be generally accessible, although the relevance of many of the examples may be lost on students without a background in many-body physics/quantum information. For each lecture, several problems are given, with worked solutions in an ancillary file.",
    "authors": "Jacob C. Bridgeman, Christopher T. Chubb",
    "published": "2016-03-09T21:00:02Z",
    "link": "http://arxiv.org/abs/1603.03039v4",
    "source": "arXiv",
    "citation_id": 4
  },
  {
    "id": "0803.1091",
    "title": "A Primer in Quantum Mechanics for NMR Students",
    "summary": "An introduction in quantum mechanical theory for NMR students which covers basic concepts and calculations.",
    "authors": "V. V. Korostelev",
    "published": "2008-03-07T20:14:35Z",
    "link": "http://arxiv.org/abs/0803.1091v1",
    "source": "arXiv",
    "citation_id": 5
  },
  {
    "id": "2106.00005",
    "title": "Quantum Federated Learning with Quantum Data",
    "authors": "Mahdi Chehimi, Walid Saad",
    "summary": "Quantum machine learning (QML) has emerged as a promising field that leans on the developments in quantum computing to explore large complex machine learning problems. Recently, some purely quantum machine learning models were proposed such as the quantum convolutional neural networks (QCNN) to perform classification on quantum data. However, all of the existing QML models rely on centralized solutions that cannot scale well for large-scale and distributed quantum networks. Hence, it is apropos to consider more practical quantum federated learning (QFL) solutions tailored towards emerging quantum network architectures. Indeed, developing QFL frameworks for quantum networks is critical given the fragile nature of computing qubits and the difficulty of transferring them. On top of its practical momentousness, QFL allows for distributed quantum learning by leveraging existing wireless communication infrastructure. This paper proposes the first fully quantum federated learning framework that can operate over quantum data and, thus, share the learning of quantum circuit parameters in a decentralized manner. First, given the lack of existing quantum federated datasets in the literature, the proposed framework begins by generating the first quantum federated dataset, with a hierarchical data format, for distributed quantum networks. Then, clients sharing QCNN models are fed with the quantum data to perform a classification task. Subsequently, the server aggregates the learnable quantum circuit parameters from clients and performs federated averaging. Extensive experiments are conducted to evaluate and validate the effectiveness of the proposed QFL solution. This work is the first to combine Google's TensorFlow Federated and TensorFlow Quantum in a practical implementation.",
    "published": "2021-05-30T12:19:27Z",
    "link": "http://arxiv.org/abs/2106.00005v1",
    "citation_id": 3
  }
]