{"1": "arXiv:quant-ph/0603226v2  3 Oct 2006\nOne-way Quantum Computation\nDan Brownea and Hans Briegelb\naDepartments of Materials and Physics, Oxford University, United Kingdom.\nbInstitute for Theoretical Physics, University of Innsbruck and Institute for Quantum Optics\n& Quantum Information (IQOQI) of the Austrian Academy of Sciences, Austria.\n1\nIntroduction\nThe circuit model of quantum computation [1, 2, 3] has been a powerful tool for the devel-\nopment of quantum computation, acting both as a framework for theoretical investigations\nand as a guide for experiment. In the circuit model (also called the network model), unitary\noperations are represented by a network of elementary quantum gates such as the CNOT gate\nand single-qubit rotations. Many proposals for the implementation of quantum computation\nare designed around this model, including physical prescriptions for implementing the ele-\nmentary gates. By formulating quantum computation in a different way, one can gain both a\nnew framework for experiments and new theoretical insights. One-way quantum computation\n[4] has achieved both of these.\nMeasurements on entangled states play a key role in many quantum information proto-\ncols, such as quantum teleportation and entanglement-based quantum key distribution. In\nthese applications an entangled state is required, which must be generated beforehand. Then,\nduring the protocol, measurements are made which convert the quantum correlations into,\nfor example, a secret key. To repeat the protocol a fresh entangled state must be prepared.\nIn this sense, the entangled state, or the quantum correlations embodied by the state, can be\nconsidered a resource which is “used up” in the protocol.\nIn one-way quantum computation, the quantum correlations in an entangled state called\na cluster state [6] or graph state [7] are exploited to allow universal quantum computation\nthrough single-qubit measurements alone. The quantum algorithm is speciﬁed in the choice\nof bases for these measurements and the “structure” of the entanglement (as explained below)\nof the resource state. The name “one-way” reﬂects the resource nature of the graph state. The\nstate can be used only once, and (irreversible) projective measurements drive the computation\nforward, in contrast to the reversibility of every gate in the standard network model.\nIn this chapter, we will provide an introduction to one-way quantum computation, and\nseveral of the techniques one can use to describe it. In this section we will introduce graph\nand cluster states and develop a notation for general single-qubit measurements. In section 2\nwe will introduce the key concepts of one-way quantum computation with some simple ex-\namples. After this, in section 3, we shall investigate how one-way quantum computation can\n1\n", "2": "Figure 1:\nOne way quantum computation consists of single-qubit measurements in certain\nbases and in a certain order on an entangled resource state. Cluster states have a square lattice\nstructure (a) while the freedom of choosing speciﬁc general graph states such as illustrated in\n(b) can reduce the number of qubits needed for a given computation signiﬁcantly.\nbe described without using the quantum circuit model. To this end, we shall introduce a num-\nber of important tools including the stabilizer formalism, the logical Heisenberg picture and\na representation of unitary operations especially well suited to the one-way quantum compu-\ntation model. In section 4, we will brieﬂy describe a number of proposals for implementing\none-way quantum computation in the laboratory. In section 5 we will conclude with a brief\nsurvey of some recent research developments in measurement-based quantum computation.\nA different perspective of one-way quantum computation and measurement-based com-\nputation in general can be found in these recent reviews [8, 9]. A comprehensive tutorial and\nreview on the properties of graph states can be found in [10].\n1.1\nCluster states and graph states\nCluster states and graph states can be deﬁned constructively in the following way [6, 10].\nWith each state, we associate a graph, a set of vertices and edges connecting vertex pairs.\nEach vertex on the graph corresponds to a qubit. The corresponding “graph state” may be\ngenerated by preparing every qubit in the state |+⟩= (1/\n√\n2)(|0⟩+ |1⟩) and applying a\ncontrolled σz (CZ) operation |0⟩⟨0|⊗1l+|1⟩⟨1|⊗σz on every pair of qubits whose vertices are\nconnected by a graph edge. Cluster states are a sub-class of graph states, whose underlying\ngraph is an n−dimensional square grid. The extra ﬂexibility in the entanglement structure\nof graph states means that they often require far fewer qubits to implement the same one-\nway quantum computation. However, there are a number of physical implementations where\nthe regular layout of cluster states means that they can be generated very efﬁciently (see\nsection 4).\n2\n", "3": "1.2\nSingle-qubit measurements and rotations\nSingle-qubit measurements in a variety of bases play a key role in one-way quantum compu-\ntation, so here we introduce a convenient and compact way to describe them. Using a Bloch\nsphere picture, every projective single-qubit measurement can be associated with a unit vec-\ntor on the sphere, which corresponds to the +1 eigenstate of the measurement. We can then\nparameterize observables by the co-latitude θ and longitude φ of this vector (illustrated in\nﬁgure 2). We shall write this compactly as a pair of angles (θ, φ).\nUnitary operations corresponding to rotations on the Bloch sphere have the following\nform. A rotation around the k axis (where k is x, y, or z) by angle φ can be written\nUk(φ) = e−iφ\n2 σk\n(1)\nFor brevity and clarity, we will use the notation X ≡σx, etc. in the rest of this chapter. We\nalso adopt standard notation for the eigenstates of Z and X:\nZ|0⟩= |0⟩\n−Z|1⟩= |1⟩\nX|+⟩= |+⟩≡\n1\n√\n2(|0⟩+ |1⟩)\n−X|−⟩= |−⟩≡\n1\n√\n2(|0⟩−|1⟩)\n(2)\nA measurement with angles (θ, φ) corresponds to a measurement of the observable Uz(φ+\nπ/2)Ux(θ)ZUx(−θ)Uz(−φ−π/2). One way of implementing such a measurement is to ap-\nply the single-qubit unitary Ux(−θ)Uz(−φ −π/2) to the qubit before measuring it in the\ncomputational basis.\n2\nSimple examples\nMany of the features of one-way quantum computation can be illustrated in a simple two-\nqubit example. Consider the following simple protocol; a qubit is prepared in an unknown\nstate |ψ⟩= α|0⟩+ β|1⟩. A second qubit is prepared in the state |+⟩=\n1\n√\n2(|0⟩+ |1⟩). A CZ\noperation is applied on the two qubits.The state of the qubits is then\n1\n√\n2 (α|0⟩|+⟩+ β|1⟩|−⟩) .\n(3)\nThe ﬁrst qubit is now measured in the basis {(1/\n√\n2)(|0⟩± eiφ|1⟩)}, where φ is a real\nparameter. Using the notation introduced in section 1.2 this measurement is denoted (π/2, φ).\nThis corresponds, in the Bloch sphere picture, to a unit vector in the x-y plane at angle φ to\nthe x axis. There are two possible outcomes to the measurement, which occur with equal\nprobability. If the measurement returns the +1 eigenvalue, the second qubit will be projected\ninto the state\nα|+⟩+ eiφβ|−⟩.\n(4)\n3\n", "4": "Figure 2:\nSingle-qubit projective measurements will be represented by the pair of angles\n(θ, φ) of the co-latitude θ and longitude φ of their +1 eigenstate on the Bloch sphere. This\ncorresponds to a measurement of the observable Uz(φ+π/2)Ux(θ)ZUx(−θ)Uz(−φ−π/2).\nIf the −1 eigenvalue is found the state of qubit two becomes\nα|+⟩−eiφβ|−⟩.\n(5)\nWe can represent both possibilities in a compact way if we introduce the binary digit m ∈\n{0, 1} to represent a measurement outcome of (−1)m. The state of qubit two can then be\nwritten, up to a global phase,\nXmHUz(φ)|ψ⟩.\n(6)\nWe see that the unknown input state which was prepared on the ﬁrst qubit has been trans-\nferred to qubit two without any loss of coherence. In addition to this it has undergonea unitary\ntransformation: XmHUz(φ). Notice that the angle of the rotation Uz(φ) is set in the choice\nof measurement basis. The unitary transformation HUz(φ) is accompanied by an additional\nPauli transformation (X) when the measurement outcome is −1. This is a typical feature of\none-way quantum computation; due to the randomness of the measurement outcomes, any\ndesired unitary can be implemented only up to random but known Pauli transformations.\nSince these Pauli operators are an undesired by-product of implementing the unitary in the\none-way model, we call them “by-product operators” [4, 5]. As we shall see below, these ex-\ntra Pauli operations can be accounted for by altering the basis of later measurements, making\nthe scheme deterministic but introducing an unavoidable time-ordering.\nIn ﬁgure 3 (a), this protocol is represented using a graphical notation that we will use\nthroughout this chapter. The input qubit is represented by a square, and the output qubit\n4\n", "5": "Figure 3:\nThe one-way graph and measurement patterns for a) the single-qubit operation\nHUz(φ) and b) an arbitrary single-qubit operation, Uz(γ)Ux(β)Uz(α), when the measure-\nment angles are set φ1 = α, φ2 = (−1)m1β and φ3 = (−1)m2γ, and ma is the binary\nmeasurement outcome of the measurement on qubit a. Note that this imposes an ordering\nin the measurements of this pattern. This second pattern is made by composing three copies\nof the pattern (a) with differing measurement angles as described in the text. Pattern (c)\nimplements a CZ operation. Input and output qubits coincide for this pattern.\nby a lozenge, a smaller square tilted at 45◦. The CZ operation applied to the two qubits is\nrepresented by a line between them. This is an example of a one-way graph and measurement\npattern, or “one-way pattern” for short, a convenient representation which speciﬁes both the\nentanglement graph for the resource state and the measurements required to implement a\nunitary operation (always up to a known but random Pauli transformation) in the one-way\nmodel. As an alternative to this graphical approach, an algebraic representation of one-way\npatterns called the “measurement calculus” has been developed recently [12].\nSo far, the protocol described above seems rather different from the description of one-\nway quantum computation as a series of measurements on a special entangled resource state.\nWe shall see below how the two pictures are related. First however, we show how one-way\npatterns may be connected together to perform consecutive operations.\n2.1\nConnecting one-way patterns - arbitrary single-qubit operations\nDue to Euler’s rotation theorem any single-qubit SU(2) rotation can be decomposed as a prod-\nuct of three rotations Uz(γ)Ux(β)Uz(α). Thus, by repeating the simple two-qubit protocol\nthree times, any arbitrary single-qubit rotation may be obtained (up to an extra Hadamard,\nwhich can be accounted for). Two one-way patterns are combined as one would expect, the\noutput qubit(s) of one pattern become the input qubit(s) of the next. The main issue in con-\nnecting patterns together is to track the effect of the Pauli by-product operators which have\naccumulated due to the previous measurements.\nConcatenating the two-qubit protocol three times, with different angles φ1, φ2 and φ3\ngives the one-way pattern illustrated in ﬁgure 3 (b). To see the effect of the by-product\noperators from each measurement, let us label the binary outcome from each ma. The unitary\nimplemented by the combined pattern is therefore\nU = HZm3Uz(φ3)HZm2Uz(φ2)HZm1Uz(φ1).\n(7)\n5\n", "6": "Since HZH = X and HUz(φ)H = Ux(φ) this can be rewritten\nHZm3Uz(φ3)Xm2Ux(φ2)Zm1Uz(φ1).\n(8)\nWe can rewrite this further using the identities XUz(φ) = Uz(−φ)X and ZUx(φ) = Ux(−φ)Z,\nXm3Zm2Xm1HUz((−1)m2φ3)Ux((−1)m1φ2)Uz(φ1).\n(9)\nNow we have split up the operation in the same way as the two-qubit example, a unitary\nplus a known Pauli correction. In this case, however, this unitary is not deterministic – the\nsign of two of the rotations depends on two of the measurements. Nevertheless, if we perform\nthe measurements sequentially and choose measurement angles φ1 = α, φ2 = (−1)m1β and\nφ3 = (−1)m2γ, we obtain deterministically the desired single-qubit unitary.\nThe dependency of measurement bases on the outcome of previous measurements is a\ngeneric feature of one-way quantum computation, occurring for all but a special class of oper-\nations, the Clifford group (described below). This dependency means that there is a minimum\nnumber of time-steps in which any one-way quantum computation can be implemented, as\ndiscussed further in section 3.\nThe Pauli corrections remaining at the end of the implemented one-way quantum compu-\ntation are unimportant and never need to be physically applied; they can always be accounted\nfor in the interpretation of the ﬁnal measurement outcome. For example, if the ﬁnal state is\nto be read out in the computational basis any extra Z operations commute with the measure-\nments and have no effect on their outcome. Any X operations simply ﬂip the measurement\nresult, and thus can be corrected via classical post-processing.\n2.2\nGraph states as a resource\nIt is worth discussing how the above description of one-way patterns relates to the descrip-\ntion of one-way quantum computation in the introduction, namely as measurements on an\nentangled resource state. The ﬁrst observation is that, given a one-way pattern, all of the\nmeasurements can be made after all the CZ operations have been implemented. Secondly,\nquantum algorithms usually begin by initializing qubits to a ﬁducial starting state. This state\nis usually |0⟩on each qubit, but the state |+⟩would be equally suitable. When the input\nqubits of a one-way graph measurement pattern are prepared in |+⟩, then the entangled state\ngenerated by the CZ gates is a graph state. Thus the graph state can be considered a resource\nfor this quantum computation. We shall see in section 4 that for certain implementations,\nsuch as in linear optics, the resource description is especially apt.\n2.3\nTwo-qubit gates\nSo far we have seen how an arbitrary single-qubit operation could be achieved in one-way\nquantum computation in a simple linear one-way pattern. However, for universal quantum\ncomputation, entangling two-qubit gates are necessary. One such gate is a CZ gate. There is a\nparticularly simple way in which the CZ can be implemented within the one-way framework.\nThis is simply to use the CZ represented by a single graph-state edge to implement the CZ\ndirectly. This leads to the one-way pattern illustrated in ﬁgure 2 (c). Notice that here the input\nqubits are also the output qubits. This is indicated by the superimposed squares and lozenges.\n6\n", "7": "2.4\nCluster-state quantum computing\nIn a number of proposed implementations of one-way quantum computation (see section 4)\nsquare lattice cluster states can be generated efﬁciently and arbitrarily connected graph states\nare hard to make. The simple method outlined above for the construction of one way pat-\nterns will usually lead to graph state layouts which do not have a square lattice structure.\nNevertheless, a cluster state on a large enough square lattice of two or more dimensions is\nstill sufﬁcient to implement any unitary [4]. A number of measurement patterns for quantum\ngates designed speciﬁcally for two-dimensional square lattice cluster states can be found in\n[5].\n3\nBeyond quantum circuit simulation\nWe have shown that the one-way quantum computer can implement deterministically a uni-\nversal set of gates and thus any quantum computation. However, part of the power of one-way\nquantum computation derives from the fact that unitary operations can be implemented more\ncompactly than a naive network construction would suggest [11]. In fact we shall see in the\nfollowing sections that other ways of decomposing unitary operations are more natural and\nuseful. The main tool we shall use in our investigation of these properties is the stabilizer\nformalism.\n3.1\nStabilizer formalism\nThe stabilizer formalism [13, 14] is a powerful tool for understanding the properties of graph\nstates and one-way quantum computation. Stabilizer formalism is a framework whereby\nstates and sub-spaces over multiple qubits are described and characterized in a compact way\nin terms of operators under which they are invariant. In standard quantum mechanics one\nuses complete sets of commuting observables in a similar fashion, such as in the description\nof atomic states by “quantum numbers” (see e.g. [17]).\nAn operator K stabilizes a subspace S when, for all states |ψ⟩∈S,\nK|ψ⟩= |ψ⟩.\n(10)\nIn other words, |ψ⟩is an eigenstate of K with eigenvalue +1.\nIn the stabilizer formalism one focuses on operators which, in addition to this stabilizing\nproperty, are Hermitian members of the Pauli group, i.e. tensor products of Pauli and identity\noperators. The key principle of the stabilizer formalism is to identify a set of such stabilizing\noperators which uniquely deﬁnes a given state or sub-space - i.e. there is no state outside the\nsub-space (for a speciﬁed system) which the same set of operators also jointly stabilizes. The\nsub-spaces (and states) which can be deﬁned uniquely using stabilizing operators from the\nPauli group are called stabilizer sub-spaces (or stabilizer states).\nStabilizer states and sub-spaces occur widely in quantum information science and include\nBell states, GHZ states, many error-correcting codes, and, of course, graph states and cluster\nstates. Note that there are other joint eigenstates of the stabilizing operators with some −1\neigenvalues. However, only states with +1 eigenvalue are “stabilized”, by deﬁnition. This\n7\n", "8": "set of operators then embodies all the properties of the state and can allow an easier analysis,\nfor example, of how the state transforms under measurement and unitary evolution. Since the\nproduct of two stabilizing operators is itself stabilizing, the set of operators which stabilize\na sub-space has a group structure. It is called the stabilizer group or simply the stabilizer of\nthe sub-space. The group can be compactly expressed by identifying a set of generators. For\na k-qubit sub-space in an n qubit system, n −k generators are required (see exercise 2).\nWe do not have enough space here for a detailed introduction to all of the techniques\nof stabilizer formalism – excellent introductions can be found in [3, 13] – but instead we\nwill focus on those which are useful for understanding one-way quantum computation. Most\nwill be stated without proof but can be veriﬁed using the properties of Pauli group operators\ndescribed in [3].\nA simple example of a stabilizer state is the state |+⟩. Its stabilizer group is generated by\nX alone. The stabilizer for the tensor product state |+⟩⊗n is then generated by n operators\nKa = Xa acting on each qubit a. From this we can derive the stabilizer generators for\ngraph states. Consider a stabilizer state transformed by the unitary transformation V . The\nstabilizers of the transformed state are then given by V KaV †. Since the CZ gate transforms\nX ⊗1l to X ⊗Z under conjugation, we ﬁnd that the stabilizer generators for graph states have\nthe form\nKa = Xa\nY\nb∈N(a)\nZb\n(11)\nfor every qubit a in the graph. N(a) is the neighbourhood of a, i.e. the set of qubits sharing\nedges with a on the graph (this corresponds to nearest neighbours in a cluster state).\n3.2\nA logical Heisenberg picture\nWe are going to use the stabilizer formalism to understand the one-way patterns which im-\nplement unitary transformations in the one-way model. We shall see that it is convenient to\ndescribe logical action of a one-way pattern in a logical Heisenberg picture [14].\nThe Schr¨odinger picture is the most common approach to describing the time-evolution\nof quantum systems. Temporal changes in the system are reﬂected in changes in the state\nvector or density matrix, e.g. for unitary evolution |ψ⟩7→U(t)|ψ⟩or ρ 7→U(t)|ψ⟩ρU(t)†.\nThe observables which characterize measurable quantities, such as Pauli observables X, Y\nand Z, remain invariant in time. In the Heisenberg picture, on the other hand, time-evolution\nis carried exclusively by physical observables which evolve O(t) 7→U(t)†OU(t). States and\ndensity matrices remain constant in time.\nA logical Heisenberg picture, also called a “Heisenberg representation of quantum com-\nputation” [14], is a middle-way between these two approaches, containing elements of both.\nWe shall introduce it with an example, starting in the Schr¨odinger picture with a single-qubit\ndensity matrix ρ(t) evolving in time. Since the n-qubit Pauli-group operators form a basis in\nthe vector space of n-qubit Hermitian operators, we can write ρ at time t = 0 as\nρ(t = 0) = a 1l + b X + c Y + d Z\n(12)\nwhere a, b, c and d are real parameters which deﬁne the state.\n8\n", "9": "At time t, the state has been transformed through unitary U(t). In the usual Schr¨odinger\npicture one would reﬂect this in a transformation of the matrix elements of the state, or,\nequivalently, of the parameters a, b, c and d to a(t), b(t), etc.. However, one can also write\nρ(t) = U(t)ρU(t)† = a 1l + b U(t)XU(t)† + c U(t)Y U(t)† + d U(t)ZU(t)† .\n(13)\nBy introducing time-evolving observables X(t) = U(t)XU(t)† and similar expressions\nfor Y (t) and Z(t), we can express this as\nρ(t) = a 1l + b X(t) + c Y (t) + d Z(t) .\n(14)\nThe time evolution is thus captured by the evolution of these logical observables, and the\nparameters a, b, c and d remain ﬁxed. Since X(t), Y (t), etc. deﬁne the logical basis in which\nρ is expressed, we call them logical observables.\nSince Y (t) = iX(t)Z(t), determining X(t) and Z(t) speciﬁes the evolution U(t) com-\npletely. More generally, an n-qubit unitary is deﬁned in this picture by the evolution of X(t)a\nand Z(t)a for each qubit a. It is important to emphasise that the logical observables X(t),\nY (t), and so forth, are no longer equal to the physical observables X, Y etc. which remain\nconstant in time. Here time evolution is characterized by the evolution of logical observables.\nIn analogy to the (standard) Heisenberg picture, where physical observables evolve in time,\nwe call this a logical Heisenberg picture1.\nThe logical Heisenberg picture can be illustrated with some simple examples. First, let\nus consider a Hadamard U(t) = H. This is represented in the logical Heisenberg picture\nthrough X(t) = Z and Z(t) = X. Second, let us look at the representation of the SWAP\ngate in this picture. We ﬁnd that X1(t) = X2 and X2(t) = X1 (similarly for the Z variables).\nThe logical Heisenberg picture clearly encapsulates the action of these gates; in the case of\nthe Hadamard, we see X and Z interchanged and for SWAP, the operators on the two qubits\nare switched round. In the one-way quantum computer logical time evolution is discrete and\ndriven by single-qubit measurements, so in the following we will often suppress the time\nlabelling t.\nA logical Heisenberg picture becomes particularly useful when describing the encoding\nof quantum information. As well as density matrices, one can also represent the evolution of\npure state vectors in a logical Heisenberg picture. The time evolution is carried by the logical\nbasis states, the joint eigenstates of Z(t)a with phase relations ﬁxed by X(t)a. Consider a\nstate |ψ⟩= α|0⟩+ β|1⟩imagine we encode it via some unitary transformation U. We would\nwrite |ψ⟩= αU|0⟩+ βU|1⟩= α|0′⟩+ β|1′⟩, where |0′⟩and |1′⟩are the new (encoded)\nlogical basis states. Thus “encoding” implicitly adopts a logical Heisenberg picture. The\nstate coefﬁcients remain constant while logical basis vectors are transformed.\n3.3\nDynamical variables on a stabilizer sub-space\nThis formalism can be combined with the stabilizer formalism to track the evolution of logical\nobservables on a sub-space of a larger system. The stabilizer group then deﬁnes the logical\n1In geometric terms, evolution in the Schr¨odinger picture corresponds to an active transformation of a state.\nA logical Heisenberg picture corresponds to a passive transformation – the state remains ﬁxed with respect to a\nchanging logical basis.\n9\n", "10": "sub-space, and the dynamical logical operators track the evolution of this sub-space. The\nlogical operators act only to map states around the sub-space, therefore they must commute\nwith the stabilizers of that sub-space.\nLet us use the well-known three-qubit error correcting code as an example. In this code,\nthe logical |0⟩is represented by |0⟩|0⟩|0⟩and |1⟩by |1⟩|1⟩|1⟩. The stabilizer group for this\nsub-space is generated by Z ⊗Z ⊗1l and 1l ⊗Z ⊗Z. The logical observables associated\nwith this basis are Z = Z ⊗1l ⊗1l and X = X ⊗X ⊗X. One can easily verify that these\noperators have the desired action on the logical basis states.\nHowever, even though the logical basis is entirely symmetric under interchange of the\nqubits, the logical Z is not. Due to the symmetry of the situation one would expect that\n1l ⊗Z ⊗1l and 1l ⊗1l ⊗Z would be equivalent to the physical representation of Z we have\nchosen above. That these operators have the same action on the logical basis states is easy\nto conﬁrm and it reﬂects an important characteristic of logical operators on a sub-space,\nnamely that they are not unique. Given a stabilizer operator for the sub-space Ka and logical\noperator L, the product KaL has the same action on the logical sub-space as L. Thus there\nare a number of physical representations for a given logical observable. Formally this set is\nin fact a coset of the stabilizer group. In order to deﬁne this set, only one member of the set\nneed be speciﬁed. When we write a particular physical operator corresponding to L this is\njust a “representative” of the whole coset.\n3.4\nOne-way patterns in the stabilizer formalism\nWe introduced the term “one-way pattern” to describe a layout of qubits, graph state edges\nand measurements which implements a given unitary in the one-way model. More speciﬁ-\ncally, the patterns contain a set of qubits labelled input qubits and a set labelled output qubits,\na set of auxiliary qubits and a set of edges connecting those qubits. We will now show\nhow, using the rules for transforming stabilizer sub-spaces under measurement, that the one-\nway pattern will lead to the transformation of the logical operators Xa 7→±UXa′U † and\nZa 7→±UZa′U †. This is a logical Heisenberg picture representation of the desired unitary\nU, plus the displacement of the logical state from input qubit(s) a to output qubit(s) a′. The\nextra factor ±1 reﬂects the presence of by-product operators (due to the randomness of the\nmeasurement outcomes) since XZX = −Z and ZXZ = −X.\n3.5\nPauli measurements\nBefore we consider one-way patterns with general one-qubit measurements, let us ﬁrst con-\nsider patterns consisting solely of Pauli measurements. These measurements change the log-\nical variables’ encoding according to the desired evolution of the logical state. As the logical\nevolution is unitary, each measurement must reveal no information about the logical state. By\nconsidering commutation relations, one can show that these requirements are equivalent to\ndemanding that the measured observable anti-commute with at least one stabilizer generator.\nThe effect of performing a measurement of a (multi-qubit) Pauli observable Σ on a sub-\nspace is as follows (such methods are described in more detail in [3]). If Σ does not commute\nwith the complete stabilizer group, one can always construct a set of stabilizer generators such\nthat only one of the generators Ka anti-commutes with Σ. The stabilizers which commute\n10\n", "11": "n input\nqubits\nn output\nqubits\n{\n{\nFigure 4:\nAny n-qubit Clifford group operation may be implemented (up to local Clifford\ncorrections) by a one-way pattern with 2n-qubits. Dotted lines represent possible edges in\nthe patterns.\nwith Σ must also stabilize the transformed sub-space after the measurement, which will be\nan eigenspace of Σ with eigenvalue ±1. Thus ±Σ will itself belong to the new stabilizer.\nWe can thus construct a set of generators for the stabilizer of the transformed sub-space, by\nsimply replacing Ka, which anti-commutes with Σ, with ±Σ.\nThe logical observables transform in a similar way. This time, just one member of the\ncoset for each logical observable needs to be found which commutes with Σ. If the represen-\ntative logical operator L commutes with Σ it remains a valid representative logical operator\nafter the measurement (the full coset will be different though due to the changed stabilizer).\nIf L does not commute with Σ, then the product LKa does commute, so logical operators for\nthe transformed sub-space are easy to ﬁnd.\nA ﬁnal step involves ﬁnding a reduced description of the state which ignores the now\nunimportant measured qubit. This is achieved by choosing a set of stabilizer generators where\nall but one (±Σ itself) act as the identity on the measured qubit. This is achieved by multi-\nplying all the generators not already in this form with ±Σ. In the same way representative\nlogical operators can be chosen that are also restricted to the unmeasured qubits.\nAfter all but the designated output qubits in a pattern have been measured, the one-way\npattern has been completed. The reduced description of the output qubits has a stabilizer\ngroup consisting of the identity operator alone and logical operators have become Xa =\n±UXa′U † and Za = ±UZa′U †. We interpret this in the logical Heisenberg picture. The\none-way pattern has implemented the unitary transformation U plus known Pauli corrections\nand the logical sub-space has been physically displaced from the input qubits a to output\nqubits a′.\nThis method can be used to design and verify one-way patterns (e.g. see Exercise 3). It\n11\n", "12": "2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\n2\n3\n4\n1\nNo. 1\nNo. 2\nNo. 3\nNo. 4\nNo. 5\nNo. 6\nNo. 7\nNo. 8\nNo. 9\nNo. 10\nNo. 11\nFigure 5: The full orbit of locally equivalent four-qubit graph states. Each graph state is\nobtained from the previous one by application of the “local complementation rule”. This\nﬁgure is taken from M. Hein, J. Eisert and H.J. Briegel, Phys. Rev. A 69, 062311 (2004)\nc⃝APS.\nmay seem complicated for such simple examples, but its power lies in its generality. In the\nnext section, we show how measurement patterns for arbitrary Clifford operations may be\nevaluated using these techniques.\n3.6\nPauli measurements and the Clifford group\nIn the previous section, all of the transformations of the logical observables keep their phys-\nical representations within the Pauli group. Unitary operators which map Pauli group op-\nerators to the Pauli group under conjugation are known as Clifford group operations. The\nClifford group is the group generated by the CZ, Hadamard and Uz(π/2) gates. Since all of\nthese gates can be implemented by one-way patterns with Pauli measurements only (i.e. by\nchoosing φ = 0 or φ = π/2 in ﬁgure 3 (a)) any Clifford group operation can be achieved by\nPauli measurements alone.\nThe Clifford group plays an important role in quantum computation theory. Clifford\ngroup circuits are the basis for most quantum error correction schemes, and many interesting\nentangled states (including, of course, graph states) can be generated via Clifford group oper-\nations alone. However, Gottesman and Knill [14] showed that notwithstanding this, Clifford\ngroup circuits acting on stabilizer states (such as the standard input |0⟩⊗n) can be simulated\nefﬁciently on a classical computer [15, 16]. This is because of the simple way the logical\nobservables transform (in the logical Heisenberg picture) under such operations.\nLet us consider the effect of the by-product Pauli operators, generated every time a mea-\nsurement outcome is −1, when Clifford operations are implemented in the one-way quantum\ncomputer. Given a Clifford operation C, by the deﬁnition of the Clifford group, CΣC† = Σ′\nwhere Σ and Σ′ are Pauli group operators. Therefore CΣ = Σ′C meaning that interchanging\n12\n", "13": "the order of Clifford operators and Pauli corrections will leave the Clifford operation un-\nchanged. This means that there is no need to choose measurement bases adaptively. We thus\nsee that in any one-way quantum computation all Pauli measurements can be made simulta-\nneously in the ﬁrst measurement round.\nThese results imply that Pauli measurements on stabilizer states will always leave behind\na stabilizer state on the unmeasured qubits. Additionally, any stabilizer state can be trans-\nformed to a graph state by local Clifford operations [19, 20]. Furthermore, this graph state is\nin general not unique, by further local Clifford operations a whole family of locally equiva-\nlent graph states can be achieved [7, 20]. The rules for this local equivalence are simple – a\ngraph can be transformed into another locally equivalent graph by “local complementation”\n[20] which is a graph-theoretical primitive [21]. In local complementation, a particular vertex\nof the graph is singled out and the sub-graph given by all vertices connected to it is “comple-\nmented” (i.e. all present edges are removed and any missing edges are created). The set of\nlocally equivalent four-qubit graph states is illustrated in ﬁgure 5.\nThis theorem allows us to understand the effect of Pauli measurements on a graph state\nin a new way. Any Pauli measurement on a graph state simply transforms it (up to a local\nClifford correction) into another graph state. A graphical description of how the graph is\ntransformed and which local corrections must be applied can be found in [7, 18]. The rule for\nZ-measurements is simple, the measured qubit and all edges connected to it are removed from\nthe graph. If the -1 eigenvalue was measured, extra Z transformations on the adjacent qubits\nmust be applied to bring the state to graph state form. Rules for X and Y measurements are\nmore complicated and can be found in [7].\nSince the effect of Pauli measurements is to just transform the graph, given any one-way\npattern containing Pauli measurements, the transformation rules can be used to ﬁnd a one-\nway pattern which implements the same operation with fewer qubits. The local corrections\ncan often be incorporated in the bases of remaining measurements. If not they lead to an\nadditional local Clifford transformation on the output qubit. Since the Pauli measurements\ncorrespond to the implementation of Clifford group operations, this leads to a stronger result\nthan the Gottesman-Knill theorem. All Clifford operations, wherever they occur in the quan-\ntum computation are reduced to classical pre-processing of the one-way pattern. A further\nconsequence is that any n-qubit Clifford group operation can be implemented (up to the local\nClifford corrections) on a 2n qubit pattern, as illustrated in ﬁgure 4.\n3.7\nNon-Pauli measurements\nThe method above does not yet allow us to treat non-Pauli measurements, speciﬁed by mea-\nsurement directions other than along the X-, Y - or Z-axis. However, one can still treat such\nmeasurements within the stabilizer formalism. The stabilizer eigenvalue equations (equa-\ntion (10)) can be rearranged to generate a family of non-Pauli unitary operations which also\nstabilize the sub-space [5]. Consider the state |ψ⟩stabilized by operator Z ⊗X. We rearrange\nthe stabilizer equation as follows\nZ ⊗X|ψ⟩= |ψ⟩\nZ ⊗1l|ψ⟩= 1l ⊗X|ψ⟩\n(Z ⊗1l −1l ⊗X) |ψ⟩= 0\n(15)\n13\n", "14": "thus for all φ,\nexp\n\u0014\niφ\n2 (Z ⊗1l −1l ⊗X)\n\u0015\n|ψ⟩= |ψ⟩.\n(16)\nThus we have a unitary Uz(−φ) ⊗Ux(φ) which itself stabilizes |ψ⟩. This implies that\nUz(φ) ⊗1l|ψ⟩= 1l ⊗Ux(φ)|ψ⟩.\n(17)\nSimilar unitaries and similar expressions can be generated from any stabilizer operator.\nWe will show in the next section, how this technique allows a simple analysis of the one-way\npattern for general unitaries diagonal in the computational basis, and in fact, the technique\nallows one to understand any one-way pattern solely within the stabilizer formalism and\nwas used to design and verify many of the gate patterns presented in [5]. This indicates\nthat the effect of non-Pauli measurements in a one-way quantum computation can always\nbe understood as the implementation of a generalized rotation exp[−i(φ/2)Σ] where Σ can\nbe any n-qubit Pauli group operator. We shall discuss the consequences of this further in\nsection 3.9.\n3.8\nDiagonal unitaries\nEarlier in the chapter we saw that a CZ gate can be implemented such that the input qubit is\nalso the output qubit. Coinciding input and output qubits in a one-way pattern reduces the\nsize of the pattern so it is natural to ask which unitaries can be implemented this way and one\ncan show (see exercise 4) that it is only those unitaries diagonal in the computational-basis.\nIn fact, there is a simple one-way pattern for any diagonal unitary transformation. Any such\nn-qubit operator can be written (up to a global phase) in the following form\nDn =\nY\n⃗m\nexp[iφ⃗m\n2 (Z1)m1(Z2)m2 · · · (Zn)mn]\n(18)\nwhere (Za)ma is equal to the identity if ma = 0 and Z acting on qubit a when ma = 1, and\nthe sum is over all binary vectors ⃗m of length n.\nEach element of this product is a generalized rotation acting on a subset of the qubits\nand has a very simple implementation in the one-way quantum computer. To illustrate this,\nconsider the two-qubit transformation e−i φ\n2 Z⊗Z. This can be implemented on a one-way\npattern with three qubits as illustrated in ﬁgure 6. In this pattern the qubits labelled 1 and\n2 are the joint input-output qubits, and qubit a is an ancilla. The entanglement graph has\ntwo edges connecting a to 1 and 2. A measurement in basis (−φ, −π/2), i.e. of observable\nUx(−φ)ZUx(φ), implements e−i φ\n2 Z1Z2 on the input state, with by-product operator Z1Z2.\nTo see this, we recall that the stabilizer for the sub-space corresponding to such a graph\nis XaZ1Z2. The corresponding eigenvalue equation can be transformed, as described in the\nprevious section, to generate the stabilizing unitary [Ux(θ)]aei θ\n2 Z1Z2. Measuring qubit a in\nbasis (−φ, −π/2) is equivalent to performing [Ux(φ)]a and then measuring Za, hence the\none-way pattern implements the logical unitary e−i φ\n2 Z1Z2.\n14\n", "15": "Figure 6: The one-way pattern which implements the unitary “double-z rotation” e−i θ\n2 Z⊗Z.\nNote that input and output qubits coincide.\nFigure 7:\nArbitrary diagonal unitaries, may be implemented in a single round of measure-\nments by measurement patterns with coinciding input and output qubits. This example shows\nan arbitrary diagonal three-qubit unitary exp[ i\n2(θ1Z ⊗1l ⊗1l + θ21l ⊗Z ⊗1l + θ31l ⊗1l ⊗Z +\nθ4Z ⊗1l ⊗Z + θ5Z ⊗Z ⊗1l + θ61l ⊗Z ⊗Z + θ7Z ⊗Z ⊗Z)]. For example, by setting the\nangles to θ1 = θ2 = θ3 = θ7 = −π/4 and θ4 = θ5 = θ6 = π/4, we obtain a control-control\nZ gate or “Toffoli-Z gate”. See [5] for a cluster-state implementation of this gate.\n15\n", "16": "We can generalize this pattern to quite general n-qubit diagonal unitaries. (Verify this in\nexercise 5). For example, the pattern for an arbitrary diagonal three-qubit unitary is given in\nﬁgure 7. This is a highly parallelized and efﬁcient implementation of the unitary2.\nSince the by-product operators for these patterns are diagonal themselves they commute\nwith the desired logical diagonal unitaries. Thus there is no dependency in the measure-\nment bases on the outcome of measurements within this pattern and all measurements can\nbe achieved in a single measurement round. Thus, not only can a quantum circuit consisting\nof Clifford gates alone be implemented in a single-time step – this is true for any diagonal\nunitary followed by a Clifford network.\n3.9\nGate patterns beyond the standard network model – CD-decomposition\nWe have seen that one can construct one-way patterns to implement a unitary operation de-\nscribed by a quantum circuit by simply connecting together patterns for the constituent gates.\nFurthermore, such patterns can be made more compact by evaluating the graph state trans-\nformations corresponding to any Pauli measurements present. This can change the structure\nof the pattern such that the original circuit is hard to recognize (see for example, the quantum\nFourier transform patterns in [7]).\nWe have also seen that non-Pauli measurements in a measurement pattern lead to gen-\neralized rotations on the logical state of the form exp[−(i/2)φΣ] where Σ is some Pauli\ngroup operator.\nThe implementation of any non-Clifford unitary on the one-way quan-\ntum computer is thus best understood as a sequence of operators of this form. Two such\noperators exp[−(i/2)φΣ] and exp[−(i/2)φ′Σ′] may, if [Σ, Σ′] = 0 be combined to give\nexp[−(i/2)[φΣ + φ′Σ′]. In general, any operators of the form exp[(i/2)[P\na αaΣa], where\n[Σa, Σa′] = 0, can be diagonalized by a Clifford group element C to CDC†, where D is a\ndiagonal unitary. Composing two operations this form, e.g C1D1C†\n1 and C2D2C†\n2 will give\nC1D1C†\n1C2D2C†\n2 = C1D1C3D2C†\n2 where C3 = C†\n1C2, and we call the casting of a unitary\nin this form a CD-decomposition.\nThere are several observations to be made about such decompositions. We have already\nseen that both diagonal unitaries and Clifford group operations have compact implementa-\ntions in one-way quantum computations. This means that CD-decompositions are very use-\nful in the design of compact one-way patterns. One simply combines te one-way patterns for\ndiagonal unitaries presented above with patterns for Clifford operations, which we have seen\nrequire at most 2n qubits for an n-qubit operation and which can be constructed either by em-\nploying Pauli transformation rules on a pattern for a network of CZ, Hadamard and Uz(π/2)\ngates, or by inspection of the logical Heisenberg form of the operation. In [5] this decompo-\nsition, together with stabilizer techniques described above, was used to design cluster-state\nimplementations for several gates and simple algorithms including controlled Z-rotations and\nthe quantum Fourier transform (QFT).\nA further advantage in working with a CD-decomposition is that it immediately provides\nan upper bound in the number of time steps needed for the implementation of the one-way\n2This is reminiscent of the results reported in [22] regarding the parallelization of diagonal unitaries, where,\nhowever a different deﬁnition of parallelization is used. We treat the CZ operations generating the graphs state as\noccurring in a single time-step. Physically this is entirely reasonable as operations generated by commuting Hamil-\ntonians can often be implemented simultaneously as we shall see in our discussion of optical lattices in section 4.\n16\n", "17": "pattern. This is simply the number of “CD units” in the decomposition. We saw in section 3.8\nthat a single CD unit can be implemented in a single time step. Each CD unit in turn will cre-\nate by-product operators, which may need to be accounted for in the choice of measurement\nbases for following diagonal unitaries. A decomposition which minimised the number of CD\nunits would give a (possibly tight) upper bound on the minimal number of time-steps and\nwould be one measure of how hard the unitary is to implement in the one-way model. For\nexample, Euler’s rotation theorem tells us that the optimal CD-decomposition for an arbitrary\nrotation consists of three CD units and correspondingly requires three measurement rounds\nfor implementation on the one-way quantum computer.\nNote that there is considerable freedom in choosing a CD form. For example, one can\nconstruct the decomposition such that all the diagonal gates are solely local, single-qubit\noperations and only the Clifford gates are non-local. This gives a degree of ﬂexibility in the\ndesign one-way patterns.\nQuantum circuits described in terms of Clifford group gates plus rotations can readily\ncast in CD form by decomposing the rotations into Z-axis rotations and Hadamards. One can\nthen reduce the size of the corresponding pattern by applying the Pauli measurement trans-\nformation rules3. Quantum circuits for the simulation of general Hamiltonians are usually\nexpressed using the Trotter formula (see [3]) which leads to unitaries which are a sequence\nof generalized rotations which can be cast in CD form in a straightforward manner. Thus\nthe one-way quantum computer is very well suited to Hamiltonian simulation (see e.g. [23]),\nwhich will be an important application of quantum computers.\n4\nImplementations\n4.1\nOptical lattices\nBeyond its theoretical value, there are a number of physical implementations where one-way\nquantum computation gives distinct practical advantages. One of these is in systems where\ngraph states or cluster states can be generated efﬁciently, such as “optical lattices”. In an\noptical lattice, cold neutral atoms are trapped in a lattice structure, given by the periodic\npotential due to a set of superposed laser ﬁelds. The potential “seen” by each atom depends\non its internal state. This means that neighbouring atoms in different states can be brought\nclose together by changing the relative positions of the minima of the periodic potentials,\nleaving an interaction phase on the atoms’ state [24]. If this is timed such that this interaction\nphase is −1 the process implements, essentially, a CZ gate between the two atoms. However,\nevery atom in the lattice will be affected when these potentials move and thus CZ gates can\nbe implemented between neighbouring qubits across the lattice simultaneously. Thus, by\npreparing all atoms in a superposition of these internal states beforehand, a very large cluster\nstate can be generated very efﬁciently. In recent years there has been much progress in the\ngeneration and manipulation of ultra-cold atoms in optical lattices in the laboratory [25], and\na number of schemes for the generation of arbitrary graph states in these systems have been\n3It is important to note, however, that the Pauli measurement rules alone do not usually provide a CD-\ndecomposition which is optimal in the sense of consisting of the smallest number of CD units. An optimal CD-\ndecomposition will allow the construction of a one-way pattern for the unitaries with fewer measurement rounds,\nand often a more compact entanglement graph, than application of the Pauli transformation rules alone.\n17\n", "18": "proposed [26]. Possibly the most difﬁcult obstacle to overcome for the implementation of\none-way quantum computation in optical lattices is the difﬁculty in addressing individual\natoms in the lattice.\n4.2\nLinear optics and cavity QED\nPhotons make excellent carriers on quantum information and are relatively decoherence free.\nA key difﬁculty in implementing universal quantum computation using photons is that two-\nqubit gates such as CZ cannot be implemented by the simple linear optical elements of the\noptics laboratory (e.g. beam-splitters and phase shifters) alone. By employing photon num-\nber measurements, non-deterministic entangling gates are possible. Most times, however,\nthe gate fails, and this failure leads to the measurement of the qubits’ state which disrupts\nthe computation. Naively, one would expect that scaling this up into a circuit would lead\nto an exponential decrease in success probability, but, by using a combination of techniques\nincluding gate teleportation [27] and error correction, scalable quantum computation is in-\ndeed possible [28]. A key disadvantage of this particular approach, however, is that each gate\nrequires a large number of ancilla photons in a difﬁcult-to-prepare entangled state.\nA much more efﬁcient strategy is to use the non-deterministic gates to build an entangled\nresource state for measurement-based quantum computation [29, 30]. Cluster states can be\ngenerated efﬁciently [31] using so-called “fusion operations”, which can be performed (non-\ndeterministically) with simple linear optics. Fusion operations [31, 32] are implementations\nof operators such as |0⟩⟨00| + |1⟩⟨11|, which when applied to two qubits in different graph\nstates, replace both qubits by a single one which inherits all the graph state edges of each,\nthus “fusing” the two graph states together. Recently, three and four-qubit graph states have\nbeen created in the laboratory using methods based on down-conversion and post-selection\n[33] and fusion measurements [34]. Single-qubit measurements on these states demonstrated\nmany of the key elements of one-way quantum computation [33]. More details of linear\noptical quantum computation can be found in other chapters of this book and in a recent\nreview [35].\nQuantum computation with photons is not the only scenario where gates are inherently\nnon-deterministic. Similar techniques can be used to implement non-deterministic gates be-\ntween atoms or ions trapped in separate cavities. Cavity QED implementations of the one-\nway quantum computer is a fast-developing area and recently there have been a number of\npromising experimental proposals [36].\n5\nRecent developments\nIn addition to these developments toward the implementation of one-way quantum computa-\ntion there have been a number of interesting papers exploring its theoretical structure. The re-\nlationship between the one-way quantum computer and other models of measurement-based\nquantum computation [37, 27] has been explored in [38, 39, 40, 32] and an algebraic repre-\nsentation of one-way graph measurement patterns [12] has been developed. The simulability\nof one-way quantum computations with one-way patterns of various depths and geometries\nhas been investigated [41, 8]. Looking beyond qubit implementations, an analogue of graph\n18\n", "19": "states in continuous-variable harmonic oscillator systems [42] has been investigated and gen-\neralizations of one-way quantum computation to d-level systems [43] have been explored.\nA version of one-way quantum computation based on three-qubit interactions has been pro-\nposed [44].\nAny practical quantum computation proposal must be able to function in the presence\nof a degree of experimental noise and decoherence. Standard approaches to fault-tolerant\nquantum computation have been ﬁrmly rooted in the network model and it was not clear\nwhether they would translate to the one-way model. It was shown in [45] and later [46]\nthat physical errors in the one-way quantum computer would be manifested as logical errors\nquite different from those that one would expect in a standard gate network implementation.\nNevertheless for a number of physically reasonable independent noise models there is an error\nthreshold below which fault-tolerant quantum computation is possible [45, 46]. A simple\nproof of this for both Markovian and non-Markovian local errors is presented in [47]. The\nimplementation of these techniques in linear optical quantum computation has been simulated\n[48], leading to estimated error thresholds of around 0.0001 for depolarisation errors and\n0.003 for loss.\nRecently, a different approach to fault-tolerance in the one-way model has been taken.\nMost quantum error correcting code-words are stabilizer states, and as we have seen, every\nstabilizer state is locally equivalent to a graph state. It is therefore natural to look for error\ncorrection schemes which make use of the natural error correcting properties of the graph\nstate. It has been demonstrated that one-way quantum computation with a high degree of\nrobustness against qubit loss errors (the most signiﬁcant error source in linear optical quantum\ncomputation) can be acheived by using a graph states with a tree-like structure [49]. This\nscheme tolerates losing up to half of the qubits in the graph state, and can be applied to deal\nwith photon loss errors in linear optical proposals [50].\nMost recently, it was shown [51] that a three-dimensional body-centred cubic lattice clus-\nter state has the properties of a topological surface code. By combining ideas from topolog-\nical quantum computation with the observation that quantum Reed-Muller codes [52] allow\nfault-tolerant non-Pauli measurements of logical qubits to be implemented by local mea-\nsurements, a fully fault-tolerant scheme was presented [51] with estimated error thresholds\nbetween 0.001 and 0.01.\n6\nOutlook\nIn this chapter, we have given an introduction to the key ideas of one-way quantum computa-\ntion and some of the most useful mathematical techniques for describing and understanding\nit. The one-way approach has provided a new paradigm for quantum computation which is\ncasting many questions of quantum computation theory in a new light. It is leading to exper-\nimental implementations that are radically different from early ideas about how a quantum\ncomputer would operate. In addition, it is likely that there will be further physical systems\nin which the one-way model offers the most achievable path to quantum computation. Not\nleast, the success of the one-way approach illustrates the power of novel representations of\nquantum information processing and should encourage us to look for other new and distinct\nmodels of quantum computation.\n19\n", "20": "Acknowledgements\nDan Browne is supported by Merton College, Oxford and EPSRC’s QIPIRC programme.\nHans Briegel is supported by the Austrian Science Fund (FWF), the German Science Foun-\ndation (DFG), and by the European Union through projects QLAQUI and SCALA.\nWe would like to thank Robert Raussendorf for many insightful discussions over a num-\nber of years, which have helped to shape our perspective of one-way quantum computation.\nDan would like to thank Sean Barrett, Simon Benjamin, Michael Bremner, Jens Eisert, Joe\nFitzsimons, Elham Kasheﬁ, Pieter Kok, Michael Nielsen, Terry Rudolph and Michael Var-\nnava for some illuminating discussions about one-way quantum computation. Hans would\nlike to thank the Kavli Institute for Theoretical Physics (KITP) for their hospitality and sup-\nport while the ﬁnal part of this work was completed. We would like to thank Earl Campbell\nfor helpful comments on the manuscript.\nExercises\n1. There are only two topologically distinct three-qubit graph states. In one, the qubits\nform a linear three qubit cluster state, in the other, the qubits are connected in a trian-\ngle. Write down the stabilizer generators for these two states and hence also the full\nstabilizer group for each. Now show that one can transform between these two states\nby a local Clifford operator.\n2. Prove that, to generate the stabilizer group for a k-qubit stabilizer sub-space in an n\nqubit system, (n −k) generators are required.\n3. Consider the one-way pattern illustrated in ﬁgure 3(a) with angle φ set to zero. Show\nthat after the entangling CZ operation, but before the measurement, the logical opera-\ntors X and Z have physical representations X ⊗Z and Z ⊗1l respectively. Find the\nstabilizer and hence the full coset of each logical observable. When observable X is\nmeasured on the ﬁrst qubit, how are the stabilizer and logical observables transformed?\nHence verify that this pattern implements a Hadamard gate.\n4. Show that one-way patterns where all input and output qubits coincide can only imple-\nment diagonal unitaries. What can one say about patterns where only some of the input\nand output qubits coincide?\n5. Using the decomposition of an arbitrary n-qubit diagonal unitary Dn in equation (18)\nand by generalising the methods in section 3.8 describe a one-way pattern which im-\nplements Dn requiring a total of n + (2n −1) qubits.\n6. Verify the effect of applying the “fusion” operator |0⟩⟨0|⟨0| + |1⟩⟨1|⟨1| to two qubits,\neach of which belong to seperate graph states. What happens when a projection onto\nthe even-parity sub-space |0⟩|0⟩⟨0|⟨0| + |1⟩|1⟩⟨1|⟨1| is applied instead?\n7. Consider a qubit that is prepared in an unknown state, and a one-dimensional cluster\nstate. What is the effect of applying a fusion operator on the unknown qubit and the\n20\n", "21": "qubit at one end of the cluster state. How can the fusion operator be used to “input”\nexternally provided states into a one-way quantum computation?\nReferences\n[1] D. Deutsch, Proc. R. Soc. London, Ser. A 425, 73 (1990).\n[2] A. Barenco et al., Phys. Rev. A 52 3457 (1995).\n[3] M.A. Nielsen and I. Chuang, M.A. Nielsen I.L. Chuang. Quantum Computation and\nQuantum Information, (Cambridge University Press, Cambridge, 2000).\n[4] R. Raussendorf and H. J. Briegel, Phys. Rev. Lett. 86, 5188 (2001).\n[5] R. Raussendorf, D.E. Browne and H.J. Briegel, Phys. Rev. A 68, 022312 (2003).\n[6] H. J. Briegel and R. Raussendorf, Phys. Rev. Lett. 86, 910 (2001).\n[7] M. Hein, J. Eisert and H.J. Briegel, Phys. Rev. A 69, 062311 (2004).\n[8] M.A. Nielsen, e-print quant-ph/0504097, to appear in Rev. Math. Phys.\n[9] R. Jozsa, e-print quant-ph/0508124.\n[10] M. Hein et al., e-print quant-ph/0602096.\n[11] R. Raussendorf and H.J. Briegel, Quant. Inf. Comp. 6, 433 (2002); R. Raussendorf,\nD.E. Browne and H.J. Briegel, Journal of Modern Optics 49, 1299 (2002).\n[12] V. Danos, E. Kasheﬁand P. Panangaden, eprint: quant-ph/0412135; V. Danos, E.\nKasheﬁ, and P. Panangaden Phys. Rev. A 72, 064301 (2005).\n[13] D. Gottesman, Stabilizer codes and quantum error correction, quant-ph/9705052, PhD\nThesis, California Insitute of Technology (1997).\n[14] D. Gottesman, The Heisenberg Representation of Quantum Computers, Proceedings\nof the XXII International Colloquium on Group Theoretical Methods in Physics 32\n(Cambridge, MA, International Press, 1999).\n[15] S. Aaronson and D. Gottesman, Phys. Rev. A 70, 052328 (2004).\n[16] S. Anders and H.J. Briegel, Phys. Rev. A 73, 022334 (2006).\n[17] C. Cohen-Tannoudji et al., Quantum Mechanics Volume 1, (Wiley, 1978).\n[18] D. Schlingemann, Quant. Inf. Comp. 2, 307 (2002); D. Schlingemann, Quant. Inf.\nComp. 4, 287 (2004).\n[19] D. Schlingemann, e-print quant-ph/0111080; M. Grassl, A. Klappenecker, and M. Roet-\nteler, IEEE International Symposium on Information Theory, 45 (Lausanne, 2001).\n21\n", "22": "[20] M. Van den Nest, J. Dehaene and B. De Moor, Phys. Rev. A 69, 022316 (2004).\n[21] A. Bouchet, Combinatorica 11 314 (1991).\n[22] C. Moore and M. Nilsson, SIAM Journal on Computing 31, 799 (2002).\n[23] W. D¨ur, M. Bremner and H.J. Briegel, in preparation.\n[24] D. Jaksch et al., Phys. Rev. Lett. 82, 1975 (1999).\n[25] M. Greiner et al., Nature (London) 415, 39 (2002); M. Greiner et al., Nature (London)\n419, 51 (2002); O. Mandel et al., Phys. Rev. Lett. 91, 010407 (2003); O. Mandel et al.,\nNature (London) 425, 937 (2003).\n[26] S.R. Clark, C. Moura Alves, D. Jaksch, New J. Phys. 7, 124 (2005); A. Kay, J. K.\nPachos, and C. S. Adams, Phys. Rev. A 73, 022310 (2006).\n[27] D. Gottesman and I.L. Chuang, Nature (London) 402, 390 (1999).\n[28] E. Knill, R. Laﬂamme and G. Milburn, Nature (London) 409, 46 (2001).\n[29] N. Yoran and B. Reznik, Phys. Rev. Lett 91, 037903 (2003).\n[30] M.A. Nielsen, Phys. Rev. Lett. 93 040503 (2004).\n[31] D.E. Browne and T. Rudolph, Phys. Rev. Lett. 95 10501 (2005).\n[32] F. Verstraete, J.I. Cirac, Phys. Rev. A 70, 060302(R) (2004).\n[33] P. Walther et al., Nature (London) 434, 169 (2005).\n[34] A-N. Zhang et al., Phys. Rev. A 73, 022330 (2006).\n[35] P. Kok et al., e-print quant-ph/0512071.\n[36] S.D. Barrett and P. Kok, Phys. Rev. A 71, 060310(R) (2005); Y.L. Lim, A. Beige and\nL.C. Kwek, Phys. Rev. A 73, 012304 (2006); J. Cho, H.-W. Lee, Phys. Rev. Lett. 95,\n160501 (2005).\n[37] M.A. Nielsen, Phys. Lett. A. 308, 96 (2003); D. Leung, e-print quant-ph/0111122.\n[38] P. Jorrand and S. Perdrix, e-print: quant-ph/0404125.\n[39] P. Aliferis and D. W. Leung, Phys. Rev. A 70, 062314 (2004).\n[40] A.M. Childs, D.W. Leung and M.A. Nielsen, Phys. Rev. A 71, 032318 (2005).\n[41] I. Markov and Y. Shi, e-print quant-ph/0511069; N. Yoran and A.J. Short, Phys. Rev.\nLett. 96, 170503 (2006).\n[42] J. Zhang, e-print quant-ph/0501112; J. Zhang and S. Braunstein, Phys. Rev. A 73,\n032318 (2006).\n22\n", "23": "[43] D.L. Zhou et al., Phys. Rev. A. 68, 062303 (2003); W. Hall, e-print quant-ph/0512130;\nS. Clark, J. Phys. A: Math. Gen. 39, 2701 (2006).\n[44] M.S. Tame et al., Phys. Rev. A 73, 022309 (2006).\n[45] R. Raussendorf, PhD Thesis, Ludwig-Maximilians University, Munich (2003), online\nat http://edoc.ub.unimuenchen. de/archive/00001367/.\n[46] M. Nielsen and C. Dawson, Phys. Rev. A 71, 042323 (2005).\n[47] P. Aliferis and D.W. Leung, Phys. Rev. A 73, 032308 (2006).\n[48] C.M. Dawson, H.L. Haselgrove, M.A. Nielsen, Phys. Rev. Lett. 96, 020501 (2006).\n[49] M. Varnava, D.E. Browne, T. Rudolph, Phys. Rev. Lett. 97, 120501 (2006).\n[50] M. Varnava, D.E. Browne, T. Rudolph, in preparation (2006).\n[51] R. Raussendorf, J. Harrington and K. Goyal, e-print quant-ph/0510135.\n[52] S. Bravyi and A. Kitaev, Phys. Rev. A 71, 022316 (2005).\n23\n"}