{"1": "Introduction to Haar Measure Tools in Quantum\nInformation: A Beginner’s Tutorial\nAntonio Anna Mele\nDahlem Center for Complex Quantum Systems, Freie Universit¨at Berlin, 14195 Berlin, Germany\nThe Haar measure plays a vital role in quantum information, but its study often re-\nquires a deep understanding of representation theory, posing a challenge for beginners.\nThis tutorial aims to provide a basic introduction to Haar measure tools in quantum\ninformation, utilizing only basic knowledge of linear algebra and thus aiming to make\nthis topic more accessible. The tutorial begins by introducing the Haar measure with\na specific emphasis on characterizing the moment operator, an essential element for\ncomputing integrals over the Haar measure. It also covers properties of the symmetric\nsubspace and introduces helpful tools like tensor network diagrammatic notation, which\naid in visualizing and simplifying calculations. Next, the tutorial explores the concept\nof unitary designs, providing equivalent definitions, and subsequently explores approx-\nimate notions of unitary designs, shedding light on the relationships between these\ndifferent notions. Practical examples of Haar measure calculations are illustrated, in-\ncluding the derivation of well-known formulas such as the twirling of a quantum channel.\nLastly, the tutorial showcases the applications of Haar measure calculations in quantum\nmachine learning and classical shadow tomography.\nContents\n1\nIntroduction\n1\n2\nNotation and Preliminaries\n1\n3\nHaar measure and moment operator\n2\n4\nSymmetric subspace\n9\n5\nVectorization formalism\n14\n6\nTensor network diagrams\n17\n7\nUnitary designs\n22\n8\nApproximate unitary designs\n26\n9\nExamples and applications\n30\n9.1\nExamples of moment calculations . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n31\n9.2\nConcentration inequalities . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n35\n9.3\nApplications in Quantum Machine Learning . . . . . . . . . . . . . . . . . . . . . .\n37\n9.4\nClassical shadow tomography . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n39\n10 Acknowledgments\n43\nAntonio Anna Mele: a.mele@fu-berlin.de\nAccepted in Quantum 2024-02-14, click title to verify. Published under CC-BY 4.0.\n1\narXiv:2307.08956v4  [quant-ph]  9 Apr 2024\n", "2": "1\nIntroduction\nThe notion of Haar measure formalizes the fundamental concept of drawing unitary matrices\nuniformly at random. In the context of quantum information, unitary matrices often represent\nquantum evolutions that are commonly described using quantum circuits. The applications of\nthe Haar measure are widespread across various domains within quantum information, such as\nquantum tomography [1–8], computational advantage of random quantum circuits sampling [9–\n16], benchmarking of quantum devices [17–20], quantum foundations and communication [21–29],\nquantum machine learning [30–33], quantum many-body and high energy physics [34–44].\nAlthough the Haar measure serves as a fundamental tool in quantum information, its study can\nbe challenging for beginners due to its reliance on advanced concepts from representation theory.\nIn order to make this topic more accessible, this tutorial provides an introduction to Haar measure\ntools using only concepts from linear algebra. Throughout the tutorial, we intentionally avoid\ndelving into representation theory to enhance accessibility. For further reading, one can refer, for\nexample, to [39, 40, 45–51].\nThe tutorial is structured as follows. Section 2 offers an overview of the notation and pre-\nliminary concepts that will be used throughout the tutorial. Section 3 focuses on introducing the\nHaar measure, with a specific emphasis on characterizing the moment operator—a crucial quantity\nfor computing integrals over the Haar measure. In Section 4, the symmetric and antisymmetric\nsubspaces are introduced, highlighting their properties and their connection to the Haar measure\nover pure states. Sections 5 and 6 introduce tools that facilitate calculations in Haar measure\napplications. Section 5 presents the vectorization formalism, while Section 6 introduces the tensor\nnetworks diagrammatic notation, providing visual representations that enhance comprehension and\nstreamline computations. Section 7 introduces the concept of unitary designs—a method employed\nto mimic some properties of the Haar measure, facilitating efficient protocols in quantum comput-\ning. Building upon this foundation, Section 8 explores approximate notions of unitary designs,\nelucidating the relationships between the different introduced notions. In Section 9, the tutorial\nshowcases practical examples of Haar measure calculations. We begin by deriving well-known for-\nmulas such as the twirling of a quantum channel, average gate fidelity, average purity of reduced\nstates in bipartite systems, and Haar averages of observables expectation values. Furthermore, we\ndemonstrate how these expected value calculations can be translated into probability statements\nusing concentration inequalities. Finally, we delve into two in-depth applications: Barren Plateaus\nphenomena in Quantum Machine Learning and Classical Shadow Tomography, both of which rely\non the theory of k-designs.\n2\nNotation and Preliminaries\nWe use the following notation throughout this tutorial. L(Cd) is the set of linear operators that act\non the d-dimensional complex vector space Cd, while Herm(Cd) is the set of Hermitian operators\non Cd. The identity operator is denoted by I, and we define the operator I := I ⊗I as the tensor\nproduct of two identity operators. The unitary group is denoted by U(d) and is defined as the set\nof operators U ∈L(Cd) such that U †U = I. Furthermore, we use the notation [d] to denote the\nset of integers from 1 to d, i.e., [d] := {1, . . . , d}.\nLet v ∈Cd be a vector, and let p ∈[1, ∞].\nThe p-norm of v is denoted by ∥v∥p, and is\ndefined as ∥v∥p := (Pd\ni=1 |vi|p)1/p.\nThe Schatten p-norm of a matrix A ∈L\n\u0000Cd\u0001\nis given by\n∥A∥p := Tr((\n√\nA†A)p)1/p, which corresponds to the p-norm of the vector of singular values of A.\nThe trace norm and the Hilbert-Schmidt norm are important instances of Schatten p-norms and\nare respectively denoted as ∥· ∥1 and ∥· ∥2. The Hilbert-Schmidt norm is induced by the Hilbert-\nSchmidt scalar product ⟨A, B⟩HS := Tr\n\u0000A†B\n\u0001\nfor A, B ∈L\n\u0000Cd\u0001\n. The infinite norm, denoted as\n∥·∥∞, of a matrix is defined as its largest singular value. This norm can be understood as the limit\nof the Schatten p-norm of the matrix as p approaches infinity. Important facts about the Schatten\np-norms that will be used in the tutorial are the following. For all matrices A and 1 ≤p ≤q, we\nhave ∥A∥q ≤∥A∥p and ∥A∥p ≤rank(A)(p−1−q−1)∥A∥q. Additionally, for all unitaries U and V ,\nand matrix A, we have the unitary invariance property ∥UAV ∥p = ∥A∥p. Furthermore, we also\nhave the tensor product property ∥A ⊗B∥p = ∥A∥p∥B∥p and the submultiplicativity property\n1\n", "3": "∥AB∥p ≤∥A∥p∥B∥p, for all matrices A and B.\nWe use the bra-ket notation, where we denote a vector v ∈Cd using the ket notation |v⟩and its\nadjoint using the bra notation ⟨v|. We refer to a vector |ψ⟩∈Cd as a (pure) state if ∥|ψ⟩∥2 = 1. The\ncanonical basis of Cd is denoted by {|i⟩}d\ni=1. We define the non-normalized maximally entangled\nstate |Ω⟩as |Ω⟩:= Pd\ni=1 |i⟩⊗|i⟩= Pd\ni=1 |i, i⟩. We define the set of density matrices (or quantum\nstates) as S\n\u0000Cd\u0001 := {ρ ∈L\n\u0000Cd\u0001\n: ρ ≥0, Tr(ρ) = 1}. A quantum channel Φ : L(Cd) →L(Cd) is a\nlinear map that is completely positive and trace-preserving. In particular, the completely positive\ncondition means that for all positive operators σ ∈L(Cd ⊗CD), for all D ∈N, the operator\nΦ ⊗I(σ) is also positive. Here, I : L\n\u0000CD\u0001\n→L\n\u0000CD\u0001\ndenotes the identity map, which simply\nmaps any A ∈L\n\u0000CD\u0001\nto itself. Additionally, every quantum channel Φ can be expressed in terms\nof d2 Kraus operators, i.e., there exist {Ki}d2\ni=1 operators such that Φ (·) = Pd2\ni=1 Ki (·) K†\ni , subject\nto the condition that Pd2\ni=1 K†\ni Ki = I in order to satisfy the trace-preserving property.\n3\nHaar measure and moment operator\nDefinition 1 (Haar measure). The Haar measure on the unitary group U(d) is the unique proba-\nbility measure µH that is both left and right invariant over the group U(d), i.e., for all integrable\nfunctions f and for all V ∈U(d), we have:\nZ\nU(d)\nf (U) dµH(U) =\nZ\nU(d)\nf (UV ) dµH(U) =\nZ\nU(d)\nf (V U) dµH(U).\n(1)\nIn fact, for compact groups such as the unitary group, there exists a unique probability measure\nthat is both left and right invariant under group multiplication [52]. However, we will not delve\ndeeper into the theory of compact groups and measures in this tutorial, as our focus is on applica-\ntions of the tools we describe. For a more comprehensive treatment of this topic, we recommend\nreferring to [51, 52].\nThe Haar measure is a probability measure, satisfying the properties\nR\nS 1 dµH(U) ≥0 for all\nsets S ⊆U(d) and\nR\nU(d) 1 dµH(U) = 1. Consequently, we can denote the integral of any function\nf(U) over the Haar measure as the expected value of f(U) with respect to the probability measure\nµH, denoted as\nE\nU∼µH[f(U)].\nE\nU∼µH [f (U)] :=\nZ\nU(d)\nf (U) dµH(U).\n(2)\nWhen f(U) is a matrix function, the expected value is understood to be the expected value of each\nof its entries.\nWe can prove the following proposition, which shows that any integral involving an unbalanced\nproduct of matrix entries of U and U ∗must vanish. In the following, we use the notation U ⊗k :=\nU ⊗· · · ⊗U\n|\n{z\n}\nk times\n.1\nProposition 2.\nLet k1, k2 ∈N. If k1 ̸= k2, then we have\nE\nU∼µH\n\u0002\nU ⊗k1 ⊗U ∗⊗k2\u0003\n= 0.\nProof. We can use the right invariance multiplying U by the unitary exp\n\u0010\ni\nπ\nk1−k2\n\u0011\nI:\nE\nU∼µH\n\u0002\nU ⊗k1 ⊗U ∗⊗k2\u0003\n= −\nE\nU∼µH\n\u0002\nU ⊗k1 ⊗U ∗⊗k2\u0003\n,\n(3)\nfrom which the claim follows.\n1The significance of investigating tensor powers of unitaries and their adjoints, i.e. U⊗k ⊗U∗⊗k, becomes evident\nwhen considering applications (Section 9). In brief, within various scenarios, the computation of integrals over the\nHaar measure of the relevant quantity reduces to evaluating integrals of homogeneous polynomials of degree k\nin the matrix elements of U and U∗, for some k ∈N.\nRemarkably, any such polynomial can be expressed as\nTr\u0000AU⊗k ⊗U∗⊗k\u0001\n, where A is a matrix that contains the coefficients of the polynomial.\n2\n", "4": "This next proposition will be useful in our subsequent calculations.\nIt states that in Haar\nintegrals, we are free to change the variable U with U †.\nProposition 3. For all integrable functions f defined on U(d), we have that:\nE\nU∼µH\n\u0002\nf\n\u0000U †\u0001\u0003\n=\nE\nU∼µH [f (U)] .\n(4)\nProof. Let µ† be a probability measure defined as\nZ\nU(d)\nf (U) dµ†(U) :=\nZ\nU(d)\nf\n\u0000U †\u0001\ndµH(U).\n(5)\nWe will now show that µ† is right and left invariant, which implies that it coincides with µH\nbecause of the uniqueness of the Haar measure. To this end, let V be a fixed unitary matrix:\nZ\nU(d)\nf (UV ) dµ†(U) =\nZ\nU(d)\nf\n\u0000U †V\n\u0001\ndµH(U) =\nZ\nU(d)\nf\n\u0000U †V †V\n\u0001\ndµH(U)\n(6)\n=\nZ\nU(d)\nf\n\u0000U †\u0001\ndµH(U) =\nZ\nU(d)\nf (U) dµ†(U).\n(7)\nThis shows that µ† is right-invariant, as claimed. Left-invariance similarly follows.\nA quantity that plays a crucial role in our analysis is the k-th moment operator, where k is a\nnatural number.\nDefinition 4 (k-th Moment operator). The k-th moment operator, with respect to the probability\nmeasure µH, is defined as M(k)\nµH : L\n\u0000(Cd)⊗k\u0001\n→L\n\u0000(Cd)⊗k\u0001\n:\nM(k)\nµH(O) :=\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\n,\n(8)\nfor all operators O ∈L((Cd)⊗k).\nBy characterizing the moment operator and computing its matrix elements, we can explicitly\nevaluate integrals over the Haar measure. For example, let O = |i1, . . . , ik⟩⟨j1, . . . , jk| with ia, ja ∈\n[d] for all a ∈[k], we have:\n⟨l1, . . . , lk|\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\n|m1, . . . , mk⟩=\nE\nU∼µH\n\u0002\nUl1,i1 · · · Ulk,ikU ∗\nm1,j1 · · · U ∗\nmk,jk\n\u0003\n(9)\nwhere la, ma ∈[d] for all a ∈[k]. In order to characterize the moment operator, we need to define\nthe k-th order commutant of a set of matrices S.\nDefinition 5 (Commutant). Given S ⊆L\n\u0000Cd\u0001\n, we define its k-th order commutant as\nComm(S, k) := {A ∈L\n\u0000(Cd)⊗k\u0001\n:\n\u0002\nA, B⊗k\u0003\n= 0 ∀B ∈S}.\n(10)\nIt is worth noting that Comm(S, k) is a vector subspace.\nIn the following we will show\nthat the moment operator is the orthogonal projector onto the commutant of the unitary group\nComm(U(d), k) with respect to the Hilbert-Schmidt inner product. In order to do so, we first prove\nthe following Lemma.\nLemma 6 (Properties of the moment operator).\nThe moment operator M(k)\nµH(·) :=\nE\nU∼µH\n\u0002\nU ⊗k (·) U †⊗k\u0003\nhas the following properties:\n1. It is linear, trace-preserving, and self-adjoint with respect to the Hilbert-Schmidt inner prod-\nuct.\n2. For all A ∈L\n\u0000(Cd)⊗k\u0001\n, M(k)\nµH(A) ∈Comm(U(d), k).\n3. If A ∈Comm(U(d), k), then M(k)\nµH(A) = A.\n3\n", "5": "Proof.\n1. Linearity and the trace preserving property follow easily from Definition 4. To show that the\nmoment operator is self-adjoint, we need to prove that:\n⟨M(k)\nµH(A) , B⟩HS = ⟨A, M(k)\nµH(B)⟩HS.\n(11)\nfor all A, B ∈L\n\u0000(Cd)⊗k\u0001\n. This follows because:\nTr\n\u0010\nM†\nk(A) B\n\u0011\n=\nE\nU∼µH Tr\n\u0000U ⊗kA†U †⊗kB\n\u0001\n(12)\n= Tr\n\u0012\nA†\nE\nU∼µH\n\u0002\nU †⊗kBU ⊗k\u0003\u0013\n(13)\n= Tr\n\u0010\nA†M(k)\nµH(B)\n\u0011\n,\n(14)\nwhere in the last step we used Proposition 3.\n2. For all V ∈U(d), we have that:\nV ⊗kM(k)\nµH(A) =\nE\nU∼µH\nh\n(V U)⊗k AU †⊗ki\n=\nE\nU∼µH\nh\nU ⊗kA\n\u0000V †U\n\u0001†⊗ki\n(15)\n=\nE\nU∼µH\n\u0002\nU ⊗kAU †⊗k\u0003\nV ⊗k = M(k)\nµH(A) V ⊗k,\n(16)\nwhere we used the left invariance of the Haar measure.\n3. Since A ∈Comm(U(d), k), we have:\nM(k)\nµH(A) =\nE\nU∼µH\n\u0002\nU ⊗kAU †⊗k\u0003\n=\nE\nU∼µH\n\u0002\nAU ⊗kU †⊗k\u0003\n= A.\n(17)\nTheorem 7 (Projector onto the commutant). The moment operator M(k)\nµH(·) =\nE\nU∼µH\n\u0002\nU ⊗k (·) U †⊗k\u0003\nis the orthogonal projector onto the commutant Comm := Comm(U(d), k) with respect to the\nHilbert-Schmidt inner product. In particular, let P1, . . . , Pdim(Comm) be an orthonormal basis of\nComm and let O ∈L((Cd)⊗k). Then, we have:\nM(k)\nµH(O) =\ndim(Comm)\nX\ni=1\n⟨Pi, O⟩HSPi .\n(18)\nProof. Let us extend the orthonormal basis of the commutant with the orthonormal operators Pi\nfor i ∈{dim (Comm) + 1, . . . , dim (V )}, where V := L\n\u0000(Cd)⊗k\u0001\n. This extended basis forms an\northonormal basis for V . Therefore we have:\nM(k)\nµH(O) =\ndim(V )\nX\ni=1\n⟨Pi, M(k)\nµH(O)⟩HSPi\n(19)\n=\ndim(Comm)\nX\ni=1\n⟨M(k)\nµH(Pi) , O⟩HSPi +\ndim(V )\nX\ni=dim(Comm)+1\n⟨Pi, M(k)\nµH(O)⟩HSPi\n(20)\n=\ndim(Comm)\nX\ni=1\n⟨M(k)\nµH(Pi) , O⟩HSPi + 0\n(21)\n=\ndim(Comm)\nX\ni=1\n⟨Pi, O⟩HSPi,\n(22)\nwhere in the second line we used the fact that the moment operator is self-adjoint (Lemma 6.1),\nin the third line that M(k)\nµH(O) ∈Comm (Lemma 6.2) and that Pi with i ∈{dim (Comm) +\n1, . . . , dim (V )} are in its orthogonal complement, in the fourth line that Pi ∈Comm for i ∈\n{1, . . . , dim (Comm)} and Lemma 6.3.\n4\n", "6": "We have just shown that the moment operator is intimately related to the k-order commutant\nof the unitary group, i.e. all the matrices that commute with U ⊗k for any unitary U. A set of\noperations that surely commutes with U ⊗k is if we exchange some tensor factors. For this purpose,\nwe will now define the operators that implement such transformations, namely the permutation\noperators.\nDefinition 8 (Permutation operators). Given π ∈Sk an element of the symmetric group Sk, we\ndefine the permutation matrix Vd(π) to be the unitary matrix that satisfies:\nVd(π) |ψ1⟩⊗· · · ⊗|ψk⟩=\n\f\fψπ−1(1)\n\u000b\n⊗· · · ⊗\n\f\fψπ−1(k)\n\u000b\n,\n(23)\nfor all |ψ1⟩, . . . , |ψk⟩∈Cd.\nNote that from this definition it follows that Vd(σ)Vd(π) = Vd(σπ) and Vd(π−1) = V †\nd (π).\nEquivalently, we can write the permutation matrix as:\nVd(π) =\nX\ni1,...,ik∈[d]k\n\f\fiπ−1(1), . . . , iπ−1(k)\n\u000b\ni1, · · · , ik\n\f\f .\n(24)\nThus, we have the following property:\nVd(π) (A1 ⊗· · · ⊗Ak) V †\nd (π) = Aπ−1(1) ⊗· · · ⊗Aπ−1(k),\n(25)\nfor A1, . . . , Ak ∈L\n\u0000Cd\u0001\n.\nA crucial and much celebrated result of representation theory is now that the permutation\noperators characterize all possible matrices in the commutant – this is the Schur-Weyl duality.\nTheorem 9 (Schur-Weyl duality [53]). The k-th order commutant of the unitary group is the span\nof the permutation operators associated to Sk:\nComm(U(d), k) = span\n\u0010\nVd(π) : π ∈Sk\n\u0011\n.\n(26)\nWe will omit the proof of this theorem here, except for the cases where k = 1 and k = 2, which\nwe will show later in this section. Interested readers can refer to Refs. [46, 53, 54] for a detailed\nexposition. However we can easily check that span\n\u0010\nVd(π) : π ∈Sk\n\u0011\n⊆Comm(U(d), k). To see\nwhy this is true, consider an arbitrary permutation Vd(π) with π ∈Sk and U ∈U (d). We have:\nVd(π)U ⊗k |ψ1⟩⊗· · · ⊗|ψk⟩= Vd(π)(U |ψ1⟩) ⊗· · · ⊗(U |ψk⟩)\n(27)\n= U\n\f\fψπ−1(1)\n\u000b\n⊗· · · ⊗U\n\f\fψπ−1(k)\n\u000b\n(28)\n= U ⊗kVd(π) |ψ1⟩⊗· · · ⊗|ψk⟩,\n(29)\nfor all |ψ1⟩, . . . , |ψk⟩∈Cd. Hence we have that\n\u0002\nVd(π), U ⊗k\u0003\n= 0 for all π ∈Sk, from which the\nclaim follows.\nThe permutation matrices form a basis for the k-th order commutant of the unitary group,\ncapturing its essential structure. However, it is important to note that they are not orthonormal\nwith respect to the Hilbert-Schmidt inner product. Therefore, we cannot directly apply Theorem 7.\nNevertheless, we have an alternative approach that allows us to evaluate the moment operator and,\nconsequently, compute integrals over the Haar measure. The following theorem presents a recipe\nfor accomplishing this task.\nTheorem 10. (Computing moments) Let O ∈L\n\u0000(Cd)⊗k\u0001\n. The moment operator can then be\nexpressed as a linear combination of permutation operators:\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\n=\nX\nπ∈Sk\ncπ(O)Vd(π),\n(30)\nwhere the coefficients cπ(O) can be determined by solving the following linear system of k! equations:\nTr\n\u0010\nV †\nd (σ)O\n\u0011\n=\nX\nπ∈Sk\ncπ(O) Tr\n\u0010\nV †\nd (σ)Vd(π)\n\u0011\nfor all σ ∈Sk.\n(31)\nThis system always has at least one solution.\n5\n", "7": "Proof. Equation (30) follows from Lemma 6.2, which states that M(k)\nµH(O) =\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\n∈\nComm(U(d), k), and from Schur-Weyl duality (Theorem 9).\nTo obtain the linear system of equations, we begin by multiplying both sides of Eq. (30) by\nV †\nd (σ) and taking the trace for all σ ∈Sk. This yields:\nX\nπ∈Sk\ncπ(O) Tr\n\u0010\nV †\nd (σ)Vd(π)\n\u0011\n= Tr\n\u0010\nV †\nd (σ)M(k)\nµH(O)\n\u0011\n(32)\n= Tr\n\u0010\nM(k)\nµH\n\u0010\nV †\nd (σ)O\n\u0011\u0011\n(33)\n= Tr\n\u0010\nV †\nd (σ)O\n\u0011\n,\n(34)\nwhere in the first equality we used Eq. (30), in the second equality we used that V †\nd (σ) commutes\nwith U ⊗k, and in the last equality we used the fact that the moment operator is trace preserving\n(Lemma 6.1). Since M(k)\nµH(O) ∈span (Vd(π) : π ∈Sk), a solution to this linear system of equations\nalways exists.\nThe previous theorem provides an explicit expression for the coefficients of the moment operator\nin the permutation basis as cπ(O) = P\nσ∈Sk (G+)π,σ Tr\n\u0000V †\nσ O\n\u0001\n.\nHere, G is the Gram matrix,\ni.e. that matrix with coefficients Gπ,σ = Tr\n\u0010\nV †\nd (π)Vd(σ)\n\u0011\n, and G+ is its pseudo-inverse. This\nresult allows us to express the moment operator in terms of the so-called Weingarten coefficients\nWg(π−1σ, d) := (G+)π,σ [51, 55–57]2, as follows:\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\n=\nX\nπ,σ∈Sk\nWg(π−1σ, d) Tr\n\u0010\nV †\nd (σ)O\n\u0011\nVd(π).\n(35)\nThe Weingarten coefficients Wg(π−1σ, d) can be written in terms of characters of the symmetric\ngroup. However, we will not explore this aspect here. For reference, see [51, 55, 59, 60].\nThe Gram matrix G has a simple expression in terms of the cycle structure of the permutations,\ngiven by:\nGπ,σ = Tr\n\u0010\nV †\nd (π)Vd(σ)\n\u0011\n= Tr\n\u0000Vd(π−1)Vd(σ)\n\u0001\n= Tr\n\u0000Vd(π−1σ)\n\u0001\n= d#cycles(π−1σ),\n(36)\nwhere the last equality follows from the fact that Tr(Vd(π)) = P\ni1,...,ik∈[d]k\n\ni1\n\f\fiπ−1(1)\n\u000b\n· · ·\n\nik\n\f\fiπ−1(k)\n\u000b\nand observing that this sum has d#cycles(π) nonvanishing terms and they are all equal to 1. This\nfact is also evident in the tensor networks notation that we will introduce in section 6.\nProposition 11. For π ∈Sk, the permutation matrices Vd(π) are linearly independent if k ≤d,\nbut linearly dependent if k > d.\nProof. Let us consider first the case where k ≤d. We assume that there exist complex coefficients\nαπ ∈C for all π ∈Sk such that the following equation holds:\nX\nπ∈Sk\nαπVd(π) = 0.\n(37)\nSince, k ≤d, we can choose k distinct elements i1, . . . , ik ∈[d] and apply to the right of both sides\nof the previous equation the state |i1⟩⊗· · · ⊗|ik⟩, obtaining:\nX\nπ∈Sk\nαπ\n\f\fiπ−1(1)\n\u000b\n⊗· · · ⊗\n\f\fiπ−1(k)\n\u000b\n= 0.\n(38)\nFor all σ ∈Sk, we multiply to the left by\n\niσ−1(1)\n\f\f ⊗· · · ⊗\n\niσ−1(k)\n\f\f and deduce ασ = 0. Thus, we\nhave shown linear independence. If k > d, then consider the operator:\nA =\nX\nπ∈Sk\nsgn(π)Vd(π).\n(39)\n2The calculation of moments over the Haar measure is often referred to as the Weingarten calculus [57, 58].\n6\n", "8": "Now we show this linear combination is the zero operator, proving linear dependence.\nWe consider the action of A on an arbitrary product basis state |i1⟩⊗· · ·⊗|ik⟩. Since k > d, at\nleast two tensor factors must have matching entry, i.e., there exist l ̸= m ∈[k] such that il = im.\nDue to anti-symmetrization, the output vector has to be the zero vector. In fact, we have:\nA |i1⟩⊗· · · ⊗|ik⟩= AVd(τl,m) |i1⟩⊗· · · ⊗|ik⟩\n(40)\n=\nX\nπ∈Sk\nsgn(π)Vd(π)Vd(τl,m) |i1⟩⊗· · · ⊗|ik⟩\n(41)\n=\nX\nπ∈Sk\nsgn(π)Vd(πτl,m) |i1⟩⊗· · · ⊗|ik⟩\n(42)\n=\nX\nπ∈Sk\nsgn(πτ −1\nl,m)Vd(π) |i1⟩⊗· · · ⊗|ik⟩\n(43)\n= sgn\n\u0010\nτ −1\nl,m\n\u0011 X\nπ∈Sk\nsgn(π)Vd(π) |i1⟩⊗· · · ⊗|ik⟩\n(44)\n= −A |i1⟩⊗· · · ⊗|ik⟩.\n(45)\nTherefore A |i1⟩⊗· · · ⊗|ik⟩= 0 and so A = 0.\nIn the following we define the identity permutation operator I and the Flip operator F (also\noften referred to as SWAP operator) which are the permutation operators corresponding to the\nelements of the permutation group S2.\nDefinition 12 (Identity and Flip operators). The identity permutation operator I is defined as\nthe linear operator that leaves any tensor product state |ψ⟩⊗|ϕ⟩unchanged, that is:\nI (|ψ⟩⊗|ϕ⟩) = |ψ⟩⊗|ϕ⟩,\nfor all |ψ⟩, |ϕ⟩∈Cd.\n(46)\nThe Flip operator F is defined as the linear operator that interchanges the order of the tensor\nfactors of any product state |ψ⟩⊗|ϕ⟩, that is:\nF (|ψ⟩⊗|ϕ⟩) = |ϕ⟩⊗|ψ⟩,\nfor all |ψ⟩, |ϕ⟩∈Cd.\n(47)\nWriting the Identity and the Flip in the computational basis, we have:\nI =\nd\nX\ni,j=1\n|i, j⟩⟨i, j| ,\nF =\nd\nX\ni,j=1\n|i, j⟩⟨j, i| .\n(48)\nFrom this, it is evident that the Flip operator is Hermitian. Another key property of the Flip\noperator is the swap-trick, which states that for all operators A, B ∈L(Cd), we have:\nTr((A ⊗B) F) = Tr(AB) .\n(49)\nThis property can be easily verified using the definition of the Flip operator. The swap-trick is\nparticularly useful as it allows us to simplify calculations involving tensor products and permuta-\ntions, and it will be used extensively in the subsequent sections.\nWe now present a corollary of Theorem 10, which plays a crucial role in many calculations\ninvolving Haar integrals in the context of quantum information, as we will see in section 9. In the\nfollowing corollary we assume d > 1 (which makes sense for an n-qubit system, since d = 2n > 1).\nCorollary 13 (First and second moment).\nGiven O ∈L\n\u0000Cd\u0001\n, we have:\nE\nU∼µH\n\u0002\nUOU †\u0003\n= Tr(O)\nd\nI.\n(50)\nGiven O ∈L((Cd)⊗2), we have:\nE\nU∼µH\n\u0002\nU ⊗2OU †⊗2\u0003\n= cI,OI + cF,OF,\n(51)\nwhere:\ncI,O = Tr(O) −d−1 Tr(FO)\nd2 −1\nand\ncF,O = Tr(FO) −d−1 Tr(O)\nd2 −1\n.\n(52)\n7\n", "9": "Proof. According to Theorem (10), we have that the first-order moment operator is proportional\nto the identity operator (the only permutation operator associated with the permutation group of\none element S1), i.e.\nE\nU∼µH\n\u0002\nUOU †\u0003\n= cII,\n(53)\nwith cI ∈C. Taking the trace to both sides, we deduce that cI = Tr(O)\nd\n.\nMoreover, using Theorem (10), we can see that that the second-order moment operator is a\nlinear combination of the two permutation operators associated with the permutation group S2\nwhich are the identity I and the flip F operator:\nE\nU∼µH\n\u0002\nU ⊗2OU †⊗2\u0003\n= cI,OI + cF,OF,\n(54)\nwith cI,O, cF,O ∈C. To find these numbers, we left-multiply both sides by I and take the trace,\nwhich gives us:\nTr(O) = cI,Od2 + cF,Od,\n(55)\nwhere we used the fact that Tr(I) = d2 and Tr(F) = d. Similarly, by left-multiplying by F and\ntaking the trace, we obtain the linear system of equation:\n(\nTr(O) = cI,Od2 + cF,Od\nTr(FO) = cI,Od + cF,Od2 .\n(56)\nSolving this system, we obtain cI,O = Tr(O)−d−1 Tr(OF)\nd2−1\nand cF,O = Tr(FO)−d−1 Tr(O)\nd2−1\n.\nWe have shown how to obtain the formulas for the first and second moment operator by\nutilizing the property that the moment operator lies in the commutant (Lemma 6.2) and that the\ncommutant is the span of the permutation matrices Comm(U(d), k) = span\n\u0010\nVd(π) : π ∈Sk\n\u0011\nfor\nk = 1, 2, which are particular instances of Schur-Weyl duality. Now, we will provide explicit proofs\nfor these cases.\nExample 14.\nComm(U(d), k = 1) = span\n\u0010\nI\n\u0011\n,\n(57)\nComm(U(d), k = 2) = span\n\u0010\nI, F\n\u0011\n.\n(58)\nProof. Consider an element A ∈Comm(U(d), k = 1). In the canonical basis decomposition, A can\nbe written as:\nA =\nd\nX\ni,j=1\nAi,j |i⟩⟨j| =\nd\nX\ni=1\nAi,i |i⟩⟨i| +\nd\nX\ni,k=1\nj̸=i\nAi,j |i⟩⟨j| ,\n(59)\nwhere Ai,j := ⟨i| A |j⟩. Since A is in the commutant, then UAU † = A holds for all unitary matrices\nU. By choosing a unitary U that sends vector |k⟩to its negative |k⟩→−|k⟩while leaving the\nother basis vectors unchanged, it follows that, for all k ̸= l ∈[d], the term Ak,l |k⟩⟨l| is equal\nto its negative, and hence, Ak,l = 0. Therefore, we have that if A is in the commutant, then\nA = Pd\ni=1 Ai,i |i⟩⟨i|. Now, for all k ̸= l ∈[d], by choosing a unitary matrix U that exchanges\nthe vectors |k⟩and |l⟩while leaving the other basis states unchanged, we derive that all diagonal\nelements Ak,k should be equal each other for all k ∈[d]. Thus, we have A = c Pd\ni=1 |i⟩⟨i| = cI, where\nc := A1,1. Therefore an operator can only be in the commutant if and only if it is proportional to\nthe Identity I. Thus, we have shown the first formula we aimed to prove.\n8\n", "10": "Consider now Q ∈Comm(U(d), k = 2). Q can be decomposed as:\nQ =\nd\nX\ni,j,k,l=1\nQi,j;k,l |i, j⟩⟨k, l| ,\n(60)\nwhere Qi,j;k,l := ⟨i, j| Q |k, l⟩. Since Q is in the commutant, then U ⊗2QU †⊗2 = Q holds for all\nunitary matrices U. For all sets of indices {i, j} ̸= {k, l}, let m be a index such that m ∈{i, j} but\nm /∈{k, l} or vice versa (there is at least one). By choosing unitaries that send a basis vector to its\nnegative, while leaving unchanged the other basis vectors, it follows that, for all {i, j} ̸= {k, l} ∈[d],\nthe terms Qi,j;k,l |i, j⟩⟨k, l| are equal to their negatives, and hence, Qi,j;k,l = 0. Therefore, if Q is\nin the commutant, it must have the following form:\nQ =\nd\nX\ni=1\nQi,i;i,i |i, i⟩⟨i, i| +\nd\nX\ni,j=1\ni̸=j\nQi,j;i,j |i, j⟩⟨i, j| +\nd\nX\ni,j=1\ni̸=j\nQi,j;j,i |i, j⟩⟨j, i| .\n(61)\nAgain, by choosing a unitary matrix U that exchanges the vectors |i, j⟩with a different vector\n|k, l⟩while leaving the other basis states unchanged, and using U ⊗2QU †⊗2 = Q, we derive that:\nQ = a\nd\nX\ni=1\n|i, i⟩⟨i, i| + b\nd\nX\ni,j=1\ni̸=j\n|i, j⟩⟨i, j| + c\nd\nX\ni,j=1\ni̸=j\n|i, j⟩⟨j, i|\n(62)\nwhere a := Q1,1;1,1, b := Q1,2;1,2 and c := Q1,2;2,1. Note that we can also write Q as:\nQ = (a −b −c)\nd\nX\ni=1\n|i, i⟩⟨i, i| + b I + c F.\n(63)\nSince I and F commute with U ⊗2 for all U ∈U(d), then Q is in the commutant if and only if\n(a −b −c) Pd\ni=1 |i, i⟩⟨i, i| is also in the commutant.\nWe now show that Pd\ni=1 |i, i⟩⟨i, i| is not in the commutant, which implies that Q is in the\ncommutant if and only if (a −b −c) = 0, i.e., if and only if Q is a linear combination of only I\nand F. To see this, suppose that Pd\ni=1 |i, i⟩⟨i, i| is in the commutant. Then, it should commute\nwith U ⊗2 for all unitaries U. We can choose the (Discrete Fourier Transform) unitary U such that\nU |k⟩=\n1\n√\nd\nPd\nj=1 ω(j−1)(k−1) |j⟩, where ω := exp\n\u0000i 2π\nd\n\u0001\n, and obtain the following relation:\nd\nX\ni=1\n|i, i⟩⟨i, i| =\nd\nX\ni=1\nU ⊗2 |i, i⟩⟨i, i| U ⊗2†.\n(64)\nHowever, computing the expectation value on both sides of the previous equation over the state\n|1, 1⟩leads to 1 = 1\nd, which is false for every d > 1 (for d = 1, the relation to prove immediately\nfollows). Therefore, we conclude that Pd\ni=1 |i, i⟩⟨i, i| is not in the commutant, and hence Q is in\nthe commutant if and only if Q is a linear combination of I and F.\n4\nSymmetric subspace\nIn this section, we introduce the symmetric subspace, which plays a crucial role when analyzing\nHaar random states.\nFor a more in-depth analysis, see [61].\nThe symmetric subspace can be\ndefined as the set of states |ψ⟩in (Cd)⊗k that are invariant under permutations of their constituent\nsubsystems. Formally, we define the symmetric subspace as follows:\nDefinition 15 (Symmetric subspace).\nSymk(Cd) :=\nn\n|ψ⟩∈(Cd)⊗k : Vd(π) |ψ⟩= |ψ⟩∀π ∈Sk\no\n.\n(65)\n9\n", "11": "To facilitate our analysis, we also define the operator P (d,k)\nsym\nas follows:\nP (d,k)\nsym := 1\nk!\nX\nπ∈Sk\nVd(π).\n(66)\nTheorem 16 (Projector on Symk(Cd)). P (d,k)\nsym\nis the orthogonal projector on the symmetric sub-\nspace Symk(Cd).\nProof. We start by observing that Vd(π)P (d,k)\nsym = P (d,k)\nsym :\nVd(π)P (d,k)\nsym = 1\nk!\nX\nσ∈Sk\nVd(π)Vd(σ) = 1\nk!\nX\nσ∈Sk\nVd(πσ) = 1\nk!\nX\nσ∈Sk\nVd(σ) = P (d,k)\nsym .\n(67)\nUsing this, we can show that P (d,k)2\nsym\n= P (d,k)\nsym :\nP (d,k)2\nsym\n= 1\nk!\nX\nπ∈Sk\nVd(π)P (d,k)\nsym = 1\nk!\nX\nπ∈Sk\nP (d,k)\nsym = P (d,k)\nsym .\n(68)\nFurthermore, we have P (d,k)†\nsym\n= P (d,k)\nsym :\nP (d,k)†\nsym\n= 1\nk!\nX\nπ∈Sk\nV †\nd (π) = 1\nk!\nX\nπ∈Sk\nVd(π−1) = 1\nk!\nX\nπ∈Sk\nVd(π) = P (d,k)\nsym .\n(69)\nTherefore, P (d,k)\nsym is an orthogonal projector. Moreover Im\n\u0010\nP (d,k)\nsym\n\u0011\n⊆Symk(Cd): in fact P (d,k)\nsym |ψ⟩∈\nSymk(Cd) for all |ψ⟩∈(Cd)⊗k, since Vd(π)P (d,k)\nsym |ψ⟩= P (d,k)\nsym |ψ⟩for all π ∈Sk, where we used\nagain that Vd(π)P (d,k)\nsym = P (d,k)\nsym . Moreover if |ψ⟩∈Symk(Cd), then\nP (d,k)\nsym |ψ⟩= 1\nk!\nX\nπ∈Sk\nVd(π) |ψ⟩= 1\nk!\nX\nπ∈Sk\n|ψ⟩= |ψ⟩.\n(70)\nTherefore we also have Symk(Cd) ⊆Im\n\u0010\nP (d,k)\nsym\n\u0011\nand so Symk(Cd) = Im\n\u0010\nP (d,k)\nsym\n\u0011\n.\nWe now turn to computing the dimension of the symmetric subspace.\nTheorem 17 (Dimension of the symmetric subspace).\nTr\n\u0010\nP (d,k)\nsym\n\u0011\n= dim\n\u0000Symk(Cd)\n\u0001\n=\n\u0012k + d −1\nk\n\u0013\n.\n(71)\nProof. The first equality follows by the fact that P (d,k)\nsym is the orthogonal projector onto Symk(Cd).\nNow we observe that:\nSymk(Cd) = Im\n\u0010\nP (d,k)\nsym\n\u0011\n= span\n\u0010\nP (d,k)\nsym |i1⟩⊗· · · ⊗|ik⟩: ∀i1, . . . , ik ∈[d]\n\u0011\n.\n(72)\nTo count the number of vectors in this set that are linearly independent, we make the following\nobservation. Suppose |i1⟩⊗· · · ⊗|ik⟩and |j1⟩⊗· · · ⊗|jk⟩are two computational basis vectors with\ni1, j1, . . . , ik, jk ∈[d] such that the sets {i1, . . . , ik} and {j1, . . . , jk} have the same number nm of\nelements that are equal to m for every m ∈[d]. Then there exists a unitary operator Vd(π) such\nthat Vd(π) |i1⟩⊗· · · ⊗|ik⟩= |j1⟩⊗· · · ⊗|jk⟩. Furthermore, since P (d,k)\nsym Vd(π) = P (d,k)\nsym , it follows\nthat P (d,k)\nsym |i1⟩⊗· · · ⊗|ik⟩= P (d,k)\nsym |j1⟩⊗· · · ⊗|jk⟩.\nTherefore, we can define the set of vectors |n1, . . . , nd⟩, where n1, . . . , nd ∈[k] with n1 + · · · +\nnd = k, as follows:\n|n1, . . . , nd⟩:= P (d,k)\nsym |i1⟩⊗· · · ⊗|ik⟩,\n(73)\nwhere |i1⟩⊗· · · ⊗|ik⟩is any computational basis vector such that, for each m ∈[d], there are nm\ndistinct j ∈[k] such that ij = m. It is easy to see that these vectors are orthogonal, and hence\nlinearly independent. Therefore, the dimension of the symmetric subspace is equal to the number\nof linearly independent vectors in the set |n1, . . . , nd⟩defined earlier. This is equal to the number\nof ways of deciding how to assign k indices between d possible labels, which is\n\u0000k+d−1\nk\n\u0001\n.\n10\n", "12": "Next, we introduce the anti-symmetric subspace.\nDefinition 18 (Anti-symmetric subspace). The anti-symmetric subspace is the set:\nASymk(Cd) :=\nn\n|ψ⟩∈(Cd)⊗k : Vd(π) |ψ⟩= sgn (π) |ψ⟩∀π ∈Sk\no\n,\n(74)\nwhere sgn (σ) denotes the sign of a permutation σ ∈Sk.\nSimilarly as before, we can define the operator:\nP (d,k)\nasym := 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(π).\n(75)\nand prove the following theorem:\nTheorem 19. The operator P (d,k)\nasym is the orthogonal projector on the anti-symmetric subspace\nASymk(Cd).\nProof. We have:\nVd(σ)P (d,k)\nasym = 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(σ)Vd(π) = 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(σπ)\n(76)\n= 1\nk!\nX\nπ∈Sk\nsgn\n\u0000σ−1π\n\u0001\nVd(π) = sgn\n\u0000σ−1\u0001\nP (d,k)\nasym\n(77)\n= sgn (σ) P (d,k)\nasym.\n(78)\nSimilarly, P (d,k)\nasymVd(σ) = sgn (σ) P (d,k)\nasym. Using this, we can show that P (d,k)2\nasym = P (d,k)\nasym:\nP 2\nasym = 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(π)P (d,k)\nasym = 1\nk!\nX\nπ∈Sk\n(sgn (π))2 P (d,k)\nasym = P (d,k)\nasym.\n(79)\nWe also have P (d,k)†\nasym = P (d,k)\nasym:\nP (d,k)†\nasym = 1\nk!\nX\nπ∈Sk\nsgn (π) V †\nd (π) = 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(π−1) = 1\nk!\nX\nπ∈Sk\nsgn\n\u0000π−1\u0001\nVd(π−1)\n(80)\n= 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(π) = P (d,k)\nasym.\n(81)\nWe can show that Im\n\u0010\nP (d,k)\nasym\n\u0011\n⊆ASymk(Cd) as follows: for all |ψ⟩∈(Cd)⊗k, we have P (d,k)\nasym |ψ⟩∈\nASymk(Cd), since Vd(π)P (d,k)\nasym |ψ⟩= sgn (π) P (d,k)\nasym |ψ⟩for all π ∈Sk, where we used again that\nVd(π)P (d,k)\nasym = sgn (π) P (d,k)\nasym. Moreover, we can also show that ASymk(Cd) ⊆Im\n\u0010\nP (d,k)\nasym\n\u0011\n. In fact,\nif |ψ⟩∈ASymk(Cd), then we have:\nP (d,k)\nasym |ψ⟩= 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(π) |ψ⟩= 1\nk!\nX\nπ∈Sk\n(sgn (π))2 |ψ⟩= |ψ⟩.\n(82)\nTherefore, we have shown that Im\n\u0010\nP (d,k)\nasym\n\u0011\n= ASymk(Cd), which implies that P (d,k)\nasym is the\northogonal projector on the anti-symmetric subspace ASymk(Cd).\nNext, we compute the dimension of the anti-symmetric subspace.\nProposition 20 (Dimension of the anti-symmetric subspace). If d ≥k, we have:\nTr\n\u0010\nP (d,k)\nasym\n\u0011\n= dim\n\u0000ASymk(Cd)\n\u0001\n=\n\u0012d\nk\n\u0013\n,\n(83)\notherwise Tr\n\u0010\nP (d,k)\nasym\n\u0011\n= 0.\n11\n", "13": "Proof. First, we have:\nASymk(Cd) = Im\n\u0010\nP (d,k)\nasym\n\u0011\n= span\n\u0010\nP (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩: ∀i1, . . . , ik ∈[d]\n\u0011\n.\n(84)\nTo count the number of linearly independent vectors P (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩, we observe that\nif there are at least two tensor factors of |i1⟩⊗· · · ⊗|ik⟩with matching entry i.e. there exist\nl ̸= m ∈[k] such that il = im, then:\nP (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩= 0.\n(85)\nThis because:\nP (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩= P (d,k)\nasymVd(τl,m) |i1⟩⊗· · · ⊗|ik⟩\n(86)\n= sgn (τl,m) P (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩\n(87)\n= −P (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩,\n(88)\nwhere in the second equality we used P (d,k)\nasymVd(τl,m) = sgn (τl,m) P (d,k)\nasym (as shown in the proof of\nTheorem 19). Therefore, i1, . . . , ik must all be distinct for P (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩to be nonzero.\nThis also implies that if d < k, then Tr\n\u0010\nP (d,k)\nasym\n\u0011\n= 0.\nTherefore, we now focus on the case\nd ≥k.\nIf for all m ∈[d], there exist two vectors |i1⟩⊗· · · ⊗|ik⟩and |j1⟩⊗· · · ⊗|jk⟩with\ni1, j1 . . . , ik, jk ∈[d] such that both sets, {i1, . . . , ik} and {j1, . . . , jk}, contain nm ∈{0, 1} elements\nequal to m, then there exists a permutation Vd(π) such that Vd(π) |i1⟩⊗· · ·⊗|ik⟩= |j1⟩⊗· · ·⊗|jk⟩.\nSince P (d,k)\nasymVd(π) = sgn (π) P (d,k)\nasym, we have P (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩= sgn (π) P (d,k)\nasym |j1⟩⊗· · · ⊗|jk⟩,\nand hence, P (d,k)\nasym |i1⟩⊗· · · ⊗|ik⟩and P (d,k)\nasym |j1⟩⊗· · · ⊗|jk⟩are linearly dependent.\nThus, taking n1, . . . , nd ∈{0, 1} with n1 + · · · + nd = k, we define |n1, . . . , nd⟩as P (d,k)\nasym |i1⟩⊗\n· · ·⊗|ik⟩, where |i1⟩⊗· · ·⊗|ik⟩is any computational basis vector such that, for each m ∈[d], there\nexist nm elements j ∈[k] such that ij = m. It is easy to see that such vectors are orthogonal and\nhence independent. Therefore, the dimension is given by the number of such independent vectors,\nwhich is equal to the number of ways to choose an unordered subset of k elements from a set of d\nelements, which is\n\u0000d\nk\n\u0001\n.\nWe will now present a proposition that establishes a relationship between the symmetric and\nanti-symmetric subspaces.\nProposition 21. We have P (d,k)†\nasym P (d,k)\nsym\n= 0. In particular P (d,k)\nasym and P (d,k)\nsym\nare orthogonal with\nrespect to the Hilbert-Schmidt inner product.\nProof. We have:\nP (d,k)†\nasym P (d,k)\nsym = P (d,k)\nasymP (d,k)\nsym = 1\nk!\nX\nπ∈Sk\nsgn (π) Vd(π)P (d,k)\nsym =\n \n1\nk!\nX\nπ∈Sk\nsgn (π)\n!\nP (d,k)\nsym = 0,\n(89)\nwhere we used that Vd(π)P (d,k)\nsym = P (d,k)\nsym\nand that\n1\nk!\nP\nπ∈Sk sgn (π) = 0 since:\n1\nk!\nX\nπ∈Sk\nsgn (π) = 1\nk!\nX\nπ∈Sk\nsgn (τπ) = sgn (τ) 1\nk!\nX\nπ∈Sk\nsgn (π) = −1\nk!\nX\nπ∈Sk\nsgn (π) ,\n(90)\nwhere τ is any permutation.\nNote that, for k = 2 (and d > 1), we have that, dim\n\u0000Sym2(Cd)\n\u0001\n+ dim\n\u0000ASym2(Cd)\n\u0001\n=\n\u0000d+1\n2\n\u0001\n+\n\u0000d\n2\n\u0001\n= d2, this implies that (Cd)⊗2 = Sym2(Cd) ⊕ASym2(Cd).\nSince P (d,2)\nsym and P (d,2)\nasym are both linear combinations of permutations, they commute with U ⊗2\nfor all unitaries U. Consequently, they are elements of a basis for the commutant Comm(U(d), k =\n2) and they are orthogonal to each other. Furthermore, the commutant can have at most dimension\n12\n", "14": "two, since it is spanned by the identity and Flip operators (Example 14). Thus, P (d,k)\nsym\nand P (d,k)\nasym\nform an orthogonal basis for the commutant.\nSince the moment operator is the orthogonal projector onto the commutant (Theorem 7), we\ncan derive the formula for the second-order moment operator (already derived in Corollary 13),\nusing P (d,k)\nsym\nand P (d,k)\nasym as the basis. We express the moment operator as:\nE\nU∼µH\n\u0002\nU ⊗2OU †⊗2\u0003\n=\nD\nP (d,2)\nsym\n\r\r\rP (d,2)\nsym\n\r\r\r\n2\n, O\nE\nHS\nP (d,2)\nsym\n\r\r\rP (d,2)\nsym\n\r\r\r\n2\n+\nD\nP (d,2)\nasym\n\r\r\rP (d,2)\nasym\n\r\r\r\n2\n, O\nE\nHS\nP (d,2)\nasym\n\r\r\rP (d,2)\nasym\n\r\r\r\n2\n(91)\n=\nTr\n\u0010\nP (d,2)\nsym O\n\u0011\nTr\n\u0010\nP (d,2)\nsym\n\u0011 P (d,2)\nsym +\nTr\n\u0010\nP (d,2)\nasymO\n\u0011\nTr\n\u0010\nP (d,2)\nasym\n\u0011 P (d,2)\nasym\n(92)\n= Tr(O) + Tr(FO)\nd(d + 1)\n\u0012I + F\n2\n\u0013\n+ Tr(O) −Tr(FO)\nd(d −1)\n\u0012I −F\n2\n\u0013\n(93)\n= Tr(O) −d−1 Tr(FO)\nd2 −1\nI + Tr(OF) −d−1 Tr(O)\nd2 −1\nF,\n(94)\nwhere in the first equality we used the fact that P (d,2)\nsym and P (d,2)\nasym are an orthonormal basis for the\ncommutant, we utilized the fact that P (d,2)\nsym and P (d,2)\nasym are orthogonal projectors (meaning that they\nsquare to themselves and are Hermitian), in the third equality we substituted P (d,2)\nsym\n= 1\n2 (I + F)\nand P (d,2)\nasym = 1\n2 (I −F) along with their respective traces to arrive at the desired formula.\nNow we show a theorem that states that for all quantum states |ϕ⟩in a d-dimensional Hilbert\nspace, the moment operator of |ϕ⟩⟨ϕ|⊗k is a uniform linear combination of permutations, which\ncan be written in terms of the projector on the symmetric subspace P (d,k)\nsym .\nTheorem 22. Let d, k ∈N. For all |ϕ⟩∈Cd, the moment operator is a uniform linear combination\nof permutations:\nE\nU∼µH\nh\nU ⊗k |ϕ⟩⟨ϕ|⊗k U †⊗ki\n=\nP (d,k)\nsym\nTr\n\u0010\nP (d,k)\nsym\n\u0011,\n(95)\nwith P (d,k)\nsym = 1\nk!\nP\nπ∈Sk Vd(π) and Tr\n\u0010\nP (d,k)\nsym\n\u0011\n= dim\n\u0000Symk(Cd)\n\u0001\n=\n\u0000k+d−1\nk\n\u0001\n.\nProof. For all σ ∈Sk, we left-multiply both sides of Eq. (30) by Vd(σ−1) and obtain:\nVd(σ−1)M(k)\nµH\n\u0010\n(|ϕ⟩⟨ϕ|)⊗k\u0011\n=\nX\nπ∈Sk\ncπVd(σ−1)Vd(π),\n(96)\nwhere M(k)\nµH\n\u0010\n(|ϕ⟩⟨ϕ|)⊗k\u0011\n:=\nE\nU∼µH\nh\u0000U |ϕ⟩⟨ϕ| U †\u0001⊗ki\n. Using the fact that Vd(σ−1) commutes with\nU ⊗k for all unitaries U and that Vd(σ−1) |ϕ⟩⊗k = |ϕ⟩⊗k, the LHS is:\nVd(σ−1)M(k)\nµH\n\u0010\n(|ϕ⟩⟨ϕ|)⊗k\u0011\n= M(k)\nµH\n\u0010\n(|ϕ⟩⟨ϕ|)⊗k\u0011\n.\n(97)\nThe RHS is:\nX\nπ∈Sk\ncπVd(σ−1)Vd(π) =\nX\nπ∈Sk\ncπVd(σ−1π) =\nX\nπ∈Sk\ncσπVd(π).\n(98)\nTherefore, we have:\nM(k)\nµH\n\u0010\n(|ϕ⟩⟨ϕ|)⊗k\u0011\n=\nX\nπ∈Sk\ncσπVd(π).\n(99)\nAssuming d > 1, the previous equation implies that all the coefficients must be the same, i.e.,\ncσ = cI for all σ ∈Sk (note that this can be shown without using linear independence of the\n13\n", "15": "permutation matrices, but just using that the permutation matrices are all different linear operators\nfor d > 13). Hence, we have:\nM(k)\nµH\n\u0010\n(|ϕ⟩⟨ϕ|)⊗k\u0011\n= cI\n X\nπ∈Sk\nVd(π)\n!\n= cIk! P (d,k)\nsym .\n(100)\nThus, taking the trace, we get:\ncI =\n1\nk! Tr\n\u0010\nP (d,k)\nsym\n\u0011 = 1\nk!\n1\n\u0000k+d−1\nk\n\u0001.\n(101)\nDefinition 23 (Haar measure on states). Given a state |ϕ⟩in Cd, we denote\nE\n|ψ⟩∼µH\nh\n|ψ⟩⟨ψ|⊗ki\n:=\nE\nU∼µH\nh\nU ⊗k |ϕ⟩⟨ϕ|⊗k U †⊗ki\n.\n(102)\nNote that the right invariance of the Haar measure implies that the definition of\nE\n|ψ⟩∼µH\nh\n|ψ⟩⟨ψ|⊗ki\ndoes not depend on the choice of |ϕ⟩. Moreover, due to Theorem 22, we have:\nE\n|ψ⟩∼µH\nh\n|ψ⟩⟨ψ|⊗ki\n=\nP (d,k)\nsym\nTr\n\u0010\nP (d,k)\nsym\n\u0011.\n(103)\n5\nVectorization formalism\nWe define the linear operator vec : L\n\u0000Cd\u0001\n→(Cd)⊗2 as follows: for all i, j ∈[d], we set vec(|i⟩⟨j|) :=\n|i⟩⊗|j⟩.\nThis means that if A ∈L\n\u0000Cd\u0001\nis written as A = Pd\ni,j=1 Ai,j |i⟩⟨j|, then vec(A) =\nPd\ni,j=1 Ai,j |i⟩⊗|j⟩. This justifies the name “vectorization”, as the linear map vec(·) sends the\nd × d matrix A to the d2-dimensional vector vec(A). Importantly, vec(·) is a bijection, meaning\nthat for all |v⟩∈(Cd)⊗2 there exists a unique A ∈L\n\u0000Cd\u0001\nsuch that |v⟩= vec(A) (in fact, one can\ntake A = Pd\ni,j=1 ⟨i, j|v⟩|i⟩⟨j|) and vice versa.\nIt is often convenient to express vec(A) in the form vec(A) = A ⊗I |Ω⟩, where |Ω⟩:= vec(I) =\nPd\ni=1 |i, i⟩is the vectorization of the identity matrix, i.e., the non-normalized maximally entangled\nstate. To simplify the notation, we can use the shorthand |A⟩⟩:= vec(A). Another useful property\nis that the canonical inner product between two vectorized operators A and B is equal to their\nHilbert-Schmidt scalar product, i.e., ⟨⟨A|B⟩⟩= ⟨A, B⟩HS, where ⟨⟨A|B⟩⟩:= vec(A)† vec(B) is the\ncanonical inner product. Using the so-called transpose-trick A ⊗I |Ω⟩= I ⊗AT |Ω⟩, we have the\nABC-rule:\n|ABC⟩⟩= A ⊗CT |B⟩⟩,\n(104)\nfor all A, B, C ∈L\n\u0000Cd\u0001\n.\nConsider a linear superoperator Φ: L(Cd) →L(Cd). It is worth noting that the map |Φ(X)⟩⟩\nis linear with respect to |X⟩⟩for all |X⟩⟩∈(Cd)⊗2. This linearity implies the existence of a matrix\nvec(Φ) ∈L((Cd)⊗2) associated with this linear transformation. In other words, we can express the\naction of Φ on an operator X as follows:\n|Φ(X)⟩⟩= vec(Φ)|X⟩⟩\nfor all X ∈L(Cd).\n(105)\nIt is important to mention that for all linear superoperators Φ : L(Cd) →L(Cd) there exists\na set of matrices {Ai}d2\ni=1, {Bi}d2\ni=1 ∈L(Cd) such that Φ(X) = Pd2\ni=1 AiXB†\ni . To see why, observe\nthat:\nΦ(X) = Tr2\n\u0000I ⊗XT ρΦ\n\u0001\n,\n(106)\n3To see it explicitly, one can choose the permutation σ, which fixes all indices except for two, which are inter-\nchanged.\n14\n", "16": "where ρΦ := Φ⊗I(|Ω⟩⟨Ω|) = Pd\ni,j=1 Φ(|i⟩⟨j|)⊗|i⟩⟨j| is the so-called Choi matrix of Φ, I : L(Cd) →\nL(Cd) is the identity channel and Tr2 indicates the partial trace with respect to the second tensor\nspace. Now, performing a singular value decomposition (SVD) on ρΦ, we have:\nρΦ =\nd2\nX\ni=1\nλi |ui⟩⟨vi| =\nd2\nX\ni=1\n|vec(Ai)⟩⟨vec(Bi)| =\nd2\nX\ni=1\nAi ⊗I |Ω⟩⟨Ω| B†\ni ⊗I,\n(107)\nwhere λi ≥0, |ui⟩and |vi⟩are respectively the singular values and the column vectors associated\nto the SVD unitaries, and we defined Ai := √λivec−1(|ui⟩) and Bi := √λivec−1(|vi⟩). Substituting\nthis expression back into (106), we obtain the desired claim. (Note that if Φ is completely positive,\nthen its Choi matrix is positive, so we can perform an eigendecomposition instead of an SVD, and\narrive at the same conclusion as before, with Bi = Ai.)\nUsing the ABC-rule (104), we can rewrite Φ(X) = Pd2\ni=1 AiXB†\ni as |Φ(X)⟩⟩= Pd2\ni=1 Ai ⊗\nB∗\ni |X⟩⟩, which implies:\nvec(Φ) =\nd2\nX\ni=1\nAi ⊗B∗\ni .\n(108)\nAdditionally, it is often advantageous to express the moment operator M(k)\nµH(O) =\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\nin its vectorized form:\n|M(k)\nµH(O)⟩⟩=\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n|O⟩⟩.\n(109)\nDefinition 24 (Vectorized moment operator). We define the vectorized moment operator M(k)\nµH ∈\nL\n\u0000(Cd)⊗2k\u0001\nas:\nM(k)\nµH := vec(M(k)\nµH) =\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n.\n(110)\nProposition 7 has a vectorized version as follows:\nProposition 25. Let the commutant space be Comm := Comm(U(d), k). Let {Pi}dim(Comm)\ni=1\nbe\nelements of an orthonormal basis of Comm with respect to the Hilbert-Schmidt inner product. Then,\nwe have:\nM(k)\nµH :=\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n=\ndim(Comm)\nX\ni=1\n|Pi⟩⟩⟨⟨Pi|.\n(111)\nMoreover, we have Tr\n\u0010\nM(k)\nµH\n\u0011\n= dim (Comm).\nProof. Vectorizing the equation derived in Proposition 7, we have:\nM(k)\nµH|O⟩⟩= |M(k)\nµH(O)⟩⟩=\ndim(Comm)\nX\ni=1\n⟨Pi, O⟩HS|Pi⟩⟩=\ndim(Comm)\nX\ni=1\n|Pi⟩⟩⟨⟨Pi|O⟩⟩.\n(112)\nSince the previous equation holds for all O ∈L\n\u0000(Cd)⊗k\u0001\nand therefore for all |O⟩⟩∈(Cd)⊗2k, we\nhave the thesis.\nBuilding upon the previous proposition and the fact that Tr\n\u0010\nM(k)\nµH\n\u0011\n=\nE\nU∼µH |Tr(U)|2k, we can\nderive the following equation:\nE\nU∼µH |Tr(U)|2k = dim(Comm(U(d), k)).\n(113)\nIn the case where d ≥k (which is the case we are most interested in), we find that\nE\nU∼µH |Tr(U)|2k =\nk!. This is due to the fact that the k-th order commutant of the unitary group corresponds to the\n15\n", "17": "span of the permutation operators (as a consequence of Schur-Weyl duality, see Theorem 9), which\nare linearly independent for d ≥k (as stated in Proposition 11).\nIt is also worth noting that the vectorized moment operator M(k)\nµH is an orthogonal projector,\nsince M(k)2\nµH\n= M(k)\nµH (due to the right invariance of the Haar measure) and M(k)†\nµH = M(k)\nµH (due to\nProposition 3).\nFurthermore, as an exercise, we provide an alternative proof of Theorem 7 based on vectoriza-\ntion.\nTheorem 26 (Projector onto the commutant). The moment operator M(k)\nµH(·) =\nE\nU∼µH\n\u0002\nU ⊗k (·) U †⊗k\u0003\nis the orthogonal projector onto the commutant Comm := Comm(U(d), k) with respect to the\nHilbert-Schmidt inner product. In particular, let P1, . . . , Pdim(Comm) be an orthonormal basis of\nComm and let O ∈L((Cd)⊗k). Then, we have:\nM(k)\nµH(O) =\ndim(Comm)\nX\ni=1\n⟨Pi, O⟩HSPi .\n(114)\nProof. Since the vectorized moment operator M(k)\nµH is an orthogonal projector, it admits an eigende-\ncomposition with eigenvalues 0 and 1 and eigenvectors {vi}r\ni=1, where r is the rank of the projector\nM(k)\nµH:\nM(k)\nµH := vec(M(k)\nµH) =\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n=\nr\nX\ni=1\n|vi⟩⟨vi| =\nr\nX\ni=1\n|Pi⟩⟩⟨⟨Pi|,\n(115)\nwhere we used the fact that for each |vi⟩, there exists Pi ∈L((Cd)⊗k) such that |vi⟩= |Pi⟩⟩for\neach i ∈[r]. We note that Pi are operators in Comm(U(d), k). This can be shown as follows:\nPi = vec−1(|Pi⟩⟩) = vec−1\u0010\nvec(M(k)\nµH)|Pi⟩⟩\n\u0011\n= M(k)\nµH(Pi) ∈Comm(U(d), k),\n(116)\nwhere in the last step we used Lemma 6.2. Furthermore, {Pi}r\ni=1 form an orthonormal set with\nrespect to the Hilbert-Schmidt inner product:\n⟨Pi, Pj⟩HS = ⟨⟨Pi|Pj⟩⟩= ⟨vi|vj⟩= δi,j\n∀i, j ∈[r].\n(117)\nMoreover, they constitute a basis for Comm since, for all A ∈Comm, we have |A⟩⟩= M(k)\nµH|A⟩⟩=\nPr\ni=1⟨⟨Pi|A⟩⟩|Pi⟩⟩, which implies that A ∈span ({Pi}r\ni=1). Hence, the rank of M(k)\nµH is equal to the\ndimension of the commutant, i.e., r = dim (Comm). Consequently, we can conclude the proof by\nnoting that for all O ∈L\n\u0000(Cd)⊗k\u0001\n:\nM(k)\nµH(O) = vec−1\u0010\nvec(M(k)\nµH)|O⟩⟩\n\u0011\n= vec−1\n r\nX\ni=1\n|Pi⟩⟩⟨⟨Pi|O⟩⟩\n!\n=\nr\nX\ni=1\n⟨Pi, O⟩HSPi.\n(118)\nTo address the issue of the permutation matrices not being orthonormal, we can introduce a\nvectorized version of Eq.(35) that provides a concise representation of the moment operator.\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n=\nX\nπ,σ∈Sk\nWg(π−1σ, d)|Vd(π)⟩⟩⟨⟨Vd(σ)|.\n(119)\nProof. Using Eq.(35), we have:\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n|O⟩⟩=\nE\nU∼µH|U ⊗kOU †⊗k⟩⟩\n(120)\n=\nX\nπ,σ∈Sk\nWg\n\u0000π−1σ, d\n\u0001\n|Vd(π)⟩⟩Tr\n\u0010\nV †\nd (σ)O\n\u0011\n(121)\n=\nX\nπ,σ∈Sk\nWg\n\u0000π−1σ, d\n\u0001\n|Vd(π)⟩⟩⟨⟨Vd(σ)|O⟩⟩.\n(122)\nSince this equation holds for all vectors |O⟩⟩in (Cd)⊗2k, we conclude the proof.\n16\n", "18": "We can now write the moment operator equations for k = 1 and k = 2 presented in Example 13\nin their vectorized form:\nE\nU∼µH [U ⊗U ∗] = 1\nd|I⟩⟩⟨⟨I|,\n(123)\nE\nU∼µH\n\u0002\nU ⊗2 ⊗U ∗⊗2\u0003\n=\n1\nd2 −1\n\u0014\n|I⟩⟩⟨⟨I| −1\nd|I⟩⟩⟨⟨F| −1\nd|F⟩⟩⟨⟨I| + |F⟩⟩⟨⟨F|\n\u0015\n.\n(124)\nProof. For Equation (123), we have:\nE\nU∼µH [U ⊗U ∗] |O⟩⟩=\nE\nU∼µH|UOU †⟩⟩= Tr(O)\nd\n|I⟩⟩= 1\nd|I⟩⟩⟨⟨I|O⟩⟩,\n(125)\nwhere we used ⟨⟨I|O⟩⟩= Tr(IO) = Tr(O). For Equation (124), we have:\nE\nU∼µH\n\u0002\nU ⊗2 ⊗U ∗⊗2\u0003\n|O⟩⟩=\nE\nU∼µH|U ⊗2OU †⊗2⟩⟩\n(126)\n= Tr(O) −d−1 Tr(FO)\nd2 −1\n|I⟩⟩+ Tr(FO) −d−1 Tr(O)\nd2 −1\n|F⟩⟩\n(127)\n=\n1\nd2 −1\n\u0014\n|I⟩⟩⟨⟨I|O⟩⟩−1\nd|I⟩⟩⟨⟨F|O⟩⟩−1\nd|F⟩⟩⟨⟨I|O⟩⟩+ |F⟩⟩⟨⟨F|O⟩⟩\n\u0015\n,\n(128)\nwhere we used that F† = F, ⟨⟨I|O⟩⟩= Tr(O) and ⟨⟨F|O⟩⟩= Tr(FO).\nEquations like the ones presented above can be effectively visualized and manipulated using\nTensor Network diagrams.\n6\nTensor network diagrams\nTensor Networks provide a graphical representation that simplifies the understanding and analysis\nof tensor operations [62]. In these diagrams, tensors are represented as boxes (or nodes), and\ntensor contractions are represented as connections between boxes. To illustrate the concept, we\nuse specific diagrams for ket-states, bra-states, and matrices. A ket-state |ψ⟩∈Cd is represented\nwith a box and a leg as follows:\n|ψ⟩\n.\n(129)\nSimilarly, a bra-state ⟨ψ| is represented as:\n⟨ψ|\n.\n(130)\nMatrices, such as A ∈L\n\u0000Cd\u0001\n, are depicted like boxes with one leg in and one leg out as:\nA\n.\n(131)\nIn particular, the identity matrix I ∈L\n\u0000Cd\u0001\nis simply represented by a line:\n.\n(132)\n17\n", "19": "The trace Tr(A) of an operator A ∈L\n\u0000Cd\u0001\nis denoted as:\nA\nA\n=\n.\n(133)\nGiven A, B ∈L\n\u0000Cd\u0001\n, their product AB is represented by placing the box representing matrix A\non the left side of the box representing matrix B. This can be illustrated as follows:\nA\nB\n.\n(134)\nThe transpose AT of the matrix A is depicted by:\nA\nAT\n=\n.\n(135)\nGiven A ∈L\n\u0000Cd\u0001\nand B ∈L\n\u0010\nCd′\u0011\n, their tensor product A ⊗B is denoted by arranging the box\nrepresenting matrix B below the box representing matrix A:\nA\nB\n.\n(136)\nA ∈L\n\u0000Cd\u0001\n⊗L\n\u0010\nCd′\u0011\nis represented with a box that has two (different) legs on the left and two\non the right:\nA\n.\n(137)\nThe partial trace with respect to the second tensor space Tr2 (A) is denoted as:\nA\n,\n(138)\nand similarly for the partial trace with respect to the first tensor space.\n18\n", "20": "Particularly important is the non-normalized maximally entangled state |Ω⟩= |I⟩⟩, which is\nthe vectorization of the identity and is denoted as:\n=\n|𝕀⟩⟩\n=\n.\n(139)\nGiven an operator A ∈L\n\u0000Cd\u0001\n, its vectorization |A⟩⟩= A ⊗I |Ω⟩is represented as:\nA\nAT\n=\n|A⟩⟩\n=\n,\n(140)\nwhere the equality is due to the transpose-trick |A⟩⟩= A ⊗I |Ω⟩= I ⊗AT |Ω⟩. In Tensor Network\nnotation, the diagram below makes it clear that ⟨⟨A|B⟩⟩= Tr\n\u0000A†B\n\u0001\n:\n,\n(141)\nas well as the ABC-rule (104):\n|ABC⟩⟩=\nB\nA\nC\nB\nA\n=\nCT\n|B⟩⟩\n=\nA\nCT\n, (142)\nwhere A, B, C ∈L\n\u0000Cd\u0001\n.\nIn accordance with the Definition 23, a permutation matrix Vd(π), with π ∈Sk, maps the\ntensor product state |ψ1⟩⊗· · · ⊗|ψk⟩to the tensor product state\n\f\fψπ−1(1)\n\u000b\n⊗· · · ⊗\n\f\fψπ−1(k)\n\u000b\n:\nVd(π)\n|ψ1⟩\n|ψπ−1(1)⟩\n|ψπ−1(2)⟩\n|ψπ−1(k)⟩\n|ψ2⟩\n|ψk⟩\n=\n,\n(143)\nand it can be represented by a diagram with lines connecting the tensor space of the i-th element\non the right with the the π(i)-th element on the left for each i ∈[k]. For example, the identity\noperator I and the Flip operator F are represented as follows:\n핀\n=\n,\n픽\n=\n.\n(144)\n19\n", "21": "The composition of permutations can be visualized by placing the corresponding diagrams next to\neach other. When considering a matrix A ∈L\n\u0000Cd\u0001\n⊗L\n\u0010\nCd′\u0011\n, its vectorization is represented as:\nA\n.\n(145)\nFor instance, the vectorization of the identity operator I and the Flip operator F are represented\nas:\n핀\n=\n,\n픽\n=\n.\n(146)\nUsing this diagrammatic notation, we can express Eq.(123)\nE\nU∼µH [U ⊗U ∗] = 1\nd|I⟩⟩⟨⟨I| in Tensor\nNetwork notation as:\nEU∼µH\n\n\nU\nU*\n\n\n= 1\nd\n.\n(147)\nSimilarly, Eq.(124)\nE\nU∼µH\n\u0002\nU ⊗2 ⊗U ∗⊗2\u0003\n=\n1\nd2−1\n\u0002\n|I⟩⟩⟨⟨I| −1\nd|I⟩⟩⟨⟨F| −1\nd|F⟩⟩⟨⟨I| + |F⟩⟩⟨⟨F|\n\u0003\ncan be rep-\nresented as:\nEU∼µH\n\n\n\n\n=\n1\nd2 −1\n\n\n−1\nd\n−1\nd\n+\n\n\n.\n(148)\nUsing the diagrammatic notation, we can easily see that:\nE\nU∼µH\n\u0002\nUi1,j1U ∗\ni2,j2\n\u0003\n= 1\ndδi1,i2δj1,j2,\n(149)\nwhere we used\nE\nU∼µH\n\u0002\nUi1,j1U ∗\ni2,j2\n\u0003\n= ⟨i1, i2|\nE\nU∼µH [U ⊗U ∗] |j1, j2⟩and δa,b represents the Kronecker\ndelta. Similarly:\nE\nU∼µH\n\u0002\nUi1,j1Ui2,j2U ∗\ni3,j3U ∗\ni4,j4\n\u0003\n=\n1\nd2 −1\n\u0014\nδi1,i3δi2,i4δj1,j3δj2,j4 −1\ndδi1,i3δi2,i4δj1,j4δj2,j3\n\u0015\n(150)\n+\n1\nd2 −1\n\u0014\n−1\ndδi1,i4δi2,i3δj1,j3δj2,j4 + δi1,i4δi2,i3δj1,j4δj2,j3\n\u0015\n,\n(151)\n20\n", "22": "where we used\nE\nU∼µH\n\u0002\nUi1,j1Ui2,j2U ∗\ni3,j3U ∗\ni4,j4\n\u0003\n= ⟨i1, i2, i3, i4|\nE\nU∼µH\n\u0002\nU ⊗2 ⊗U ∗⊗2\u0003\n|j1, j2, j3, j4⟩. An-\nother useful relation is the partial-swap-trick Tr2(A ⊗B F) = AB, which can be visualized as:\nB\nA\n=\nA\nB\n,\n(152)\nand thus we have the swap-trick formula Tr(A ⊗B F) = Tr(AB). Similarly we also have Tr1(A ⊗\nB F) = BA.\nMore generally, consider the cyclic permutation πcyc ∈Sk, which corresponds to the unitary\noperator:\nVd(πcyc) =\nX\ni1,...,ik∈[d]\n|i2, . . . , ik, i1⟩⟨i1, i2, . . . , ik| .\n(153)\nThis unitary operator can be depicted diagrammatically as:\n=\nVd(πcyc)\n.\n(154)\nNow, we want to calculate Tr2,...,n (A1 ⊗· · · ⊗AnVd(πcyc)), and we will show that it simplifies\nto A1 · · · An. We can verify this through direct calculation using resolutions of identities:\nTr2,...,n (A1 ⊗· · · ⊗Ak Vd(πcyc)) =\nX\ni1,...,ik∈[d]\nTr2,··· ,k (A1 ⊗· · · ⊗Ak |i2, . . . , ik, i1⟩⟨i1, i2, . . . , ik|)\n=\nX\ni1,...,ik∈[d]\nA1 |i2⟩⟨i1| ⟨i2| A2 |i3⟩⟨i3| A3 |i4⟩· · · ⟨ik| Ak |i1⟩\n=\nX\ni1,i2∈[d]\nA1 |i2⟩⟨i1| ⟨i2| A2A3 · · · Ak |i1⟩= A1 · · · Ak,\n(155)\nAlternatively, we can represent this calculation diagrammatically as:\nA1\nA2\nA3\nAk\nVd(πcyc)\n=\nAk\nA1\n.\n(156)\nHence, we have the generalized swap-trick, known as the cyclic-permutation-trick:\nTr(A1 ⊗· · · ⊗Ak Vd(πcyc)) = Tr(A1 · · · Ak).\n(157)\n21\n", "23": "7\nUnitary designs\nGenerating Haar random unitaries on a quantum computer can be a computationally expensive\ntask, since most unitaries require an exponential number of elementary gates with respect to the\nnumber of qubits [3, 39, 63] to be implemented.\nHowever, for many applications in quantum\ninformation, only low-order moments of the Haar measure are needed [1, 10, 13–15, 21, 40]. This\nmotivates the definition of unitary k-designs [64], which are distributions of unitaries that match\nthe moments of the Haar measure up to the k-th order, where k ∈N. As we will mention later,\ngenerating unitary k-designs can be done efficiently in the number of elementary gates.\nDefinition 27 (Unitary k-design). Let ν be a probability distribution defined over a set of unitaries\nS ⊆U(d). The distribution ν is unitary k-design if and only if:\nE\nV ∼ν\n\u0002\nV ⊗kOV †⊗k\u0003\n=\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\n,\n(158)\nfor all O ∈L\n\u0000(Cd)⊗k\u0001\n.\nFor instance, consider a distribution ν where the set of unitaries S is discrete and each unitary\nhas an equal probability of being chosen. In this case, we have:\nE\nV ∼ν\n\u0002\nV ⊗kOV †⊗k\u0003\n= 1\n|S|\nX\nV ∈S\nV ⊗kOV †⊗k.\n(159)\nAn equivalent way to define a unitary k-design is to relate the vectorized moment operator of the\ndistribution ν to that of the Haar measure µH. Specifically, we have the following:\nObservation 28. A probability distribution ν is a unitary k-design if and only if:\nE\nV ∼ν\n\u0002\nV ⊗k ⊗V ∗⊗k\u0003\n=\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n.\n(160)\nProof. By taking the vectorization to both sides of Eq.(158), we have:\nE\nV ∼ν\n\u0002\nV ⊗k ⊗V ∗⊗k\u0003\n|O⟩⟩=\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n|O⟩⟩.\n(161)\nNow Eq.(160) follows by observing that for all |ψ⟩∈(Cd)⊗2k there exists O ∈L\n\u0000(Cd)⊗k\u0001\nsuch\nthat |O⟩⟩= |ψ⟩. Similarly, the converse holds.\nObservation 29. If ν is a (k + 1)-design, then ν is also a k-design.\nProof. Let O = O′ ⊗I\nd where O′ ∈L\n\u0000(Cd)⊗k\u0001\n. The claim follows by applying the Definition 27\nwith such defined O and taking the partial trace with respect to the (k + 1)-th tensor product\nspace.\nIt is also useful to define the following quantity, the frame potential [65], which provides another\nway to verify if a probability distribution is a k-design.\nDefinition 30 (Frame potential). Let ν be a probability distribution defined over the set of unitaries\nS ⊆U(d). For a given k ∈N, we define the k-frame potential, denoted as F(k)\nν\n, as follows:\nF(k)\nν\n:=\nE\nU,V ∼ν\nh\f\fTr\n\u0000UV †\u0001\f\f2ki\n.\n(162)\nAs we will show in Proposition 34, a probability distribution ν is a k-design if and only if its k-\nframe potential coincides with that of the Haar measure µH. Thus, given a probability distribution\nν and a set of unitaries S, we can compute the frame potential F(k)\nν\nand compare it with that of\nthe Haar measure to determine whether ν is a k-design or not. It is also useful to define the notion\nof k-invariant distribution.\n22\n", "24": "Definition 31 (k-invariant measure). Let ν be a probability distribution defined over a set of\nunitaries S ⊆U(d). ν is k-invariant if and only if, for any polynomial p(U) of degree ≤k in the\nmatrix elements of U and U ∗, it holds\nE\nU∼ν [ p (U)] = E\nU∼ν [ p (UV )] = E\nU∼ν [ p (V U)] ,\n(163)\nfor all V ∈S.\nWe begin by making the following observation, which will be useful for computing the frame\npotential of the Haar measure µH.\nLemma 32. Let ν be a probability distribution defined over a set of unitaries S ⊆U(d). If ν is\nk-invariant, then we have:\nF(k)\nν\n= dim (Comm(S, k)) ,\n(164)\nwhere Comm(S, k) is defined in Definition 5.\nProof. By (right) k-invariance we have:\nF(k)\nν\n=\nE\nU,V ∼ν\nh\f\fTr\n\u0000UV †\u0001\f\f2ki\n= E\nU∼ν\nh\n|Tr(U)|2ki\n.\n(165)\nTherefore:\nF(k)\nν\n= E\nU∼ν\nh\n|Tr(U)|2ki\n= E\nU∼ν\nh\nTr(U)k Tr(U ∗)ki\n= Tr\n\u0010\nE\nU∼ν\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\u0011\n.\n(166)\nWe can conclude the proof by observing that Tr\n\u0010\nE\nU∼ν\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\u0011\n= dim (Comm(S, k)), ac-\ncording to Proposition 25. Note that although the proof of Proposition 25 was given for the Haar\nmeasure on the unitary group, it applies equally to any k-invariant measure.\nIt is worth noting that the left and right invariance properties, and therefore Lemma 32, hold\nfor any uniform probability distribution ν defined over a subgroup of unitaries S.\nIn the following lemma, we show that the difference between the frame potential of a probability\ndistribution ν (not necessarily k-invariant) and that of the Haar measure µH can be represented\nby the squared 2-norm of the difference between their vectorized moment operator.\nLemma 33 (Frame potential difference). Let F(k)\nν\nand F(k)\nµH be the frame potentials of the proba-\nbility distribution ν and the Haar measure µH, respectively. Then, we have:\nF(k)\nν\n−F(k)\nµH =\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k ⊗V ∗⊗k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\r\r\r\r\n2\n2\n.\n(167)\nProof. Let M(k)\nµH :=\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\nand M(k)\nν\n:=\nE\nV ∼ν\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n.\nFirst, we note that M(k)†\nµH = M(k)\nµH due to Proposition 3. Furthermore, because of the invariance\nof the Haar measure, we have M(k)2\nµH\n= M(k)\nµH and M(k)\nν M(k)\nµH = M(k)\nν M(k)†\nµH = M(k)\nµH. Thus, by using\nthese properties, we obtain:\n\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n2\n2 = Tr\n\u0014\u0010\nM(k)\nν\n−M(k)\nµH\n\u0011† \u0010\nM(k)\nν\n−M(k)\nµH\n\u0011\u0015\n(168)\n= Tr\nh\nM(k)†\nν\nM(k)\nν\ni\n+ Tr\nh\nM(k)†\nµH M(k)\nµH\ni\n−Tr\nh\nM(k)†\nν\nM(k)\nµH\ni\n−Tr\nh\nM(k)†\nµH M(k)\nν\ni\n(169)\n= Tr\nh\nM(k)†\nν\nM(k)\nν\ni\n−Tr\nh\nM(k)\nµH\ni\n(170)\n= Tr\nh\nM(k)\nν M(k)†\nν\ni\n−Tr\nh\nM(k)\nµHM(k)†\nµH\ni\n.\n(171)\nWe can conclude by observing that for µ = µH and µ = ν we have:\nTr\nh\nM(k)\nµ M(k)†\nµ\ni\n=\nE\nV,U∼µ Tr\n\u0002\n(UV †)⊗k ⊗(UV †)∗⊗k\u0003\n=\nE\nV,U∼µ\nh\f\fTr\n\u0000UV †\u0001\f\f2ki\n= F(k)\nµ .\n(172)\n23\n", "25": "It follows from the previous Lemma that showing that a distribution ν is a k-design can be\nachieved by computing its frame potential and comparing it with that of the Haar measure µH. This\nis due to the fact that if the two frame potentials coincide, the difference between their vectorized\nmoment operators in 2-norm must be zero, hence they must be equal (which is an equivalent unitary\ndesign definition because of Observation 28). We can restate the result explicitly as follows:\nProposition 34 (Frame potential k-design condition). We have:\nF(k)\nν\n≥F(k)\nµH = dim(span(Vd(π) : π ∈Sk)).\n(173)\nMoreover, the equality holds if and only if ν is a k-unitary design.\nIn particular, if k ≤d, then dim(span(Vd(π) : π ∈Sk)) = k!.\nProof. By Lemma 33, Lemma 32 and Schur-Weyl duality 9, we have:\nF(k)\nν\n≥F(k)\nµH = dim (Comm(U(d), k)) = dim (span(Vd(π) : π ∈Sk)) .\n(174)\nMoreover, by Proposition 11, we have that if k ≤d, then the number of linearly independent\npermutation matrices is k!.\nBy utilizing this result, we can derive a straightforward lower bound on the cardinality of a\ndiscrete set S of unitaries necessary to form a k-design. To establish this bound, let us consider\nthe frame potential F(k)\nν\nassociated with the uniform distribution ν over the discrete set S. We\ncan then deduce that:\nF(k)\nν\n=\n1\n|S|2\n|S|\nX\ni,j=1\n\f\f\fTr\n\u0010\nUiU †\nj\n\u0011\f\f\f\n2k\n≥\n1\n|S|2\n|S|\nX\ni=1\n\f\f\fTr\n\u0010\nUiU †\ni\n\u0011\f\f\f\n2k\n= 1\n|S|d2k.\n(175)\nFurthermore, considering the fact that ν constitutes a k-design (with k ≤d), by the previous\nproposition, we have that F(k)\nν\n= k!. This implies that the cardinality of the set S must satisfy\n|S| ≥d2k\nk! . Consequently, if we are considering an n-qubit system where the Hilbert space dimension\nis d = 2n, the cardinality of S must grow at least exponentially with the number of qubits. For a\nmore comprehensive analysis of lower bounds of k-design, we recommend referring to the following\nreferences [39, 59, 65, 66].\nThe following proposition provides equivalent definitions of unitary k-design:\nProposition 35 (Equivalent definitions of unitary k-design.). Let ν be a probability distribution\nover a set of unitaries S ⊆U. Then, ν is a unitary k-design if and only if:\n1.\nE\nU∼ν\n\u0002\nU ⊗kOU †⊗k\u0003\n=\nE\nU∼µH\n\u0002\nU ⊗kOU †⊗k\u0003\nfor all O ∈L\n\u0000(Cd)⊗k\u0001\n.\n2.\nE\nV ∼ν\n\u0002\nV ⊗k ⊗V ∗⊗k\u0003\n=\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\n.\n3.\nF(k)\nν\n= dim (Comm(U(d), k)).\n4.\nE\nV ∼ν[ p(V ) ] =\nE\nU∼µH[ p(U) ] for all polynomials p(U) homogeneous of degree k in the matrix\nelements of U and homogeneous of degree k in the matrix elements of U ∗.\nProof. The equivalence between 1. and 2. is shown in Observation 28 and the one between 2.\nand 3. is shown in Proposition 34. To show that 2. implies 4., we observe that any homogeneous\npolynomial p(U) of degree k in the elements of U and in the elements of U ∗can be written\nas p(U) = Tr\n\u0002\nAU ⊗k ⊗U ∗⊗k\u0003\nfor a matrix A ∈L\n\u0000(Cd)⊗2k\u0001\nwith entries the coefficients of the\npolynomial. Similarly, to show that 4. implies 2., we note that, for all matrices A ∈L\n\u0000(Cd)⊗2k\u0001\n,\npA(U) := Tr\n\u0002\nAU ⊗k ⊗U ∗⊗k\u0003\nis a homogeneous polynomial of degree k in both the elements of U\nand U ∗. Therefore we have\nTr\n\u0010\nA E\nV ∼ν\n\u0002\nV ⊗k ⊗V ∗⊗k\u0003\u0011\n= Tr\n\u0012\nA\nE\nU∼µH\n\u0002\nU ⊗k ⊗U ∗⊗k\u0003\u0013\nfor all A ∈L\n\u0000(Cd)⊗2k\u0001\n,\n(176)\nwhich implies the point 2.\n24\n", "26": "Moreover, if ν is a uniform distribution over a set of unitaries S which forms a group, then\nif dim (Comm(S, k)) = dim (Comm(U(d), k)), then, by Proposition 32 and Proposition 34, ν is a\nk-unitary design.\nNow we turn to the definition of k-designs for distributions over sets of states, which are known\nas state k-designs or spherical k-designs [67].\nDefinition 36 (State k-design). Let η be a probability distribution over a set of states S ⊆Cd.\nThe distribution η is said to be a state k-design (or also spherical k-designs) if and only if:\nE\n|ψ⟩∼η\nh\n|ψ⟩⟨ψ|⊗ki\n=\nE\n|ψ⟩∼µH\nh\n|ψ⟩⟨ψ|⊗ki\n.\n(177)\nA unitary k-design ν induces a k-state design for the probability distribution over states U |ψ0⟩,\nwhere U is drawn from ν and |ψ0⟩is fixed. This can be seen by setting O = (|ψ0⟩⟨ψ0|)⊗k in\nDefinition 27.\nSimilarly to the unitary k-design case, we can define the so-called state frame potential.\nDefinition 37 (State frame potential). The state frame potential is defined as:\nF(k,η)\nstate :=\nE\n|ψ⟩,|ϕ⟩∼η\nh\n|⟨ψ|ϕ⟩|2ki\n.\n(178)\nWe now state a proposition that relates the state frame potential to k-designs:\nProposition 38 (State frame potential design). Let η be a probability distribution over a set of\nstates S ⊆Cd. Then:\nF(k,η)\nstate ≥\n\u0000dim\n\u0000Symk(Cd)\n\u0001\u0001−1 ,\n(179)\nwhere dim\n\u0000Symk(Cd)\n\u0001\n=\n\u0000d+k−1\nk\n\u0001\n. Equality holds if and only if η is a k-state design.\nProof. We denote A(k)\nµH :=\nE\n|ψ⟩∼µH\nh\n|ψ⟩⟨ψ|⊗ki\nand A(k)\nη\n:=\nE\n|ψ⟩∼η\nh\n|ψ⟩⟨ψ|⊗ki\n. We have:\n\r\r\rA(k)\nη\n−A(k)\nµH\n\r\r\r\n2\n2 = Tr\n\u0014\u0010\nA(k)\nη\n−A(k)\nµH\n\u00112\u0015\n(180)\n= Tr\n\u0014\u0010\nA(k)\nη\n\u00112\u0015\n+ Tr\n\u0014\u0010\nA(k)\nµH\n\u00112\u0015\n−2 Tr\nh\nA(k)\nη A(k)\nµH\ni\n(181)\n=\nE\n|ψ⟩,|ϕ⟩∼η\nh\n|⟨ψ|ϕ⟩|2ki\n+ Tr\n\u0014\u0010\nA(k)\nµH\n\u00112\u0015\n−2 Tr\nh\nA(k)\nη A(k)\nµH\ni\n,\n(182)\nwhere in the second equality we used cyclicity of the trace. Additionally, we have:\nTr\n\u0014\u0010\nA(k)\nµH\n\u00112\u0015\n= Tr\n\n\n \nP (d,k)\nsym\ndim (Symk(Cd))\n!2\n\n(183)\n= Tr\n\"\nP (d,k)\nsym\n(dim (Symk(Cd)))2\n#\n(184)\n=\n\u0000dim\n\u0000Symk(Cd)\n\u0001\u0001−1 ,\n(185)\nwhere in the first equality we used Eq.(95), in the second equality the fact that P (d,k)\nsym\nsquares\nto itself (Theorem 16) and in the last equality the fact that P (d,k)\nsym\nis the orthogonal projector\non the symmetric subspace (Theorem 16). Similarly, we can show that Tr\nh\nA(k)\nη A(k)\nµH\ni\nis equal to\n\u0000dim\n\u0000Symk(Cd)\n\u0001\u0001−1. Here, dim\n\u0000Symk(Cd)\n\u0001\ncan be calculated using Proposition 17, which shows\nthat it is equal to\n\u0000d+k−1\nk\n\u0001\n. Therefore, we can conclude.\n25\n", "27": "It is worth noting that any uniform distribution ν defined over a set of unitaries S = {Ui}d2\ni=1\nthat forms a basis for L(Cd) and satisfies Tr\n\u0010\nU †\ni Uj\n\u0011\n= dδi,j constitutes a 1-design. This can be\neasily proven by computing the frame potential as follows:\nF(k=1)\nν\n=\n1\n|S|2\nd2\nX\ni,j=1\n\f\f\fTr\n\u0010\nUiU †\nj\n\u0011\f\f\f\n2\n= 1\nd4\nd2\nX\ni,j=1\nd2δi,j = 1 = dim(span(Vd(π) : π ∈S1)),\n(186)\nand applying Proposition 34.\nTherefore, the uniform distribution defined over the Pauli basis\n˜P := {I, X, Y, Z}⊗n is a 1-design, where n is the number of qubits and d = 2n.\nThe Flip operator can be elegantly represented in terms of the Pauli basis using the following\nexpression:\nF =\nX\nP,Q∈˜\nP\n1\nd2 Tr((P ⊗Q) F)P ⊗Q =\nX\nP,Q∈˜\nP\n1\nd2 Tr(PQ)P ⊗Q =\nX\nP ∈˜\nP\n1\ndP ⊗P,\n(187)\nwhere we wrote the Flip operator in the Pauli basis and used the swap-trick. Using this, it is\nalso evident that the Pauli group forms a 1-design (according to Definition 27). In fact, for any\nO ∈L\n\u0000Cd\u0001\n, we have:\n1\n| ˜P|\nX\nP ∈˜\nP\nPOP † = 1\nd2\nX\nP ∈˜\nP\nTr2 ((I ⊗O)(P ⊗P)F) = 1\nd Tr2 ((I ⊗O)FF) = Tr(O)\nd\n=\nE\nU∼µH\n\u0002\nUOU †\u0003\n,\nwhere in the first step we used the partial-swap-trick (Eq.(152)) and in the last step (Eq.(50)).\nAn important set of unitaries is the Clifford group Cl(n) [68] i.e. the set of unitaries which\nsends the Pauli group Pn in itself under the adjoint operation:\nCl(n) := {U ∈U(2n): UPU † ∈Pn for all P ∈Pn},\n(188)\nwhere Pn := {ik}3\nk=0 × {I, X, Y, Z}⊗n. It can be proven that the uniform distribution over the\nClifford group, forms a 3-design for all d = 2n [69, 70], but it fails to be a 4-design [71].\nMoreover, it can be shown that any Clifford circuit can be implemented with O(n2/ log(n))\ngates from the set {H, CNOT, S} where H, CNOT and S are the Hadamard, Controlled-NOT and\nPhase gate, respectively [63, 72]. Furthermore, there are efficient algorithms to sample uniformly\nfrom the Clifford group [73, 74]. This is of fundamental importance for applications in quantum\ncomputing, since if we are interested in reproducing moments of the Haar measure up to the third\nmoment, it is sufficient to sample efficient quantum circuits that correspond to Clifford unitaries\n(instead of sampling from the Haar measure, which would require implementing quantum circuits\nwith an exponential number of gates in the number of qubits [63]).\n8\nApproximate unitary designs\nIn many cases, having an exact unitary design may not be necessary, and having an approximate\none may suffice. Various definitions of approximate unitary designs have been proposed in the\nliterature [39, 49, 59]. Here we will explore some of them and their relationships.\nWe begin by defining the concept of Tensor Product Expander (TPE)-ε-approximate k-design\n[59]. To simplify the notation, we use U ⊗k,k := U ⊗k ⊗U ∗⊗k.\nDefinition 39 (Tensor Product Expander (TPE)-ε-approximate k-design). Let ε > 0. We say\nthat ν is a TPE ε-approximate k-design if and only if:\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n≤ε.\n(189)\nThe TPE notion of approximate unitary design is particularly advantageous because it can be\n“amplified”. This means that if a distribution of unitaries ν is a TPE λ-approximate k-design,\nthen the distribution of unitaries associated to the product UP · · · U1 of unitaries {Ui}P\ni=1, each\n26\n", "28": "independently distributed according to ν, is a TPE λP-approximate design (as we prove below).\nWe denote by νP this distribution of the product of P unitaries sampled independently by ν. Note\nthat the vectorized moment operator associated with νP is:\nE\nU∼νPU ⊗k,k =\nE\nU1,...,UP∼ν (UP · · · U1)⊗k,k .\n(190)\nWe state the proposition below:\nProposition 40 (Amplification of TPE).\nLet 1 > λ ≥ε > 0. If ν is a TPE λ-approximate\nk-design, then νP is a TPE ε-approximate k-design, where P is a positive integer such that P ≥\n1\nlog(λ−1) log\n\u0000ε−1\u0001\n.\nProof. We have to bound the following quantity\n\r\r\r\r E\nV ∼νP\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n. We first ob-\nserve that the vectorized moment operator associated to νP is:\nE\nV ∼νP\n\u0002\nV ⊗k,k\u0003\n=\nE\nV1,...,VP∼ν (VP · · · V1)⊗k,k =\n\u0010\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\u0011P\n,\n(191)\nwhere we used the independence of U1, . . . , UP. Moreover, we have:\n\u0010\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\u0011P\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\n=\n\u0012\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013P\n,\n(192)\nwhich can be shown by induction. The basis step is trivial for P = 1. Suppose the claim is true\nfor P, then:\n\u0012\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013P+1\n(193)\n=\n\u0012\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013P \u0012\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013\n(194)\n=\n\u0012\u0010\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\u0011P\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013 \u0012\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013\n(195)\n=\n\u0010\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\u0011P+1\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\n,\n(196)\nwhere in the last step we used the invariance of the Haar measure to conclude that\nV k,k\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\n=\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\nV k,k =\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\n.\n(197)\nTherefore we have:\n\r\r\r\r E\nV ∼νP\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n=\n\r\r\r\r\r\n\u0012\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013P\r\r\r\r\r\n∞\n(198)\n≤\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\nP\n∞\n(199)\n≤λP,\n(200)\nwhere in the first step we used Eq.(191) and Eq.(192), in the second step we used the submul-\ntiplicativity4 of the infinity norm and in the last step we used that ν is a TPE λ-approximate\nk-design. By choosing P ≥log(ε)\nlog(λ), we can conclude that νP is a TPE ε-approximate k-design.\nThe previous Proposition implies that if we have a TPE λ-approximate k-design and we want\nto amplify it in order to achieve a TPE with approximation precision ε inverse exponential in the\nnumber of qubits i.e. ε = ˜εd−c where ˜ε, c > 0 and d = 2n, then we can achieve this by choosing\na number of repetitions P ≥\n1\nlog(λ−1)\n\u0000log\n\u0000˜ε−1\u0001\n+ nc log(2)\n\u0001\n. Note that this expression is linear in\nthe number of qubits n if λ = O(1).\nWe will now define the notion of diamond ε-approximate k-design.\n4Note that the submultiplicativity inequality is saturated if\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\nis Hermitian (or more generally normal).\n27\n", "29": "Definition 41 (Diamond ε-approximate k-design). We say that ν is a diamond ε-approximate\nk-design if and only if\n\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢≤ε,\n(201)\nwhere the diamond norm of a superoperator Φ : L(CD) →L(CD) can be defined as\n∥Φ∥♢:= sup\nX̸=0\n∥Φ ⊗I (X)∥1\n∥X∥1\n,\n(202)\nwhere I : L(CD) →L(CD) is the identity channel.\nIt is worth mentioning that the diamond norm distance between two quantum channels has\nan important operational interpretation, as it is closely related to the one-shot distinguishability\nprobability between the two channels [75].\nIn the following Proposition, we will see the relation between the Diamond approximate design\ndefinition and the TPE one previously introduced.\nProposition 42 (Diamond vs TPE).\n• We have:\n\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢≤dk\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n.\n(203)\nThus, if ν is a TPE ε-approximate k-design, then ν is a diamond εdk-approximate k-design.\n• Conversely, we have:\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n≤dk/2\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢.\n(204)\nHence, if ν is a diamond ε-approximate k-design, then ν is a TPE εdk/2-approximate k-\ndesign.\nProof. Let Φ := M(k)\nν\n−M(k)\nµH. We have:\n∥Φ∥♢= sup\nX̸=0\n∥Φ ⊗I (X)∥1\n∥X∥1\n≤\n√\nd2k sup\nX̸=0\n∥Φ ⊗I (X)∥2\n∥X∥1\n≤dk sup\nX̸=0\n∥Φ ⊗I (X)∥2\n∥X∥2\n,\n(205)\nwhere we used that ∥A∥1 ≤\n√\nD∥A∥2 and ∥A∥2 ≤∥A∥1 for A ∈L(CD). Now we observe that:\nsup\nX̸=0\n∥Φ ⊗I (X)∥2\n∥X∥2\n=\nsup\nX : ∥X∥2=1\n∥vec(Φ ⊗I) |X⟩⟩∥2 = ∥vec(Φ ⊗I)∥∞,\n(206)\nwhere in the first equality we used that the Hilbert-Schmidt norm of a matrix is the 2-norm of the\nvectorized matrix and that vec (Φ ⊗I (X)) = vec(Φ ⊗I) |X⟩⟩(see Eq.(105)), while in the third\nequality we used that ∥A |v⟩∥2 =\np\n⟨v| A†A |v⟩and that the supremum of this quantity over all the\nvectors |v⟩that are normalized with respect to the 2-norm is achieved by the largest eigenvalue of\nA†A, which coincides with the largest singular value of A. Now we have:\n\r\rvec\n\u0000U ⊗k (·) U †⊗k ⊗I\n\u0001\r\r\n∞=\n\r\rU ⊗k ⊗I⊗k ⊗U ∗⊗k ⊗I⊗k\r\r\n∞=\n\r\rU ⊗k ⊗U ∗⊗k ⊗I⊗k ⊗I⊗k\r\r\n∞,\n(207)\nwhere in the last step we permuted the tensor products using the p-norm property\n\r\rUAU †\r\r\np =\n∥A∥p with U unitary matrix. Using this we can write:\n\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢≤dk\r\r\rvec\n\u0010\nM(k)\nν\n⊗I\n\u0011\n−vec\n\u0010\nM(k)\nµH ⊗I\n\u0011\r\r\r\n∞\n(208)\n= dk\n\r\r\r\r\n\u0012\nE\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\u0013\n⊗I⊗k ⊗I⊗k\n\r\r\r\r\n∞\n(209)\n= dk\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n,\n(210)\n28\n", "30": "where in the last step we used the p-norm property ∥A ⊗B∥p = ∥A∥p∥B∥p. Hence the first claim\nfollows. Now for the second claim, reviewing in reverse what we have shown for the first claim, we\nhave:\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n= sup\nX̸=0\n∥Φ ⊗I (X)∥2\n∥X∥2\n.\n(211)\nBy using that ∥A∥2 ≤∥A∥1, that ∥A∥1 ≤\n√\nD∥A∥2 for A ∈L(CD) and the definition of diamond\nnorm, we have:\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n≤\n√\ndk\n\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢.\n(212)\nMotivated by Proposition 34, we introduce an alternative notion of approximation based on\nthe frame potential. Notably, the frame potential may be easier to estimate numerically than the\nother approximation notions previously introduced (if approached naively by their definition), as\nit involves computing the trace of matrices in L(Cd), rather than working with matrices defined in\ntensor product spaces. Specifically, we define a frame potential ε-approximate k-design as follows:\nDefinition 43 (Frame potential ε-approximate k-design). We say that ν is a frame potential\nε-approximate k-design if and only if:\nq\nF(k)\nν\n−F(k)\nµH ≤ε.\n(213)\nNote that the argument of this square root is always non-negative (due to Lemma 33).\nWe now establish a relationship between the Frame potential notion of approximate k-design\nand the TPE one.\nProposition 44 (Frame potential vs TPE relation).\n• We have:\nq\nF(k)\nν\n−F(k)\nµH ≤dk\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n.\n(214)\nTherefore, if ν is a TPE ε-approximate k-design, then ν is a frame potential εdk-approximate\nk-design.\n• Conversely, we have:\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n≤\nq\nF(k)\nν\n−F(k)\nµH .\n(215)\nThus, if ν is frame potential ε-approximate k-design, then ν is a TPE ε-approximate k-design.\nProof. By using Lemma (33), we have:\nq\nF(k)\nν\n−F(k)\nµH =\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n2\n.\n(216)\nNow the first claim follows just by using that ∥A∥2 ≤\n√\nD∥A∥∞for all A ∈L(CD), while the\nsecond claim follows by ∥A∥∞≤∥A∥2.\nIn the following, we relate the diamond notion of approximation with the frame potential one.\nProposition 45 (Diamond vs Frame potential).\n29\n", "31": "• We have:\n\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢≤dk\nq\nF(k)\nν\n−F(k)\nµH .\n(217)\nHence, if ν is a frame potential ε-approximate k-design, then ν is a diamond εdk-approximate\nk-design.\n• Conversely, we have:\nq\nF(k)\nν\n−F(k)\nµH ≤d3k/2\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢.\n(218)\nHence, if ν is a diamond ε-approximate k-design, then ν is a frame potential εd3k/2-approximate\nk-design.\nProof. Using Eq.(203), we have:\n\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢≤dk\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n≤dk\nq\nF(k)\nν\n−F(k)\nµH ,\n(219)\nwhere in the last step we used that ∥A∥∞≤∥A∥2 and Eq.(33). Therefore we have shown the first\nclaim. For the second claim, we have:\nq\nF(k)\nν\n−F(k)\nµH ≤\n√\nd2k\n\r\r\r\r E\nV ∼ν\n\u0002\nV ⊗k,k\u0003\n−\nE\nU∼µH\n\u0002\nU ⊗k,k\u0003\r\r\r\r\n∞\n≤dkdk/2\r\r\rM(k)\nν\n−M(k)\nµH\n\r\r\r\n♢,\n(220)\nwhere in the first step we used Lemma 33 and that ∥A∥2 ≤\n√\nD∥A∥∞for A ∈L(CD), while in the\nsecond step we used Eq.(204).\nAnother notion of unitary design approximation was introduced in [59], which we refer to as\nrelative error ε-approximate k-design. This is defined as follows:\nDefinition 46 (Relative error ε-approximate k-design).\nWe say that ν is a relative error ε-\napproximate k-design if and only if\n(1 −ε)M(k)\nν\n≼M(k)\nµH ≼(1 + ε)M(k)\nν ,\n(221)\nwhere A ≼B means that B −A is completely positive, and A and B are linear superoperators.\nFor further details on this approximation notion, see [59]. In [59, 76, 77], it was shown that\none-dimensional local random quantum circuits, which are quantum circuits of n qubits formed by\n2-qubit Haar random gates, of size O\n\u0000n2poly(k)\n\u0001\nare (relative error) ε-approximate k-designs for\nall k ∈O\n\u000020.4n\u0001\n. This result has been extended to higher dimensional quantum circuits in [78].\n9\nExamples and applications\nThis section explores diverse examples and applications where the Haar measure plays a funda-\nmental role in quantum information. We derive well-known formulas that reduce to computing\nmoments over the Haar measure, including the twirling of quantum channels and the average gate\nfidelity. These formulas lay the foundation for various applications, such as Randomized Bench-\nmarking [79].\nMoreover, we show how these moment calculations can be translated into probability statements\nusing concentration inequalities. Concentration inequalities serve as valuable tools for establishing\nrigorous bounds and enhancing our understanding of the statistical behavior associated with Haar\nrandom variables.\nFurthermore, we provide detailed insights into two notable examples showcasing the applica-\ntions of the theory of unitary design. We examine Barren Plateaus [30] in Variational Quantum\nAlgorithms, shedding light on the optimization landscapes encountered in such algorithms. Addi-\ntionally, we delve into Classical Shadow tomography [1], where the theory of unitary design aids\nin designing efficient measurement strategies for reconstructing properties of unknown quantum\nstates.\n30\n", "32": "9.1\nExamples of moment calculations\nWe start by deriving a formula that plays an important role in quantum information, in particular\nin Randomized Benchmarking [18, 79].\nThis formula illustrates that when a unitary operator\nU, randomly chosen from a 2-design, is applied before a quantum channel Φ, followed by the\napplication of its adjoint U †, the resulting output channel resembles a depolarizing channel.\nExample 47 (Twirling of a quantum channel is a depolarizing channel). Let ν a unitary 2-design\ndistribution. Consider a quantum channel Φ : L(Cd) →L(Cd) and a quantum state ρ ∈S\n\u0000Cd\u0001\n.\nThen:\nE\nU∼ν\n\u0002\nU †Φ\n\u0000UρU †\u0001\nU\n\u0003\n= pΦρ + (1 −pΦ) Tr(ρ)I\nd,\n(222)\nwhere the left-hand side represents the so-called “twirling” of Φ, and we define:\npΦ := d2Fe (Φ) −1\nd2 −1\n.\n(223)\nHere, Fe (Φ) denotes the entanglement fidelity given by Fe (Φ) :=\n1\nd2 ⟨Ω| Φ ⊗I(|Ω⟩⟨Ω|) |Ω⟩, where\nI : L(Cd) →L(Cd) represents the identity channel.\nProof. Due to the 2-design property of ν and the fact that the quantity of interest is a second\nmoment quantity, we can average over the Haar measure µH instead of ν. Considering a Kraus\ndecomposition for Φ with operators {Ki}d2\ni=1, we have:\nE\nU∼µH\n\u0002\nU †Φ\n\u0000UρU †\u0001\nU\n\u0003\n=\nd2\nX\ni=1\nE\nU∼µH\nh\nU †KiUρU †K†\ni U\ni\n(224)\n=\nd2\nX\ni=1\nE\nU∼µH Tr2\nh\n(I ⊗ρ)U †⊗2(Ki ⊗K†\ni )U ⊗2F\ni\n(225)\n=\nd2\nX\ni=1\nTr2\n\u0014\n(I ⊗ρ)\nE\nU∼µH\n\u0010\nU ⊗2(Ki ⊗K†\ni )U †⊗2\u0011\nF\n\u0015\n,\n(226)\nwhere in the second equality we used that AB = Tr2 (A ⊗B F), and in the third equality that\nE\nU∼µH [f(U)] =\nE\nU∼µH\n\u0002\nf(U †)\n\u0003\n(Proposition 3) for all integrable functions f. Using Eq.(51) for the\nsecond moment, we have:\nE\nU∼µH\n\nU ⊗2\n\n\nd2\nX\ni=1\nKi ⊗K†\ni\n\nU †⊗2\n\n= cII + cFF,\n(227)\nwhere the coefficients cI and cF are given by:\ncI =\nPd2\ni=1 Tr\n\u0010\nKi ⊗K†\ni\n\u0011\n−d−1 Tr\n\u0010Pd2\ni=1 Ki ⊗K†\ni F\n\u0011\nd2 −1\n=\nPd2\ni=1 | Tr(Ki) |2 −1\nd2 −1\n(228)\ncF =\nTr\n\u0010\nF Pd2\ni=1 Ki ⊗K†\ni\n\u0011\n−d−1 Tr\n\u0010Pd2\ni=1 Ki ⊗K†\ni\n\u0011\nd2 −1\n= d −d−1 Pd2\ni=1 |Tr(Ki)|2\nd2 −1\n,\n(229)\nwhere we used the swap-trick and the fact that Pd2\ni=1 K†\ni Ki = I. We observe that cF = d−1(1−cI).\nTherefore:\nE\nU∼µH\n\u0002\nU †Φ\n\u0000UρU †\u0001\nU\n\u0003\n= Tr2 [(I ⊗ρ) (cI,I + cFF) F]\n(230)\n= cI Tr2 ((I ⊗ρ)F) + 1\nd(1 −cI) Tr2((I ⊗ρ))\n(231)\n= cIρ + (1 −cI) Tr(ρ) I\nd .\n(232)\n31\n", "33": "To conclude the proof, we observe that cI = pΦ, as defined in Eq.(223). This follows from the\nrelationship Pd2\ni=1 |Tr(Ki)|2 = d2Fe (Φ), as it can be easily seen:\nFe (Φ) := 1\nd2 ⟨Ω| Φ ⊗I(|Ω⟩⟨Ω|) |Ω⟩\n(233)\n=\nd2\nX\ni=1\n1\nd2 ⟨Ω| Ki ⊗I |Ω⟩⟨Ω| K†\ni ⊗I |Ω⟩\n(234)\n= 1\nd2\nd2\nX\ni=1\n|Tr(Ki)|2 .\n(235)\nIt is worth noting that this equality can also be understood visually with the help of diagrams.\nIt should be noted that the above formula, along with many other derivations in this tutorial,\nis based on the calculation of the moment operator that depends on the commutant of the unitary\ngroup. However, if we were to compute the Haar expected value defined over another subgroup\non the unitary group instead on the full unitary group, we could still use the same approach by\ncharacterizing the commutant of this subgroup.\nThe following example introduces the concept of average gate fidelity, a measure used to assess\nthe quality of quantum gates [24, 80].\nExample 48 (Average gate fidelity). Let ν be a state 2-design distribution. Consider a quantum\nchannel Φ : L(Cd) →L(Cd) and a unitary channel U (·) = U (·) U †. Then, the average gate fidelity\nis given by:\nE\n|ψ⟩∼ν\n\u0002\n⟨ψ| U† ◦Φ (|ψ⟩⟨ψ|) |ψ⟩\n\u0003\n= dFe\n\u0000U† ◦Φ\n\u0001\n+ 1\nd + 1\n,\n(236)\nwhere U† (·) = U † (·) U represents the adjoint channel of U, and Fe (Φ) :=\n1\nd2 ⟨Ω| Φ ⊗I(|Ω⟩⟨Ω|) |Ω⟩\ncorresponds to the entanglement-fidelity.\nProof. It is worth noting that this formula can be easily derived also from the previous Eq. 222\nwithout the need to explicitly compute any additional Haar moment. However, for the sake of\ncompleteness, we will still perform the derivation without using Eq. 222. We have:\nE\n|ψ⟩∼ν\n\u0002\n⟨ψ| U †Φ (|ψ⟩⟨ψ|) U |ψ⟩\n\u0003\n=\nd2\nX\ni=1\nE\n|ψ⟩∼µH\nh\nTr\n\u0010\n|ψ⟩⟨ψ| U †Ki |ψ⟩⟨ψ| K†\ni U\n\u0011i\n(237)\n=\nd2\nX\ni=1\nE\n|ψ⟩∼µH\nh\nTr\n\u0010\n|ψ⟩⟨ψ|⊗2 \u0010\nU †Ki ⊗K†\ni U\n\u0011\nF\n\u0011i\n(238)\n= Tr\n\nI + F\nd(d + 1)\nd2\nX\ni=1\n\u0010\nU †Ki ⊗K†\ni U\n\u0011\nF\n\n\n(239)\n=\n1\nd(d + 1)\n\n\nd2\nX\ni=1\nTr\n\u0010\nU †KiK†\ni U\n\u0011\n+\nd2\nX\ni=1\nTr\n\u0010\nU †Ki ⊗K†\ni U\n\u0011\n\n\n(240)\n=\n1\nd(d + 1)\n\nd +\nd2\nX\ni=1\n\f\fTr\n\u0000U †Ki\n\u0001\f\f2\n\n,\n(241)\nwhere we used in the first equality the Kraus decomposition of Φ and the fact that ν is a 2-design, in\nthe second equality the swap-trick, in the third equality we used linearity of the expected value and\nthe moment operator formula (95), in the fourth equality again the swap-trick, in the fifth equality\nthe fact that Pd2\ni=1 K†\ni Ki = I. Finally, we observe that Fe\n\u0000U† ◦Φ\n\u0001\n=\n1\nd2\nPd2\ni=1\n\f\fTr\n\u0000U †Ki\n\u0001\f\f2 (see\nEq.(233)), which concludes the proof.\n32\n", "34": "The following example considers a bipartite state ρ ∈S\n\u0000Cd ⊗Cd\u0001\nshared between Alice and\nBob, who apply unitary operations U and U ∗to their respective subsystems, where U is sampled\naccording to a 2-design [26]. The resulting output state can be expressed as a combination of the\nmaximally mixed state and the maximally entangled state d−1 |Ω⟩⟨Ω|, and the coefficients of this\ncombination depend on the overlap of the state ρ with the maximally entangled state d−1 |Ω⟩⟨Ω|.\nExample 49.\nLet ν be a unitary 2-design distribution, and ρ ∈S\n\u0000Cd ⊗Cd\u0001\nbe a quantum state.\nE\nU∼ν\n\u0002\nU ⊗U ∗ρU † ⊗U ∗†\u0003\n= pρ\nI\nd2 + (1 −pρ) |Ω⟩⟨Ω|\nd\n,\n(242)\nwhere pρ := d2 (1−d−1⟨Ω|ρ|Ω⟩)\nd2−1\nwith pρ ∈\nh\n0,\nd2\nd2−1\ni\n.\nProof. By considering the partial transpose over the second subsystem and the 2-design formula\n(Eq.(51)), we obtain:\nE\nU∼ν\n\u0002\nU ⊗U ∗ρU † ⊗U ∗†\u0003\n=\nE\nU∼µH\n\u0002\nU ⊗2ρTBU †⊗2\u0003TB = cI,ρTB ITB + cF,ρTB FTB = cI,ρTB I + cF,ρTB |Ω⟩⟨Ω| ,\n(243)\nwith\ncI,ρTB = Tr\n\u0000ρTB\u0001\n−d−1 Tr\n\u0000ρTBF\n\u0001\nd2 −1\n= 1 −d−1 ⟨Ω| ρ |Ω⟩\nd2 −1\n,\n(244)\nand\ncF,ρTB = Tr\n\u0000FρTB\u0001\n−d−1 Tr\n\u0000ρTB\u0001\nd2 −1\n= ⟨Ω| ρ |Ω⟩−d−1\nd2 −1\n.\n(245)\nNoting that cI,ρTB = pρd−2 and cF,ρTB = (1 −pρ)d−1, we obtain the desired result.\nNow, let us consider the problem of evaluating the expected purity of the reduced state obtained\nfrom a pure state distributed according to a 2-design distribution [81].\nExample 50 (Purity). Consider the complex Hilbert space of two-qudit systems HA ⊗HB of\ndimensions respectively dA = dim(HA) and dB = dim(HB). Given |ψ⟩∈HA ⊗HB, let ρA :=\nTrB (|ψ⟩⟨ψ|). We have:\nE\n|ψ⟩∼ν Tr\n\u0000ρ2\nA\n\u0001\n= dB + dA\ndAdB + 1,\n(246)\nwhere ν is a 2-design distribution.\nProof. We can express the expected value as follows:\nE\n|ψ⟩∼ν Tr\n\u0000ρ2\nA\n\u0001\n=\nE\n|ψ⟩∼µH Tr\n\u0000ρ⊗2\nA FA\n\u0001\n=\nE\n|ψ⟩∼ν Tr\n\u0010\n|ψ⟩⟨ψ|⊗2 (FA ⊗IB)\n\u0011\n,\n(247)\nwhere in the first equality we used the swap-trick on the two copies of the subsystem A and denoted\nwith the subscript A the Flip operator acting on such two copies, and in the second equality we\nused that ρA = TrB(|ψ⟩⟨ψ| IA ⊗IB). In tensor diagrams this is also clear to visualize. Since ν is a\n2-design, we have:\nE\n|ψ⟩∼ν Tr\n\u0000ρ2\nA\n\u0001\n= Tr\n\u0012\nE\n|ψ⟩∼µH\nh\n|ψ⟩⟨ψ|⊗2i\n(FA ⊗IB)\n\u0013\n= Tr\n\u0012\u0014IA ⊗IB + FA ⊗FB\ndAdB(dAdB + 1)\n\u0015\n(FA ⊗IB)\n\u0013\n(248)\n=\n1\ndAdB(dAdB + 1)\n\u0000dAd2\nB + d2\nAdB\n\u0001\n= dB + dA\ndAdB + 1.\n(249)\n33\n", "35": "Now let us consider a system like in the previous example, where dA ≤dB. Since the entan-\nglement entropy S (ρA) := −Tr(ρA log2 ρA) is lower bounded by the 2-Renyi entropy S2 (ρA) :=\n−log2\n\u0000Tr\n\u0000ρ2\nA\n\u0001\u0001\n(Fact 1 in [82]), we have:\nE\n|ψ⟩∼νS(ρA) ≥\nE\n|ψ⟩∼νS2(ρA) = −E\n|ψ⟩∼ν log2\n\u0000Tr\n\u0000ρ2\nA\n\u0001\u0001\n≥−log2\n\u0012\nE\n|ψ⟩∼ν Tr\n\u0000ρ2\nA\n\u0001\u0013\n,\n(250)\nwhere we used Jensen’s inequality with the fact that −log2(x) is a convex function. By using the\nresult from the previous Example 50, we have:\nE\n|ψ⟩∼νS(ρA) ≥log2\n\u0012dAdB + 1\ndB + dA\n\u0013\n≥log2(dA) −log2\n\u0012dB + dA\ndB\n\u0013\n≥log2(dA) −1,\n(251)\nSince S (ρA) ≤log2(dA), we conclude that the expected value of the entanglement entropy of the\nreduced state of a pure state distributed according to a 2-design is close to its maximum value.\nHowever, it is important to note that for finite system sizes, there exists a gap between the exact\naverage entanglement entropy and the maximum value, as demonstrated by Page [83, 84]:\nE\n|ψ⟩∼νS(ρA) =\n1\nln(2)\n \n−dA −1\n2dB\n+\ndAdB\nX\nk=dB+1\n1\nk\n!\n> log2(dA) −\n1\nln(2)\ndA\n2dB\n.\n(252)\nThis value is commonly referred to as the Page entropy. For a more in-depth analysis, see [41],\nwhere higher Renyi-entropies are also discussed.\nExample 51 (Expectation value). Consider a unitary k-design distribution denoted by ν. Let\nO ∈L\n\u0000Cd\u0001\nbe an operator. Then:\nE\n|ψ⟩∼ν ⟨ψ| O |ψ⟩k =\n1\n\u0000k+d−1\nk\n\u0001 Tr\nh\nO⊗kP (d,k)\nsym\ni\n.\n(253)\nIn the case of k = 2, it simplifies to:\nE\n|ψ⟩∼ν ⟨ψ| O |ψ⟩2 =\n1\nd (d + 1)\n\u0010\nTr(O)2 + Tr\n\u0000O2\u0001\u0011\n.\n(254)\nProof. This follows easily from Eq.(95):\nE\n|ψ⟩∼ν ⟨ψ| O |ψ⟩k = Tr\n\u0014\nO⊗k\nE\n|ψ⟩∼ν (|ψ⟩⟨ψ|)⊗k\n\u0015\n(255)\n=\n1\n\u0000k+d−1\nk\n\u0001 Tr\nh\nO⊗kP (d,k)\nsym\ni\n.\n(256)\nIf k = 2, then P (d,k)\nsym\n=\n1\n2 (I + F).\nUsing that Tr\n\u0002\nO⊗2\u0003\n= Tr [O]2 and Tr\n\u0002\nO⊗2F\n\u0003\n= Tr\n\u0002\nO2\u0003\n(swap-trick), leading to the desired expression.\nApplying Example 51 with O = |ϕ⟩⟨ϕ| with |ϕ⟩∈Cd and noting that |ϕ⟩⟨ϕ|⊗k P (d,k)\nsym = |ϕ⟩⟨ϕ|⊗k,\nwe have the following result.\nExample 52. Consider a unitary k-design distribution denoted by ν. Let |ϕ⟩∈Cd. The following\nholds:\nE\n|ψ⟩∼ν\nh\n|⟨ψ|ϕ⟩|2ki\n=\n1\n\u0000k+d−1\nk\n\u0001 ≤k!\ndk .\n(257)\nIn particular, for k = 1, we have\nE\n|ψ⟩∼ν\nh\n|⟨ψ|ϕ⟩|2i\n= 1\nd.\n34\n", "36": "9.2\nConcentration inequalities\nBy utilizing concentration inequalities, such as Markov’s inequality, it is possible to establish a\nconnection between the exponential decay of the expected value with the number of qubits and\na probabilistic statement. Markov’s inequality states that for a non-negative random variable X\nand any ε > 0, the probability that X exceeds ε is bounded by the ratio of the expected value of\nX to ε:\nProb (X ≥ε) ≤E [X]\nε\n.\n(258)\nIn a more general form, if g is a strictly increasing non-negative function, the inequality can be\nexpressed as:\nProb (X ≥ε) ≤E [g(X)]\ng(ε)\n.\n(259)\nTo do an example, consider P ∈{I, X, Y, Z}⊗n\\{I⊗n} where X, Y, Z are Pauli matrices.\nBy\napplying Markov’s inequality and utilizing Example (51), we find that when sampling a (Haar)\nrandom state |ψ⟩, the probability that the expectation value of P exceeds a threshold ε > 0 decays\nexponentially with the number of qubits n:\nProb\n|ψ⟩∼µH (|⟨ψ| P |ψ⟩| ≥ε) = Prob\n|ψ⟩∼µH\n\u0010\n|⟨ψ| P |ψ⟩|2 ≥ε2\u0011\n≤\n1\n(2n + 1)ε2 .\n(260)\nThe same holds if the expected value is taken with respect to a state 2-design.\nAnother concentration inequality that can be particularly useful when analyzing the averages\nover Haar-random states is Levy’s lemma.\nLemma 53 (Levy’s lemma [85]). Consider the set S2d−1 := {v ∈Cd : ∥v∥2 = 1}. Let f : S2d−1 →\nR be a function satisfying the Lipschitz condition |f(v) −f(w)| ≤L∥v −w∥2. For all ε ≥0, we\nhave the probability bound:\nProb\n|ϕ⟩∼µH\n\u0014\f\f\f\ff (ϕ) −\nE\n|ψ⟩∼µH [f (ψ)]\n\f\f\f\f ≥ε\n\u0015\n≤2 exp\n\u0012\n−2dε2\n9π3L2\n\u0013\n.\n(261)\nUsing Levy’s lemma, we can improve the dependence on the number of qubits n to a double\nexponential form compared to what we obtained by a simple application of Markov’s inequality in\nEq. (260), as shown in the next example. However, this double exponential form comes at the cost\nof requiring the state to be drawn from the Haar measure rather than a state 2-design.\nExample 54. Let O ∈Herm\n\u0000Cd\u0001\nbe a Hermitian operator. For all ε ≥0, we have:\nProb\n|ψ⟩∼µH\n\u0012\f\f\f\f⟨ψ| O |ψ⟩−Tr(O)\nd\n\f\f\f\f ≥ε\n\u0013\n≤2 exp\n \n−\ndε2\n18π3∥O∥2\n∞\n!\n.\n(262)\nIn particular, if O is a Pauli string P ∈{I, X, Y, Z}⊗n\\{I⊗n}, we have:\nProb\n|ψ⟩∼µH (|⟨ψ| P |ψ⟩| ≥ε) ≤2 exp\n\u0012\n−2nε2\n18π3\n\u0013\n.\n(263)\nProof. To apply Levy’s lemma, we consider the function f(ψ) = ⟨ψ| O |ψ⟩and compute its expected\nvalue and Lipschitz constant. First, we observe that\nE\n|ψ⟩∼µH[f(ψ)] =\nE\n|ψ⟩∼µH[⟨ψ| O |ψ⟩] = Tr\n\u0014\nO\nE\n|ψ⟩∼µH |ψ⟩⟨ψ|\n\u0015\n= Tr(O)\nd\n.\n(264)\nNext, we determine the Lipschitz constant. We have\n|f(v) −f(w)| = |Tr [(|u⟩⟨u| −|v⟩⟨v|) O]| ≤∥O∥∞∥|u⟩⟨u| −|v⟩⟨v| ∥1\n(265)\n35\n", "37": "where we used the matrix H¨older inequality. We then observe that:\n∥|u⟩⟨u| −|v⟩⟨v|∥1 = 2\nq\n1 −|⟨u|v⟩|2.\n(266)\nThis can be seen by considering Q := |u⟩⟨u| −|v⟩⟨v|. The Hermitian matrix Q has a rank of at\nmost 2, which means it can have at most two non-zero eigenvalues denoted as λ1 and λ2. Since\nthe trace of Q is zero, we have λ2 = −λ1. Additionally, we know that Tr\n\u0000Q2\u0001\n= λ2\n1 + λ2\n2 = 2λ2\n1,\nand Tr\n\u0000Q2\u0001\n= 2(1 −|⟨u|v⟩|2). Therefore, we can conclude that λ1 =\nq\n1 −|⟨u|v⟩|2. The 1-norm of\nQ is given by ∥Q∥1 = |λ1| + |λ2|, which simplifies to ∥Q∥1 = 2\nq\n1 −|⟨u|v⟩|2.\nMoreover, we have the following inequality:\n2\nq\n1 −|⟨u|v⟩|2 ≤2\np\n2 −2 |⟨u|v⟩| ≤2\np\n2 −2 Re(⟨u|v⟩) = 2∥u −v∥2.\n(267)\nThis implies that\n∥|u⟩⟨u| −|v⟩⟨v|∥1 ≤2∥u −v∥2.\n(268)\nHence, we have |f(v) −f(w)| ≤2∥O∥∞∥u −v∥2. By applying Levy’s lemma with the Lipschitz\nconstant of f being 2∥O∥∞, we can conclude.\nCombining Markov’s inequality with higher moments provides a useful trick for computing\nbounds. By using Prob (X ≥ε) ≤Prob\n\u0000Xk ≥εk\u0001\n≤\nE[Xk]\nεk\n, we can derive bounds based on the\nk-th moment of a random variable. This approach is particularly useful in situations involving\nk-unitary designs, where we can often compute moments only up to a given order.\nAnother useful inequality when averaging over the full Haar measure is the following. If α > 0,\nthen Prob [X ≥ε] ≤Prob [exp(αX) ≥exp(αε)] ≤exp(−αε)E [exp(αX)]. To illustrate an applica-\ntion of this, let us consider an example provided also in the notes of Richard Kueng [45].\nExample 55. Consider a n-qubit state |ϕ⟩∈Cd with d = 2n. If we randomly pick a state |ψ⟩\nfrom the Haar measure, the probability that the overlap between |ψ⟩and |ϕ⟩is larger than ε > 0\ndecays double exponentially with the number of qubits n:\nProb\n|ψ⟩∼µH\nh\n|⟨ψ|ϕ⟩|2 ≥ε\ni\n≤2 exp\n\u0012\n−d\n2ε\n\u0013\n.\n(269)\nProof. We have:\nProb\n|ψ⟩∼µH\nh\n|⟨ψ|ϕ⟩|2 ≥ε\ni\n≤Prob\n|ψ⟩∼µH\n\u0014\nexp\n\u0012d\n2 |⟨ψ|ϕ⟩|2\n\u0013\n≥exp\n\u0012d\n2ε\n\u0013\u0015\n(270)\n≤exp\n\u0012\n−d\n2ε\n\u0013\nE\n|ψ⟩∼µH\n\u0014\nexp\n\u0012d\n2 |⟨ψ|ϕ⟩|2\n\u0013\u0015\n(271)\n= exp\n\u0012\n−d\n2ε\n\u0013 ∞\nX\nk=0\n1\nk!\ndk\n2k E |⟨ψ|ϕ⟩|2k\n(272)\n≤exp\n\u0012\n−d\n2ε\n\u0013 ∞\nX\nk=0\n1\n2k = 2 exp\n\u0012\n−d\n2ε\n\u0013\n.\n(273)\nwhere we used the result of Example 52.\nFor more in-depth exploration of the applications of concentration inequalities in the context\nof Haar random unitaries and k-designs, see [39, 45, 49, 86].\n36\n", "38": "9.3\nApplications in Quantum Machine Learning\nLet us now analyze an application of unitary designs in the context of Quantum Machine Learning,\nspecifically in Variational Quantum Algorithms (VQAs) [32]. In VQAs, the problem at hand is\nformulated as the minimization of a cost function. This cost function is typically constructed using\nthe expectation value of an observable, which is estimated on a quantum computer using a prepared\nquantum state that depends on the parameters of the quantum gates. These gate parameters are\noptimized with a classical optimizer with the goal of minimizing the cost function.\nSpecifically, consider a Hilbert space H associated with an n-qubit system of dimension d = 2n.\nIn VQAs, it is customary to define the cost function as:\nC (θ) := Tr\n\u0002\nU(θ)ρ0U †(θ)O\n\u0003\n,\n(274)\nwhere O ∈Herm(H) represents an observable, ρ0 ∈S (H) is a fixed initial state, and U(θ) denotes\nthe parameterized unitary transformation (or ansatze) defined as:\nU(θ) =\nL\nY\nl=1\ne−iθlHl.\n(275)\nHere, L is a positive integer representing the total number of parametrized quantum gates, θl ∈R\nare the parameters associated with the parametrized gates, and Hl ∈Herm(H) are their Hamil-\ntonian generators. In the context of VQAs, it is often assumed that the observable O can be\nexpressed as a linear combination of Pauli operators as:\nO =\nm\nX\ni=1\naiPi,\n(276)\nwhere Pi ∈{I, X, Y, Z}⊗n\\{I⊗n}, m is a positive integer such that m ∈O (poly(n)) and ai ∈R\nare coefficients satisfying ai ∈O (poly(n)) for all i ∈[m]. These assumptions on O also hold for\nall Hl. It is worth noting that the defined observable O satisfies the properties Tr(O) = 0 and\nTr\n\u0000O2\u0001\n∈O (poly(n)2n).\nObservation 56. Let ν be a distribution defined over the set of unitaries {U(θ)}θ∈RL. If ν forms\na 2-design distribution5, then the following properties hold:\nE\nU∼ν [C(θ)] = 0,\nVar\nU∼ν [C(θ)] ∈O\n\u0012poly(n)\n2n\n\u0013\n.\n(277)\nProof. By Eq.(50), we have:\nE\nU∼ν [C(θ)] = Tr\nh\nE\nU∼ν\n\u0000U(θ)ρ0U †(θ)\n\u0001\nO\ni\n= Tr(O)\nd\n= 0,\n(278)\nwhere in the last step we used that O is traceless. The second equality follows from Var\nU∼ν [C(θ)] =\nE\nU∼ν\n\u0002\nC(θ)2\u0003\n−E\nU∼ν [C(θ)]2 and Eq.(51):\nE\nU∼ν\n\u0002\nC(θ)2\u0003\n= Tr\nh\nE\nU∼ν\n\u0000U ⊗2(θ)ρ⊗2\n0 U †⊗2(θ)\n\u0001\nO⊗2i\n(279)\n= cI,ρ⊗2\n0\nTr\n\u0002\nIO⊗2\u0003\n+ cF,ρ⊗2\n0\nTr\n\u0002\nFO⊗2\u0003\n(280)\n= cF,ρ⊗2\n0\nTr\n\u0002\nO2\u0003\n,\n(281)\nwhere cF,ρ⊗2\n0\n=\nTr(Fρ⊗2\n0 )−d−1 Tr(ρ⊗2\n0 )\nd2−1\n=\nTr(ρ2\n0)−2−n\n22n−1\n, and in the last step we used that O is traceless.\nThe proof is concluded by noting that cF,ρ⊗2\n0\n≤\n1\n2n(2n+1) and using that Tr\n\u0002\nO2\u0003\n∈O (poly(n)2n).\n5For an analysis with approximate notions of designs, refer to [31].\n37\n", "39": "We can then apply Chebyshev’s inequality, which states that for all ε > 0 we have:\nProb\nU∼ν\n\u0010\f\f\fC(θ) −E\nU∼ν [C(θ)]\n\f\f\f ≥ε\n\u0011\n≤1\nε2 Var\nU∼ν [C(θ)] .\n(282)\nThis inequality provides an upper bound on the probability of encountering a point in the parameter\nspace where the cost function deviates from its expected value by more than ε. In particular, the\nprobability of finding a point with a cost function larger than ε decays exponentially with the\nnumber of qubits: Prob\nU∼ν (|C(θ)| ≥ε) ∈O\n\u0010\nε−2 poly(n)\n2n\n\u0011\n.\nSimilarly, with slightly more involved calculations, we can show that the exponential decay also\napplies to the variance of the partial derivatives of the cost function. This phenomenon, where\nthe variance of the partial derivatives of the cost function decays exponentially with the number\nof qubits n, is commonly referred to as Barren Plateaus [30].\nTo analyze the partial derivatives of the cost function, we can express the parameterized unitary\ncircuit U(θ) as the product of two unitary operators: U(θ) = UAUB, where UA = QL\nl=µ+1 e−iθlHl\nand UB = Qµ\nl=1 e−iθlHl. Consequently, we can write the partial derivative of the cost function as\nfollows:\n∂µC (θ) = Tr\n\u0002\n(∂µU(θ)) ρ0U †(θ)O\n\u0003\n+ Tr\n\u0002\nU(θ)ρ0\n\u0000∂µU †(θ)\n\u0001\nO\n\u0003\n(283)\n= −i Tr\nh\nUAHµUBρ0U †\nBU †\nAO\ni\n+ i Tr\nh\nUAUBρ0U †\nBHµU †\nAO\ni\n(284)\n= i Tr\nh\nUBρ0U †\nB\nh\nHµ, U †\nAOUA\nii\n,\n(285)\nwhere we denoted by ∂µ the partial derivative with respect to θµ, we used that ∂µU(θ) =\n−iUAHµUB and the cyclicity of the trace.\nUsing this expression for the partial derivative of\nthe cost function, we can prove the following:\nObservation 57. Let νA, νB be probability distributions defined over the sets of unitaries {UA(θ)}θ∈RL−µ\nand {UB(θ)}θ∈Rµ, respectively. Suppose that both νA and νB are 2-designs distributions.6 In this\ncase, the following properties hold:\nE\nUA∼νA\nUB∼νB\n[∂µC(θ)] = 0,\nVar\nUA∼νA\nUB∼νB\n[∂µC(θ)] ∈O\n\u0012poly(n)\n2n −1\n\u0013\n.\n(286)\nProof. We have:\nE\nUA∼νA\nUB∼νB\n[∂µC(θ)] = i Tr\n\u0012\nE\nUB∼νBb\n\u0010\nUBρ0U †\nB\n\u0011 \u0014\nHµ,\nE\nUA∼νA\n\u0010\nU †\nAOUA\n\u0011\u0015\u0013\n(287)\n= i Tr\n\u0012\nE\nUB∼νB\n\u0010\nUBρ0U †\nB\n\u0011 \u0014\nHµ, Tr(O)\nd\nI\n\u0015\u0013\n(288)\n= 0,\n(289)\nwhere we used that O is traceless. Thus, for the variance, we have to compute\nVar\nUA∼νA\nUB∼νB\n[∂µC(θ)] =\nE\nUA∼νA\nUB∼νB\n\u0002\n∂µC(θ)2\u0003\n:\nE\nUA∼νA\nUB∼νB\n\u0002\n∂µC(θ)2\u0003\n= −\nE\nUA∼νA\nUB∼νB\nTr\n\u0010\nUBρ0U †\nB\nh\nHµ, U †\nAOUA\ni\u00112\n(290)\n= −\nE\nUA∼νA\nUB∼νB\nTr\n\u0012\nU ⊗2\nB ρ⊗2\n0 U †⊗2\nB\nh\nHµ, U †\nAOUA\ni⊗2\u0013\n(291)\n= −cF,ρ⊗2\nE\nUA∼νA Tr\n\u0012\nF\nh\nHµ, U †\nAOUA\ni⊗2\u0013\n(292)\n= −cF,ρ⊗2\nE\nUA∼νA Tr\n\u0012h\nHµ, U †\nAOUA\ni2\u0013\n,\n(293)\n6Check [30] for the case when only one between νA and νB is a 2-design.\n38\n", "40": "where in the third equality we utilized Eq.(51) as well as the fact that the trace of a commutator\nis always zero, we have defined cF,ρ⊗2\n0\n=\nTr(Fρ⊗2\n0 )−d−1 Tr(ρ⊗2\n0 )\nd2−1\n=\nTr(ρ2\n0)−d−1\nd2−1\n, and in the last step we\nused the swap-trick. Now, using the fact that:\nTr\n\u0000[A, B]2\u0001\n= 2 Tr(ABAB) −2 Tr(AABB) = 2 Tr\n\u0000A⊗2B⊗2F\n\u0001\n−2 Tr\n\u0000(A2 ⊗I)B⊗2F\n\u0001\n,\n(294)\nwe have:\nE\nUA∼νA\nUB∼νB\n\u0002\n∂µC(θ)2\u0003\n= −cF,ρ⊗2\nE\nUA∼νA Tr\n\u0012h\nHµ, U †\nAOUA\ni2\u0013\n(295)\n= −2cF,ρ⊗2\n\u0012\nTr\n\u0012\nH⊗2\nµ\nE\nUA∼νA(U †\nAOUA)⊗2F\n\u0013\n−Tr\n\u0012\n(H2\nµ ⊗I)\nE\nUA∼νA(U †\nAOUA)⊗2F\n\u0013\u0013\n(296)\n= −2cF,ρ⊗2 \u0000cI,O⊗2 Tr\n\u0000H⊗2\nµ\nI F\n\u0001\n−cI,O⊗2 Tr\n\u0000(H2\nµ ⊗I) I F\n\u0001\n−cF,O⊗2 Tr\n\u0000(H2\nµ ⊗I) F F\n\u0001\u0001\n(297)\n= 2dcF,ρ⊗2cF,O⊗2 Tr\n\u0000H2\nµ\n\u0001\n,\n(298)\nwhere in the third equality we used again Eq.(51) along with the fact that Hµ is traceless, and we\ndefined cF,O⊗2 as cF,O⊗2 =\nTr(FO⊗2)−d−1 Tr(O⊗2)\nd2−1\n=\nTr(O2)\nd2−1 . Thus, we have:\nE\nUA∼νA\nUB∼νB\n\u0002\n∂µC(θ)2\u0003\n≤\n2d\n(d2 −1)2 (Tr\n\u0000ρ2\n0\n\u0001\n−d−1) Tr\n\u0000O2\nµ\n\u0001\nTr\n\u0000H2\nµ\n\u0001\n≤2 Tr\n\u0000O2\u0001\n(2n −1)2\nTr\n\u0000H2\nµ\n\u0001\n2n + 1 .\n(299)\nWe can conclude by using that Tr\n\u0002\nO2\u0003\n∈O(poly(n)2n) and Tr\n\u0002\nH2\nµ\n\u0003\n∈O(poly(n)2n).\nUsing again Chebyshev’s inequality, we can conclude that the probability of finding a point\nin the parameter space with a partial derivative larger than a threshold ε decreases exponentially\nwith the number of qubits. Specifically, we have:\nProb\nUA∼νA\nUB∼νB\n(|∂µC(θ)| ≥ε) ∈O\n\u0012\nε−2 poly(n)\n2n −1\n\u0013\n.\n(300)\nThere are several recent works that leverage Haar integration to compute the concentration of\nvariational cost functions. For example, [87–89] extend the Barren Plateaus diagnosing method\n(variance computation) to the case where the variational circuit lives in a unitary subgroup (over\nwhich it forms 2-designs), which is particularly relevant in the case of symmetric ansatzes [90, 91].\nAdditionally, see [92–94] for cost-concentration analyses in the context of noisy circuits.\n9.4\nClassical shadow tomography\nThe classical shadow protocol, introduced by Huang et al. [1], is a method for predicting properties\nof quantum systems based on the theory of k-designs. In this tutorial, we will explore the classical\nshadow protocol as example of application.\nLet ρ ∈S\n\u0000Cd\u0001\nbe a quantum state of n-qubits, and let O1, . . . , OM ∈Herm\n\u0000Cd\u0001\nbe Hermitian\noperators, where d = 2n. The goal is to estimate Tr(O1ρ), . . . , Tr(OMρ) with a desired accuracy\nand probability of success. We assume that the full classical description of the state ρ is unknown\nbut it can be “queried” on a quantum device multiple times. When the state ρ is queried, a unitary\nU is sampled randomly from a probability distribution µ, and it is applied to ρ. The resulting\nstate, UρU †, is measured in the computational basis {|b⟩}b∈[d]. Information about the sampled\nunitary U and the measurement outcome |b⟩is stored in a classical memory, which can be efficiently\nimplemented for appropriately chosen distributions of unitaries. The state U † |b⟩⟨b| U is referred\nto as a classical snapshot.\nNow, the expected value of the classical snapshot E\n\u0002\nU † |b⟩⟨b| U\n\u0003\nis considered, where U is\ndistributed according to the probability distribution µ, and b is distributed according to the Born’s\nrule probability distribution ⟨b| UρU † |b⟩. More explicitly, we can associate a completely positive\ntrace-preserving linear map M (ρ) to E\n\u0002\nU † |b⟩⟨b| U\n\u0003\n, denoted as measurement channel:\nM (ρ) :=\nd\nX\nb=1\nE\nU∼µ\n\u0002\n⟨b| UρU † |b⟩U † |b⟩⟨b| U\n\u0003\n.\n(301)\n39\n", "41": "Assuming that M is invertible, ˆρ := M−1 \u0000U † |b⟩⟨b| U\n\u0001\nserves as an unbiased estimator for\nρ, meaning E [ˆρ] = ρ. The matrix ˆρ is commonly known as the classical shadow of the state ρ.\nConsequently, ˆoi := Tr(Oiˆρ) is an unbiased estimator for Tr(Oiρ):\nˆoi := Tr\n\u0000OiM−1 \u0000U † |b⟩⟨b| U\n\u0001\u0001\nimplies\nE [ˆoi] = Tr(Oiρ) for all i ∈[M].\n(302)\nFor appropriately chosen probability distributions µ, the estimator ˆoi can be efficiently computed\nclassically.\nTo estimate the number N of copies of ρ (sample complexity) to achieve an additive accuracy\nε > 0 in the estimation of Tr(Oiρ) for all i ∈[M], with a failure probability of at most δ > 0, it is\nimportant to bound the variance of the estimator:\nVar (ˆoi) := E\n\u0002\nˆo2\ni\n\u0003\n−E [ˆoi]2 .\n(303)\nIf the median of means [1, 95] is used as the estimator to post-process the data ˆoi for each i ∈[M],\nthen a number of copies\nN = O\n\u0012log (2M/δ)\nε2\nmax\ni∈[m] [Var (ˆoi)]\n\u0013\n(304)\nis enough to estimate, for each i ∈[m], Tr(Oiρ) up to precision ε with success probability at least\n1 −δ.\nTherefore, the essential ingredients are the construction of the estimator through the inversion\nof the measurement channel M (·) and bounding the variance. Below we observe that the mea-\nsurement channel M (·) is related to the second moment operator over the probability distribution\nµ, while the variance is related to a third moment.\nObservation 58.\nM (ρ) = Tr1\n \n(ρ ⊗I)\n d\nX\nb=1\nE\nU∼µ\nh\nU †⊗2 |b⟩⟨b|⊗2 U ⊗2i!!\n(305)\nVar (ˆoi) = Tr\n \n\u0000ρ ⊗M−1 (Oi) ⊗M−1 (Oi)\n\u0001\n d\nX\nb=1\nE\nU∼µ\nh\nU †⊗3 |b⟩⟨b|⊗3 U ⊗3i!!\n−Tr(Oiρ)2. (306)\nProof. For the measurement channel M(ρ), we have:\nM (ρ) :=\nd\nX\nb=1\nE\nU∼µ\n\u0002\n⟨b| UρU † |b⟩U † |b⟩⟨b| U\n\u0003\n(307)\n=\nd\nX\nb=1\nE\nU∼µ\n\u0002\nTr\n\u0000ρU † |b⟩⟨b| U\n\u0001\nU † |b⟩⟨b| U\n\u0003\n,\n(308)\n= Tr1\n \n(ρ ⊗I)\n d\nX\nb=1\nE\nU∼µ\nh\nU †⊗2 |b⟩⟨b|⊗2 U ⊗2i!!\n.\n(309)\nFor the variance Eq.(303), we need to consider:\nE\n\u0000ˆo2\ni\n\u0001 :=\nd\nX\nb=1\nE\nU∼µ\nh\n⟨b| UρU † |b⟩Tr\n\u0000OiM−1 \u0000U † |b⟩⟨b| U\n\u0001\u00012i\n.\n(310)\nWe first observe that Tr(AM (B)) = Pd\nb=1 E\nU∼µ\n\u0002\n⟨b| UBU † |b⟩⟨b| UAU † |b⟩\n\u0003\n= Tr(M (A) B) for\nall A, B ∈L\n\u0000Cd\u0001\n. This implies that Tr\n\u0000AM−1 (B)\n\u0001\n= Tr\n\u0000M−1 (A) B\n\u0001\nfor all A, B ∈L\n\u0000Cd\u0001\n.\n40\n", "42": "Therefore:\nE\n\u0000ˆo2\ni\n\u0001\n=\nd\nX\nb=1\nE\nU∼µ\nh\n⟨b| UρU † |b⟩Tr\n\u0000M−1 (Oi) U † |b⟩⟨b| U\n\u00012i\n(311)\n=\nd\nX\nb=1\nE\nU∼µ\nh\nTr\n\u0000ρU † |b⟩⟨b| U\n\u0001\nTr\n\u0000M−1 (Oi) U † |b⟩⟨b| U\n\u00012i\n(312)\n= Tr\n \n\u0000ρ ⊗M−1 (Oi) ⊗M−1 (Oi)\n\u0001\n d\nX\nb=1\nE\nU∼µ\nh\nU †⊗3 |b⟩⟨b|⊗3 U ⊗3i!!\n.\n(313)\nWe will now consider the unitary probability distribution that corresponds to the uniform\ndistribution over the Clifford group, that we defined in Eq.(188). It is important to remember that\nthe any unitary of the Clifford group can be implemented with O(n2/ log(n)) elementary gates [72]\nand that there are efficient algorithms to sample uniformly from the Clifford group [73, 74].\nSince the uniform distribution over the Clifford group is an exact 3-design, its first three mo-\nments coincide with those of the Haar measure. Thus, we need to insert in Eq.(305) the formula\nfor the second moment over the Haar measure to find the expression of the measurement channel\nM (ρ) and then invert it.\nObservation 59. The measurement channel is:\nM (ρ) =\n1\nd + 1 (Tr(ρ) I + ρ) .\n(314)\nThus, its inverse is:\nM−1 (ρ) = (d + 1)ρ −Tr(ρ) I.\n(315)\nProof. We have:\nM (ρ) =\nd\nX\nb=1\nTr1\n\u0012\n(ρ ⊗I) E\nU∼µ\nh\nU ⊗2 |b⟩⟨b|⊗2 U †⊗2i\u0013\n(316)\n=\nd\nX\nb=1\nTr1\n\u0012\n(ρ ⊗I)\nI + F\nd(d + 1)\n\u0013\n(317)\n=\n1\nd + 1 (Tr(ρ) I + ρ) ,\n(318)\nwhere in the second equality we utilized Eq.(95) and in the second equality the partial-swap-trick\n(152).\nTherefore, we have that M−1 (ρ) = (d + 1)ρ −Tr(ρ) I, since it can be easily verified that this\nexpression satisfies M−1 (M (ρ)) = ρ.\nTo bound the variance we need to compute a third moment over the Haar measure of the\nunitary group, due to the 3-design property of the Clifford group.\nObservation 60. The variance is bounded by Var (ˆoi) ≤3 Tr\n\u0000O2\ni\n\u0001\n.\nProof. By utilizing Observation 58, we have:\nVar (ˆoi) = Tr\n \n\u0000ρ ⊗M−1 (Oi) ⊗M−1 (Oi)\n\u0001\n d\nX\nb=1\nE\nU∼µ\nh\nU †⊗3 |b⟩⟨b|⊗3 U ⊗3i!!\n−Tr(Oiρ)2. (319)\n41\n", "43": "Using Proposition 3, we know that\nE\nU∼µ\nh\nU †⊗3 |b⟩⟨b|⊗3 U ⊗2i\n=\nE\nU∼µ\nh\nU ⊗3 |b⟩⟨b|⊗3 U †⊗3i\n. Therefore\nby applying Eq.(95), we can express the third moment as:\nE\nU∼µ\nh\nU †⊗3 |b⟩⟨b|⊗3 U ⊗3i\n=\n1\nd(d + 1)(d + 2)\n X\nπ∈S3\nVd(π)\n!\n(320)\n=\n1\nd(d + 1)(d + 2)\n \n+\n+\n+\n+\n+\n!\n,\n(321)\nwhere we used the Tensor Network representation of permutations defined in Section 6. Substi-\ntuting this expression into the first term of Eq.(319), up to a global factor ((d + 1)(d + 2))−1, we\nhave :\nTr\n \n\u0000ρ ⊗M−1 (Oi) ⊗M−1 (Oi)\n\u0001\n X\nπ∈S3\nVd(π)\n!!\n= Tr\n\n\n\n\n\nℳ−1(O)\nℳ−1(O)\nρ\n\n\n+\n+\n+\n+\n+\n\n\n\n\n\n\n\n= Tr(ρ) Tr\n\u0000M−1 (Oi)\n\u0001\nTr\n\u0000M−1 (Oi)\n\u0001\n+ Tr(ρ) Tr\n\u0010\nM−1 (Oi)2\u0011\n+ Tr\n\u0000ρM−1 (Oi)\n\u0001\nTr\n\u0000M−1 (Oi)\n\u0001\n+ Tr\n\u0010\nρM−1 (Oi)2\u0011\n+ Tr\n\u0010\nρM−1 (Oi)2\u0011\n+ Tr\n\u0000ρM−1 (Oi)\n\u0001\nTr\n\u0000M−1 (Oi)\n\u0001\n.\n(322)\nTo simplify the calculations, we can utilize a trick exploited in [1], namely that the variance Var (ˆoi)\nonly depends on the traceless part of the operator Oi, which is defined as O(0)\ni\n:= Oi −Tr(Oi) I\nd.\nThis follows by using that Var (ˆoi) = E\nh\n(ˆoi −Tr(Oiρ))2i\nand observing that ˆoi −Tr(Oiρ) only\ndepends on the traceless part of Oi. In fact, by denoting ˆρ = M−1 \u0000U † |b⟩⟨b| U\n\u0001\n, we have:\nˆoi −Tr(Oiρ) = Tr(Oiˆρ) −Tr(Oiρ) = Tr\n\u0010\nO(0)\ni\nˆρ\n\u0011\n−Tr\n\u0010\nO(0)\ni\nρ\n\u0011\n,\n(323)\nwhere we used that Tr(ˆρ) = 1, since M−1 is trace-preserving (because M is trace-preserving).\nTherefore, by substituting Oi with O(0)\ni\nin Eq.(322), the right-hand side simplifies nicely:\nTr\n \u0010\nρ ⊗M−1 \u0010\nO(0)\ni\n\u0011\n⊗M−1 \u0010\nO(0)\ni\n\u0011\u0011  X\nπ∈S3\nVd(π)\n!!\n(324)\n= 0 + Tr(ρ) Tr\n\u0012\nM−1 \u0010\nO(0)\ni\n\u00112\u0013\n+ 0 + Tr\n\u0012\nρM−1 \u0010\nO(0)\ni\n\u00112\u0013\n+ Tr\n\u0012\nρM−1 \u0010\nO(0)\ni\n\u00112\u0013\n+ 0\n(325)\n= (d + 1)2 Tr\n\u0010\nO(0)2\ni\n\u0011\n+ 2(d + 1)2 Tr\n\u0010\nρO(0)2\ni\n\u0011\n,\n(326)\nwhere we used the fact, according to Eq.(315), that M−1 \u0010\nO(0)\ni\n\u0011\n= (d + 1)O(0)\ni\nis traceless. Sub-\nstituting this expression back into Eq.(319), we have:\nVar (ˆoi) =\n(d + 1)2\n(d + 1)(d + 2)\n\u0010\nTr\n\u0010\nO(0)2\ni\n\u0011\n+ 2 Tr\n\u0010\nρO(0)2\ni\n\u0011\u0011\n−Tr\n\u0010\nO(0)\ni\nρ\n\u00112\n(327)\n≤Tr\n\u0010\nO(0)2\ni\n\u0011\n+ 2 Tr\n\u0010\nρO(0)2\ni\n\u0011\n(328)\n≤3 Tr\n\u0010\nO(0)2\ni\n\u0011\n,\n(329)\nwhere in the second step we used that I −ρ is positive semi-definite, and therefore Tr\n\u0010\nρO(0)2\ni\n\u0011\n≤\nTr\n\u0010\nO(0)2\ni\n\u0011\n.\nFinally, we conclude the proof by noting that Tr\n\u0010\nO(0)2\ni\n\u0011\n≤Tr\n\u0000O2\ni\n\u0001\n.\n42\n", "44": "Using the previous bound on the variance, we have that a number of copies\nN = O\n\u0012\nε−2 log (2M/δ) max\ni∈[m]\n\u0002\nTr\n\u0000O2\ni\n\u0001\u0003\u0013\n(330)\nsuffices to estimate, for each i ∈[m], Tr(Oiρ) up to precision ε and with success probability at\nleast 1 −δ. Therefore, if we want to estimate observables with bounded 2-norm, we have that\nthe protocol is sample-efficient. However, it is important to emphasize that sampling efficiency\ndoes not imply that the protocol described is computationally efficient; in fact, to guarantee it,\nwe must also be able to compute the unbiased estimator in Eq.(302) in a time-efficient manner.\nThis is known for observables that have a particular structure such as stabilizer states (i.e., states\nconstructed by the application of a Clifford circuit to a computational basis state); in this case,\none can take advantage of the fact that computing the overlap between two stabilizer states can\nbe done efficiently in classical computational time [72].\nSee [1] for more details and also for\nchecking the interesting case in which the uniform distribution over the unitary set formed by the\ntensor product of single-qubit Clifford gates is considered, which is better known as “random Pauli\nbasis”. In this case, it turns out that the shadow protocol is both sample and time efficient for local\nobservables like Paulis supported on a constant number of qubits. To explore additional examples\nof unitary distributions, one may refer for example to [96], which discusses the utilization of the\nfermionic Gaussian unitaries distribution, or to [97, 98], where unitary distributions generated by\nlocal random quantum circuits are investigated. Additionally, [99] analyzes Pauli-invariant unitary\nensembles.\n10\nAcknowledgments\nI thank Dax Enshan Koh, Hakop Pashayan, Philippe Faist, Johannes Jakob Meyer, Janek Denzler,\nLorenzo Leone, Ellen Derbishire, Alexander Nietner, Francesco Anna Mele and Carlos Bravo-Prieto\nfor insightful discussions and feedback. I am also grateful to the QML journal club of Jens Eisert’s\ngroup for providing me the motivation to write this tutorial.\nReferences\n[1]\nH.-Y. Huang, R. Kueng, and J. Preskill, “Predicting many properties of a quantum system\nfrom very few measurements”, Nature Physics 16, 1050–1057 (2020) doi: 10.1038/s41567-\n020-0932-7.\n[2]\nJ. Haah, A. W. Harrow, Z. Ji, X. Wu, and N. Yu, “Sample-optimal tomography of quantum\nstates”, IEEE Transactions on Information Theory, 1–1 (2017) doi: 10.1109/tit.2017.\n2719044.\n[3]\nA. Elben, S. T. Flammia, H.-Y. Huang, R. Kueng, J. Preskill, B. Vermersch, and P. Zoller,\n“The randomized measurement toolbox”, Nature Reviews Physics 5, 9–24 (2022) doi: 10.\n1038/s42254-022-00535-2.\n[4]\nR. O’Donnell and J. Wright, Efficient quantum tomography, 2015, doi: https://doi.org/\n10.48550/arXiv.1508.01907.\n[5]\nR. Kueng, H. Rauhut, and U. Terstiege, “Low rank matrix recovery from rank one measure-\nments”, Applied and Computational Harmonic Analysis 42, 88–116 (2017) doi: 10.1016/j.\nacha.2015.07.007.\n[6]\nA. Elben, R. Kueng, H.-Y. R. Huang, R. van Bijnen, C. Kokail, M. Dalmonte, P. Calabrese,\nB. Kraus, J. Preskill, P. Zoller, and B. Vermersch, “Mixed-state entanglement from local\nrandomized measurements”, Phys. Rev. Lett. 125, 200501 (2020) doi: 10.1103/PhysRevLe\ntt.125.200501.\n[7]\nM Gut¸˘a, J Kahn, R Kueng, and J. A. Tropp, “Fast state tomography with optimal error\nbounds”, Journal of Physics A: Mathematical and Theoretical 53, 204001 (2020) doi: 10.\n1088/1751-8121/ab8111.\n43\n", "45": "[8]\nP. Cie´sli´nski, S. Imai, J. Dziewior, O. G¨uhne, L. Knips, W. Laskowski, J. Meinecke, T.\nPaterek, and T. V´ertesi, Analysing quantum systems with randomised measurements, 2023,\ndoi: https://doi.org/10.48550/arXiv.2307.01251.\n[9]\nA. W. Harrow and S. Mehraban, “Approximate unitary t-designs by short random quan-\ntum circuits using nearest-neighbor and long-range gates”, Communications in Mathematical\nPhysics 401, 1531–1626 (2023) doi: 10.1007/s00220-023-04675-z.\n[10]\nA. Bouland, B. Fefferman, C. Nirkhe, and U. Vazirani, “On the complexity and verification\nof quantum random circuit sampling”, Nature Physics 15, 159–163 (2018) doi: 10.1038/\ns41567-018-0318-2.\n[11]\nR. Movassagh, Quantum supremacy and random circuits, 2020, doi: https://doi.org/10.\n48550/arXiv.1909.06210.\n[12]\nA. M. Dalzell, N. Hunter-Jones, and F. G. S. L. Brand˜ao, Random quantum circuits transform\nlocal noise into global white noise, 2021, doi: https://doi.org/10.48550/arXiv.2111.\n14907.\n[13]\nD. Hangleiter, J. Bermejo-Vega, M. Schwarz, and J. Eisert, “Anticoncentration theorems for\nschemes showing a quantum speedup”, Quantum 2, 65 (2018) doi: 10.22331/q-2018-05-\n22-65.\n[14]\nA. Bouland, J. F. Fitzsimons, and D. E. Koh, “Complexity Classification of Conjugated\nClifford Circuits”, in 33rd computational complexity conference (ccc 2018), Vol. 102, edited\nby R. A. Servedio, Leibniz International Proceedings in Informatics (LIPIcs) (2018), 21:1–\n21:25, doi: 10.4230/LIPIcs.CCC.2018.21.\n[15]\nH. Pashayan, S. D. Bartlett, and D. Gross, “From estimation of quantum probabilities to\nsimulation of quantum circuits”, Quantum 4, 223 (2020) doi: 10.22331/q-2020-01-13-223.\n[16]\nD. Hangleiter and J. Eisert, “Computational advantage of quantum random sampling”, Re-\nviews of Modern Physics 95, doi: 10.1103/revmodphys.95.035001 (2023) doi: 10.1103/\nrevmodphys.95.035001.\n[17]\nS. Popescu, A. J. Short, and A. Winter, “Entanglement and the foundations of statistical\nmechanics”, Nature Physics 2, 754–758 (2006) doi: 10.1038/nphys444.\n[18]\nJ. Emerson, R. Alicki, and K. ˙Z yczkowski, “Scalable noise estimation with random unitary\noperators”, Journal of Optics B: Quantum and Semiclassical Optics 7, S347–S352 (2005)\ndoi: 10.1088/1464-4266/7/10/021.\n[19]\nJ. Helsen, I. Roth, E. Onorati, A. Werner, and J. Eisert, “General framework for randomized\nbenchmarking”, PRX Quantum 3, doi: 10.1103/prxquantum.3.020357 (2022) doi: 10.\n1103/prxquantum.3.020357.\n[20]\nE. Magesan, J. M. Gambetta, and J. Emerson, “Scalable and robust randomized benchmark-\ning of quantum processes”, Phys. Rev. Lett. 106, 180504 (2011) doi: 10.1103/PhysRevLett.\n106.180504.\n[21]\nD. DiVincenzo, D. Leung, and B. Terhal, “Quantum data hiding”, IEEE Transactions on\nInformation Theory 48, 580–598 (2002) doi: 10.1109/18.985948.\n[22]\nA. Harrow, P. Hayden, and D. Leung, “Superdense coding of quantum states”, Physical\nReview Letters 92, doi: 10.1103/physrevlett.92.187901 (2004) doi: 10.1103/physrevl\nett.92.187901.\n[23]\nA. Ambainis, J. Bouda, and A. Winter, “Nonmalleable encryption of quantum information”,\nJournal of Mathematical Physics 50, 042106 (2009) doi: 10.1063/1.3094756.\n[24]\nM. Horodecki, P. Horodecki, and R. Horodecki, “General teleportation channel, singlet frac-\ntion, and quasidistillation”, Phys. Rev. A 60, 1888–1898 (1999) doi: 10.1103/PhysRevA.\n60.1888.\n[25]\nA. Abeyesinghe, I. Devetak, P. Hayden, and A. Winter, “The mother of all protocols: re-\nstructuring quantum information’s family tree”, Proceedings of the Royal Society A: Math-\nematical, Physical and Engineering Sciences 465, 2537–2563 (2009) doi: 10.1098/rspa.\n2009.0202.\n44\n", "46": "[26]\nM. Horodecki and P. Horodecki, “Reduction criterion of separability and limits for a class of\ndistillation protocols”, Phys. Rev. A 59, 4206–4216 (1999) doi: 10.1103/PhysRevA.59.4206.\n[27]\nJ. Batle-Vallespir, Characterization of quantum entangled states and information measures,\n2006, doi: https://doi.org/10.48550/arXiv.quant-ph/0603124.\n[28]\nK. ˙Zyczkowski, P. Horodecki, A. Sanpera, and M. Lewenstein, “Volume of the set of separable\nstates”, Physical Review A 58, 883–892 (1998) doi: 10.1103/physreva.58.883.\n[29]\nK. Zyczkowski and H.-J. Sommers, “Induced measures in the space of mixed quantum states”,\nJournal of Physics A: Mathematical and General 34, 7111–7125 (2001) doi: 10.1088/0305-\n4470/34/35/335.\n[30]\nJ. R. McClean, S. Boixo, V. N. Smelyanskiy, R. Babbush, and H. Neven, “Barren plateaus\nin quantum neural network training landscapes”, Nature Communications 9, doi: 10.1038/\ns41467-018-07090-4 (2018) doi: 10.1038/s41467-018-07090-4.\n[31]\nZ. Holmes, K. Sharma, M. Cerezo, and P. J. Coles, “Connecting ansatz expressibility to\ngradient magnitudes and barren plateaus”, PRX Quantum 3, doi: 10.1103/prxquantum.3.\n010313 (2022) doi: 10.1103/prxquantum.3.010313.\n[32]\nM. Cerezo, A. Arrasmith, R. Babbush, S. C. Benjamin, S. Endo, K. Fujii, J. R. McClean,\nK. Mitarai, X. Yuan, L. Cincio, and P. J. Coles, “Variational quantum algorithms”, Nature\nReviews Physics 3, 625–644 (2021) doi: 10.1038/s42254-021-00348-9.\n[33]\nJ. Napp, Quantifying the barren plateau phenomenon for a model of unstructured variational\nans¨atze, 2022, doi: https://doi.org/10.48550/arXiv.2203.06174.\n[34]\nB. Skinner, J. Ruhman, and A. Nahum, “Measurement-induced phase transitions in the\ndynamics of entanglement”, Phys. Rev. X 9, 031009 (2019) doi: 10.1103/PhysRevX.9.\n031009.\n[35]\nM. P. Fisher, V. Khemani, A. Nahum, and S. Vijay, “Random quantum circuits”, Annual\nReview of Condensed Matter Physics 14, 335–379 (2023) doi: 10.1146/annurev-conmatph\nys-031720-030658.\n[36]\nA. Chan, A. De Luca, and J. T. Chalker, “Solution of a minimal model for many-body\nquantum chaos”, Phys. Rev. X 8, 041019 (2018) doi: 10.1103/PhysRevX.8.041019.\n[37]\nP. Hayden and J. Preskill, “Black holes as mirrors: quantum information in random sub-\nsystems”, Journal of High Energy Physics 2007, 120–120 (2007) doi: 10 . 1088 / 1126 -\n6708/2007/09/120.\n[38]\nJ. Haferkamp, P. Faist, N. B. T. Kothakonda, J. Eisert, and N. Y. Halpern, “Linear growth\nof quantum circuit complexity”, Nature Physics 18, 528–532 (2022) doi: 10.1038/s41567-\n022-01539-6.\n[39]\nF. G. Brand˜ao, W. Chemissany, N. Hunter-Jones, R. Kueng, and J. Preskill, “Models of\nquantum complexity growth”, PRX Quantum 2, doi: 10.1103/prxquantum.2.030316\n(2021) doi: 10.1103/prxquantum.2.030316.\n[40]\nD. A. Roberts and B. Yoshida, “Chaos and complexity by design”, Journal of High Energy\nPhysics 2017, doi: 10.1007/jhep04(2017)121 (2017) doi: 10.1007/jhep04(2017)121.\n[41]\nZ.-W. Liu, S. Lloyd, E. Zhu, and H. Zhu, “Entanglement, quantum randomness, and complex-\nity beyond scrambling”, Journal of High Energy Physics 2018, doi: 10.1007/jhep07(2018)\n041 (2018) doi: 10.1007/jhep07(2018)041.\n[42]\nE. Onorati, O. Buerschaper, M. Kliesch, W. Brown, A. H. Werner, and J. Eisert, “Mixing\nproperties of stochastic quantum hamiltonians”, Communications in Mathematical Physics\n355, 905–947 (2017) doi: 10.1007/s00220-017-2950-6.\n[43]\nO. Shtanko and R. Movassagh, “Stability of periodically driven topological phases against\ndisorder”, Phys. Rev. Lett. 121, 126803 (2018) doi: 10.1103/PhysRevLett.121.126803.\n[44]\nR. Movassagh and A. Edelman, “Density of states of quantum spin systems from isotropic\nentanglement”, Phys. Rev. Lett. 107, 097205 (2011) doi: 10.1103/PhysRevLett.107.\n097205.\n45\n", "47": "[45]\nR. J. Kueng and J. Tropp, Quantum and classical information processing with tensors, 2019,\ndoi: https://doi.org/10.7907/my9r-p178.\n[46]\nM. Christandl, The structure of bipartite quantum states - insights from group theory and\ncryptography, 2006, doi: https://doi.org/10.48550/arXiv.quant-ph/0604183.\n[47]\nM. Kliesch and I. Roth, “Theory of quantum system certification”, PRX Quantum 2, doi:\n10.1103/prxquantum.2.010201 (2021) doi: 10.1103/prxquantum.2.010201.\n[48]\nJ. Haferkamp, “Randomness and complexity in random complex quantum systems”, Disser-\ntation (2022), doi: http://dx.doi.org/10.17169/refubium-38286.\n[49]\nR. A. Low, Pseudo-randomness and learning in quantum computation, 2010, doi: https:\n//doi.org/10.48550/arXiv.1006.5227.\n[50]\nJ. Watrous, The theory of quantum information (Cambridge University Press, 2018), doi:\n10.1017/9781316848142.\n[51]\nB. Collins and P. ´Sniady, “Integration with respect to the haar measure on unitary, orthogonal\nand symplectic group”, Communications in Mathematical Physics 264, 773–795 (2006) doi:\n10.1007/s00220-006-1554-3.\n[52]\nB. Simon, “Representations of finite and compact groups”, in (1995), doi: https://doi.\norg/10.1090/gsm/010.\n[53]\nR. Goodman and N. Wallach, “Symmetry, representations, and invariants”, in (2009), doi:\nhttps://doi.org/10.1007/978-0-387-79852-3.\n[54]\nL. Zhang, Matrix integrals over unitary groups: an application of schur-weyl duality, 2015,\ndoi: https://doi.org/10.48550/arXiv.1408.3782.\n[55]\nB. Collins, Moments and cumulants of polynomial random variables on unitary groups, the\nitzykson-zuber integral and free probability, 2002, doi: https://doi.org/10.48550/arXiv.\nmath-ph/0205010.\n[56]\nD. Weingarten, “Asymptotic Behavior of Group Integrals in the Limit of Infinite Rank”, J.\nMath. Phys. 19, 999 (1978) doi: 10.1063/1.523807.\n[57]\nB. Collins, S. Matsumoto, and J. Novak, “The weingarten calculus”, Notices of the American\nMathematical Society 69, 1 (2022) doi: 10.1090/noti2474.\n[58]\nG. K¨ostenberger, Weingarten calculus, 2021, doi: https://doi.org/10.48550/arXiv.\n2101.00921.\n[59]\nF. G. S. L. Brand˜ao, A. W. Harrow, and M. Horodecki, “Local random quantum circuits are\napproximate polynomial-designs”, Communications in Mathematical Physics 346, 397–434\n(2016) doi: 10.1007/s00220-016-2706-8.\n[60]\nD. Garc´ıa-Mart´ın, M. Larocca, and M. Cerezo, Deep quantum neural networks form gaussian\nprocesses, 2023, doi: https://doi.org/10.48550/arXiv.2305.09957.\n[61]\nA. W. Harrow, The church of the symmetric subspace, 2013, doi: https://doi.org/10.\n48550/arXiv.1308.6595.\n[62]\nJ. C. Bridgeman and C. T. Chubb, “Hand-waving and interpretive dance: an introductory\ncourse on tensor networks”, Journal of Physics A: Mathematical and Theoretical 50, 223001\n(2017) doi: 10.1088/1751-8121/aa6dc3.\n[63]\nM. A. Nielsen and I. L. Chuang, Quantum computation and quantum information: 10th\nanniversary edition (Cambridge University Press, 2010), doi: 10.1017/CBO9780511976667.\n[64]\nC. Dankert, R. Cleve, J. Emerson, and E. Livine, “Exact and approximate unitary 2-designs\nand their application to fidelity estimation”, Physical Review A 80, doi: 10.1103/physreva.\n80.012304 (2009) doi: 10.1103/physreva.80.012304.\n[65]\nD. Gross, K. Audenaert, and J. Eisert, “Evenly distributed unitaries: on the structure of\nunitary designs”, Journal of Mathematical Physics 48, doi: 10.1063/1.2716992 (2007) doi:\n10.1063/1.2716992.\n[66]\nA. Roy and A. J. Scott, “Unitary designs and codes”, Designs, Codes and Cryptography 53,\n13–31 (2009) doi: 10.1007/s10623-009-9290-2.\n46\n", "48": "[67]\nA. Ambainis and J. Emerson, Quantum t-designs: t-wise independence in the quantum world,\n2007, doi: https://doi.org/10.48550/arXiv.quant-ph/0701126.\n[68]\nD. Gottesman, The heisenberg representation of quantum computers, 1998, doi: https://\ndoi.org/10.48550/arXiv.quant-ph/9807006.\n[69]\nZ. Webb, The clifford group forms a unitary 3-design, 2016, doi: https://doi.org/10.\n48550/arXiv.1510.02769.\n[70]\nH. Zhu, “Multiqubit clifford groups are unitary 3-designs”, Physical Review A 96, doi:\n10.1103/physreva.96.062336 (2017) doi: 10.1103/physreva.96.062336.\n[71]\nH. Zhu, R. Kueng, M. Grassl, and D. Gross, The clifford group fails gracefully to be a unitary\n4-design, 2016, doi: https://doi.org/10.48550/arXiv.1609.08172.\n[72]\nS. Aaronson and D. Gottesman, “Improved simulation of stabilizer circuits”, Physical Review\nA 70, doi: 10.1103/physreva.70.052328 (2004) doi: 10.1103/physreva.70.052328.\n[73]\nE. Van Den Berg, “A simple method for sampling random clifford operators”, in 2021 ieee\ninternational conference on quantum computing and engineering (qce) (2021), pp. 54–59,\ndoi: 10.1109/QCE52317.2021.00021.\n[74]\nR. Koenig and J. A. Smolin, “How to efficiently select an arbitrary clifford group element”,\nJournal of Mathematical Physics 55, 122202 (2014) doi: 10.1063/1.4903507.\n[75]\nM. Wilde, “Quantum information theory”, in\n(Cambridge University Press, 2016), doi:\n10.1017/9781316809976.001.\n[76]\nJ. Haferkamp, “Random quantum circuits are approximate unitary t-designs in depth O\n\u0000nt5+o(1)\u0001\n”,\nQuantum 6, 795 (2022) doi: 10.22331/q-2022-09-08-795.\n[77]\nA. W. Harrow and R. A. Low, “Random quantum circuits are approximate 2-designs”, Com-\nmunications in Mathematical Physics 291, 257–302 (2009) doi: 10.1007/s00220- 009-\n0873-6.\n[78]\nA. W. Harrow and S. Mehraban, “Approximate unitary t-designs by short random quan-\ntum circuits using nearest-neighbor and long-range gates”, Communications in Mathematical\nPhysics 401, 1531–1626 (2023) doi: 10.1007/s00220-023-04675-z.\n[79]\nE. Knill, D. Leibfried, R. Reichle, J. Britton, R. B. Blakestad, J. D. Jost, C. Langer, R. Ozeri,\nS. Seidelin, and D. J. Wineland, “Randomized benchmarking of quantum gates”, Physical\nReview A 77, doi: 10.1103/physreva.77.012307 (2008) doi: 10.1103/physreva.77.\n012307.\n[80]\nM. A. Nielsen, “A simple formula for the average gate fidelity of a quantum dynamical\noperation”, Physics Letters A 303, 249–252 (2002) doi: 10.1016/s0375-9601(02)01272-0.\n[81]\nE. Lubkin and T. Lubkin, “Average quantal behavior and thermodynamic isolation”, Inter-\nnational Journal of Theoretical Physics 32, 933–943 (1993) doi: 10.1007/BF01215300.\n[82]\nE. Ram and I. Sason, On renyi entropy power inequalities, 2016, doi: https://doi.org/\n10.48550/arXiv.1601.06555.\n[83]\nD. N. Page, “Average entropy of a subsystem”, Physical Review Letters 71, 1291–1294 (1993)\ndoi: 10.1103/physrevlett.71.1291.\n[84]\nP. Hayden, D. W. Leung, and A. Winter, “Aspects of generic entanglement”, Communications\nin Mathematical Physics 265, 95–117 (2006) doi: 10.1007/s00220-006-1535-6.\n[85]\nM. Ledoux, “The concentration of measure phenomenon”, AMS Surveys and Monographs\n89, doi: https://doi.org/10.1090/surv/089 (2001) doi: https://doi.org/10.1090/\nsurv/089.\n[86]\nR. A. Low, “Large deviation bounds for k-designs”, Proceedings of the Royal Society A:\nMathematical, Physical and Engineering Sciences 465, 3289–3308 (2009) doi: 10.1098/\nrspa.2009.0232.\n[87]\nM. Larocca, P. Czarnik, K. Sharma, G. Muraleedharan, P. J. Coles, and M. Cerezo, “Diag-\nnosing barren plateaus with tools from quantum optimal control”, Quantum 6, 824 (2022)\ndoi: 10.22331/q-2022-09-29-824.\n47\n", "49": "[88]\nE. Fontana, D. Herman, S. Chakrabarti, N. Kumar, R. Yalovetzky, J. Heredge, S. H. Suresh-\nbabu, and M. Pistoia, The adjoint is all you need: characterizing barren plateaus in quantum\nans¨atze, 2023, doi: https://doi.org/10.48550/arXiv.2309.07902.\n[89]\nM. Ragone, B. N. Bakalov, F. Sauvage, A. F. Kemper, C. O. Marrero, M. Larocca, and M.\nCerezo, A unified theory of barren plateaus for deep parametrized quantum circuits, 2023,\ndoi: https://doi.org/10.48550/arXiv.2309.09342.\n[90]\nM. Larocca, F. Sauvage, F. M. Sbahi, G. Verdon, P. J. Coles, and M. Cerezo, “Group-invariant\nquantum machine learning”, PRX Quantum 3, doi: 10.1103/prxquantum.3.030341 (2022)\ndoi: 10.1103/prxquantum.3.030341.\n[91]\nJ. J. Meyer, M. Mularski, E. Gil-Fuster, A. A. Mele, F. Arzani, A. Wilms, and J. Eisert,\n“Exploiting symmetry in variational quantum machine learning”, PRX Quantum 4, doi:\n10.1103/prxquantum.4.010328 (2023) doi: 10.1103/prxquantum.4.010328.\n[92]\nS. Wang, E. Fontana, M. Cerezo, K. Sharma, A. Sone, L. Cincio, and P. J. Coles, “Noise-\ninduced barren plateaus in variational quantum algorithms”, Nature Communications 12,\ndoi: 10.1038/s41467-021-27045-6 (2021) doi: 10.1038/s41467-021-27045-6.\n[93]\nP. Singkanipa and D. A. Lidar, Beyond unital noise in variational quantum algorithms: noise-\ninduced barren plateaus and fixed points, 2024, doi: https://doi.org/10.48550/arXiv.\n2402.08721.\n[94]\nA. A. Mele, A. Angrisani, S. Ghosh, S. Khatri, J. Eisert, D. S. Fran¸ca, and Y. Quek, Noise-\ninduced shallow circuits and absence of barren plateaus, 2024, doi: https://doi.org/10.\n48550/arXiv.2403.13927.\n[95]\nD. E. Koh and S. Grewal, “Classical shadows with noise”, Quantum 6, 776 (2022) doi:\n10.22331/q-2022-08-16-776.\n[96]\nK. Wan, W. J. Huggins, J. Lee, and R. Babbush, “Matchgate shadows for fermionic quantum\nsimulation”, Communications in Mathematical Physics 404, 629–700 (2023) doi: 10.1007/\ns00220-023-04844-0.\n[97]\nH.-Y. Hu, S. Choi, and Y.-Z. You, “Classical shadow tomography with locally scrambled\nquantum dynamics”, Phys. Rev. Res. 5, 023027 (2023) doi: 10.1103/PhysRevResearch.5.\n023027.\n[98]\nC. Bertoni, J. Haferkamp, M. Hinsche, M. Ioannou, J. Eisert, and H. Pashayan, Shallow\nshadows: expectation estimation using low-depth random clifford circuits, 2023, doi: https:\n//doi.org/10.48550/arXiv.2209.12924.\n[99]\nK. Bu, D. E. Koh, R. J. Garcia, and A. Jaffe, “Classical shadows with pauli-invariant unitary\nensembles”, npj Quantum Information 10, doi: 10.1038/s41534-023-00801-w (2024) doi:\n10.1038/s41534-023-00801-w.\n48\n"}